{"body_text": "What is Hidan's Source of Power? \nHidan is probably the most misunderstood character in Naruto. He has the ability to survive pretty much anything (including decapitation), and is able to remote-injure opponents whose blood he tasted, and while he's inside his cursed circle.\nWhere did this power come from? What kind of technique is that? Every single technique used in Naruto so far has been explained to some degree, besides this one.\nDo anyone has some information to shed light on the technique? From the Data Book perhaps?\n", "post_id": "209", "cluster_id": 3, "novelty": true, "order": 0}
{"body_text": "Is that jutsu really the Edo Tensei? I know the title probably needs to be changed, but I wasn't sure how to put it spoiler-free.\nThe question follows as a block, for its 'spoilery' nature for anyone who hasn't seen Naruto Shippuden up to episode 290.\n\n In this episode Kabuto summons several shinobi using Edo Tensei. For this jutsu we know that a living body to act as receptacle and a piece of DNA from the one being revived are needed. The summoner will then use a tag to control the summoned soul's personality.\n Kabuto explains to Naruto and Sakura that the water in the \"Hole\" is so rich that he was able to create life with those weird snakes embedded with Orochimaru's chakra. I assume this means that the body that comes out of the water is the living body that serves as sacrifice. I assume this because Hidan's eyes look like those of the ones summoned by Edo Tensei. And afterwards Kabuto inserts a tag in this Hidan, to control his personality.\n Considering that Hidan was really summoned by Edo Tensei, however, there is the fact that his body does not look 'complete'. But then again, I don't think we've ever seen a naked Edo Tensei summoned body, so we cannot be sure if this is normal or not.\n\n So basically:\nIs this some weird jutsu that really looks like Edo Tensei?\nOr should we assume that Hidan as died and this was really Edo Tensei? (It is possible that Hidan is dead, if you take into consideration what is explained in this answer)\n\n", "post_id": "451", "cluster_id": 3, "novelty": true, "order": 1}
