{"body_text": "Where do Kekkei Genkai abilities (genetic abilities) originate from? In Naruto there is a group of abilities called Kekkei Genkai (血継限界). They are told to be \"genetic\" abilities which are (usually) passed down genetically within specific clans. \nNotably, the eye techniques (Dōjutsu, 瞳術), such as sharingan, are also a subset of those.\nHow did those abilities first appear? Did they appear naturally, or were they made on purpose as a result of experiments? \n", "post_id": "305", "cluster_id": 20, "novelty": true, "order": 0}
{"body_text": "How is a technique categorized as a Kekkei Genkai? During the Land of Waves arc, Kekkei Genkai is defined as techniques which are unique to a clan and passed down through the bloodline. After timeskip, it is touched upon again, and is now defined as a technique which combines two elements. Looking back at the Land of Waves arc, Haku's Ice Release satisfies this definition as well. \nHowever, Sharingan and Byakugan are also called Kekkei Genkai, although they do not combine any elements. Later, Terumi Mei is showed to use Lava release and Boil release, and they are both considered Kekkei genkai, although it appears that this is something unique she achieved, not passed down through bloodline.\nThus, the term kekkei genkai seems to be used in various contexts to mean either:\n\nBloodline techniques passed down through generations, but not involving combining basic elements (Sharingan, Byakugan users)  \nTechniques combining basic elements, but not passed down through bloodline. (Terumi Mei, and a few others)  \nCombining basic elements and passed down through bloodline (Haku)\n\nWhat exactly does it mean?\n\nEdit It looks like people have not understood the question. Let me try again.\n\nDoes kekkei genkai mean:\nA. techniques passed down through blood.\nB. techniques which combine basic elements.\nC. Both A and B.\nThe answers as well the commenter below seem to have assumed \"A\". To make it even easier, here's a related follow-up question: \"If Naruto learns Lightning Release, and then combines with his Wind Release, would that be kekkei genkai or not?\"\n", "post_id": "2173", "cluster_id": 20, "novelty": true, "order": 1}
