{"body_text": "What particular anime first showcased crossovers? Well, the question says it all.  I'm really interested in the idea of cross-overs in anime. I want to know which particular company or manga group artists started the idea of cross-overs and what particular anime(s) showed cross-overs (in anime history) and the characters involved in it.\nAs I have searched from Wikipedia:\nI think that defines cross-overs in anime as well 'cause anime and manga stories are mostly fictional, hence, may work the same way in the anime industry. Correct me if I'm wrong but the general idea I have about it is that they can only do cross-overs if they (anime characters and anime) are in the same company or copyright (e.g. Clamp). \nSo far, most of Clamp animes did cross-overs like the cross-over of the characters of Cardcaptor Sakura, Chobits, Clamp School Detectives (same names and faces but with different roles) to Tsubasa Reservoir Chronicle. Another is the popular cross-over of characters and even story of Tsubasa Reservoir Chronicle, XXXHolic, Kobato and several Clamp-made animes (that I might have forgot to mention). Tsubasa Reservoir Chronicle focuses in the cross-over ideas since they travel different worlds and meet the same people they met from the previous world they've been yet with different attitude and roles. \nAnother example I know is the cross-over of Lupin III (along Fujiko and others) in a Detective Conan movie, Lupin III VS Detective Conan. And Conan Edogawa's appearance in an episode of Yakitate! Japan (I'm not sure which episode it is). I don't know if Detective Conan, Lupin III and Yakitate! Japan are animes from the same company or copyright. Are they?\nP.S. I hope this question won't be closed since this will really be educational for anime fans out there. \n", "post_id": "399", "cluster_id": 175, "novelty": true, "order": 0}
{"body_text": "When did the practice of having multiple series for a world begin? I have seen at least two manga where there are multiple series told from the points of view of different characters, but all set in the same world and at or around the same time.\nFirst is chrome-shelled-regios, which includes:\n - Chrome Shelled Regios\n - Chrome Shelled Regios: Missing Mail\n - a couple of others\nThe other is code-geass which includes:\n - Code Geass: Lelouch of the Rebellion\n - Code Geass: Suzaku of the Counterattack\n - Code Geass: Nightmare of Nunnally\n - a couple of others\nWhere did this originate and what was the first manga/set of manga to showcase this?\n", "post_id": "4806", "cluster_id": 175, "novelty": true, "order": 1}
