{"body_text": "Why does the Death Note never run out of pages? It is kind of intriguing that the Death Note never runs out of pages...\nSource\nSince it's made of an unknown matter it's not really that difficult to believe, but we didn't really see the effects of this rule in the anime, which I guess could be more important than most of the rules (unless you show me some other point of view in the answers), by analyzing:\nThe thickness of the Note should increase:\nBy assuming that the number of pages will increase every time you use the Note pages to make it endless, we would clearly see that the Death Note will get thicker, since the number of pages is rising, and we would clearly see that the Note of Light would be too thick after his long years using it.\nThe already written pages remains:\nWe could also deduce that the pages that are already filled does not disappear, since both L and Near did analyze the names written on the Notes and the names of the dead victims as another evidence of conviction.\nNow as a question:\nWe know that the user can rip some pages from the Note to use them later, now what would happen if the user rips all the pages from the last one filled to the end cover of the Note for using them later? : \na- It will be judged as destroying the Note? \nOr \nb- It will be judged as ripping some pages? \nIf a, the Note will be rendered useless.\nIf b, would other pages appear in the Note? In case they appear, could the user keep ripping off pages and giving them to hundreds of people making Kira everywhere? Why didn't Yagami Light do such a thing as becoming the master of the page users and the only one knowing their names in case they disobey him, and as a result, creating an army for himself made of the Kira fans?\n\nCheck also: Will a page ever run out?\n", "post_id": "6009", "cluster_id": 189, "novelty": true, "order": 0}
{"body_text": "Why is there an entire Death Note if only one page is enough? After discussing the matter of whether the Death Note will ever run out of pages, it appears to me that there is another unclear matter, which is whether the page itself can ever run out?\nYou can easily take a page, use an erasable pen and write carefully, then when filled, erase the entire writing without damaging the page. You will always be able to kill other people using that same page. I have the following sub-questions:\n\nIs this even possible, that is, can you kill people after writing on an erased page?\nWhen do we say that the Death Note has run out? See the picture below1, which says that when you run out of room to write, you can ask your Shinigami to bring you another Death Note.\nIf I fill my note, ask the Shinigami for another one, then erase what was written on my first note, will I have made two Death Notes for myself? \nIf the above is true, and since the rules imply that no more than six Death Notes can be brought to the human world, why didn't Yagami Light do that to get six Death Notes, ensuring that no one else gets a Death Note?\nHow does the Shinigami tell that the Note is filled or not? Does he just look at the pages and see whether they are written or not? \n\n\n1 Death Note Manga Pilot, Chapter 0, page 26.\n\n", "post_id": "6113", "cluster_id": 189, "novelty": true, "order": 1}
