{"body_text": "What happens to the Meister when they complete a Death Scythe? The Soul Eater anime only mentions one Meister who created a Death Scythe, and that was Maka's mother with Spirit Albarn being the Death Scythe she created.\nWhen the other Death Weapons arrived in Death City after Asura's release, we did find out that the Death Scythes were stationed around the world. However, the anime didn't reveal who their Meisters were, or even what happened to them.\nSo I am wondering: What happens to a Meister when their Weapon Partner becomes a Death Scythe? Would the process be different with Kid and the Thompson Sisters? (Kid stated that he would rather use a Death Scythe he made than one of his father's)\n", "post_id": "6649", "cluster_id": 294, "novelty": true, "order": 0}
{"body_text": "How do Demon Weapons work in Soul Eater? I don't understand exactly how they work. I've got the basics, but I want to know the details.\nSimply put, a Demon Weapon is a person who can transform into a weapon. Alone they aren't much of a threat, but paired with a Weapon Meister the two are very powerful. But later in the Soul Eater series we see how some Weapons and Meisters pose a serious threat on their own, but they look trained and experienced, so it seems to be more of a guideline.\nIn the first few episodes there's talk about 100-soul ritual, where a Demon Weapon has to consume 99 Kishin eggs and 1 witch soul. The Weapon is supposed to level up after that somehow, and the effects of that aren't very clear to me.\nThe only thing that hints at the magnitude of such upgrade is that Death uses Maka's father as his weapon, him being a Death Weapon. It's like the two most powerful guys in the show together, yet not much is apparent about how it affects their power (both Meister and Weapon).\nAlso, we see some Meisters teamed up with more than one Weapon. They can resonate their souls and it somehow works for them. It seems this is kind of the same as multiple Weapon-Meister combos resonating all of their souls together. But what about combos with only Weapons and only Meisters? Would that work?\nI'm also confused about how a basic Weapon and an upgraded one should be called. Are they Demon Weapons or Death Weapons?\n\nWhat does completing this 100-soul ritual do for Weapon and Meister?\nWhat about combos with 1 Weapon and >1 Meisters?\nWhat are the basic and upgraded Weapons called?\n\n\nSoul Eater Not! just started airing, possibly shedding more light on the mechanics of that world, but I guess the answers to these questions can be found in Soul Eater.\n", "post_id": "8640", "cluster_id": 294, "novelty": true, "order": 1}
