{"body_text": "Why is the new series called 2014? So I noticed that the new season of fairy-tail came out as Fairy Tail (2014), and wondered why they decided to name it like this.\nI know a similar name has been used for the remake of hunter-x-hunter and I have been told they named it (2011) here as it is a remake in higher quality. But I dont see any quality changes, and neither is it a remake of the original Fairy Tail. But rather a continuation on the story told.\nSo why was the new Fairy Tail Season called Fairy Tail (2014) ?\n", "post_id": "8649", "cluster_id": 324, "novelty": true, "order": 0}
{"body_text": "Why do anime series change titles so often (nearly for every \"season\")? I've always wondered this, but why do anime series titles change so often whenever it gets a new \"season\"?\nI mean, I understand that the title stays the same for long running series, like Bleach or One Piece, but why do new \"seasons\" for one or two cour anime have slightly different names? For example...\n\nTo Aru Kagaku no Railgun, To Aru Kagaku no Railgun S\nZero no Tsukaima, Zero no Tsukaima: Futatsuki no Kishi, Zero no Tsukaima: Princesses no Rondo, Zero no Tsukaima F\nMedaka Box, Medaka Box Abnormal\nSword Art Online, Sword Art Online II\nOre no Imouto ga Konna ni Kawaii Wake ga Nai, Ore no Imouto ga Konna ni Kawaii Wake ga Nai. \nK-On!, K-On!!\n\nI'm particularly interested in the last two, where the only noticeable difference in the title is a punctuation mark. They're all direct sequels, so why not just give it the same name as the first season, like in American television? The source material keeps its name throughout its entire life (e.g. there was never a Naruto: Shippuuden manga or a Shakugan no Shana III light novel), so why do their anime adaptations get different titles?\nIs there a legal thing in Japan which disallows a production for one \"season\" to have the same name as another, for clarification purposes? Or do the producers/whoever chooses the names just want to attract more fans by making a distinction between different \"seasons\"? \nSome insight into how the airing of anime works would be much appreciated.\n", "post_id": "9705", "cluster_id": 324, "novelty": true, "order": 1}
