{"body_text": "When did Kakashi and Obito awaken their Mangekyou Sharingan? In chapter 604 of the manga, it is shown that Kakashi kills Rin. This fulfills the requirement to activate the Mangekyou Sharingan. So that should have been the moment when Kakashi was able to use the Mangekyou Sharingan. \nAlso, the Yellow Flash was still alive when this happens, so this means that Naruto was not yet born. This clearly points to the fact that from the very beginning of the Naruto series, Kakashi had his Mangekyou Sharingan activated. \nWhen Kakashi first fought Itachi (when Itachi and Kisame appear at Konoha) and faced the Tsukuyomi he was devastated in a moment, even though he had his Mangekyou Sharingan active (though not used). But the next time they face (during the rescue mission of Gara), he was able to withstand it.\nNow my first question is, was Kakashi unaware of his Mangekyou Sharingan until he faced Itachi, or was he not proficient in using it. Also why in the Naruto series (I mean the series before the start of Shippuden) didn't Kakashi use his Mangekyou Sharingan?\nNow for my second question, in the same chapter, a few pages back, just when Kakashi strikes the blow at Rin, Obito's vision starts to fade as he can sense Rin dying. Does this mean Obito's Mangekyou Sharingan was awakened at the same time? We know that Kakashi and Obito shares the same \"other dimension\" because of the same Sharingan that the both use (not the same eye, but the eye of the same Uchiha). So does the same apply for their activation of Mangekyou Sharingan?\n", "post_id": "4484", "cluster_id": 322, "novelty": true, "order": 0}
{"body_text": "Did Kakashi's sharingan evolve because Obito was watching? Both Kakashi and Obito awaken their Mangekyou at the same time as told in this question When did Kakashi and Obito awaken their Mangekyou Sharingan?  The sharingan Kakashi owns originally came from Obito, so is it due to Obito also being there at the moment Rin died that Kakashi's Mangekyou also awakend? Or asked in a different way. Would Kakashi have been able to awaken the Mangekyou without Obito being there?\n", "post_id": "9605", "cluster_id": 322, "novelty": true, "order": 1}
