{"body_text": "Are all of the Holy Grail War servants based on real heroes? Saber's character in Fate/stay night and Fate/zero is based on the real-life hero King Arthur. Are the other Holy Grail War servants also based on real-life heroes? And if they are, who are those heroes?\n", "post_id": "7391", "cluster_id": 343, "novelty": true, "order": 0}
{"body_text": "In Fate/Zero and Fate/Stay Night, why is King Arthur female? Why is Iskander tall? I've watched both the Fate/Zero and Fate/Stay Night anime, and the Unlimited Blade Works movie, (none of the visual novels so no spoilers from that, unless they are light spoilers). One thing that bothered me was that despite the fact that heroic spirits are defined by the public opinion/view of them, some heroes had qualities that were in direct opposition of what the public thought.\nWe know that heroic spirits, being sealed on their Throne of Heroes, are meant to be completely unchanged. This is the entire point of the Throne of Heroes. But this seems to be in opposition of the previous fact that heroic spirits are defined by what others think they are. Then there are counter-guardians who are completely different, I believe, in that they are not sealed on their Throne of Heroes.\nOne particular important counter-guardian of the series is Arturia, or Saber. Arturia is female, despite the fact that she was treated by even her contemporaries as male, and has gone done in history as male. In fact, there isn't even any small hint as to Arturia's gender being anything other than male in our history, or the history of the Nasuverse (I believe). This being true, shouldn't Arturia be male?\nThis not being the case shouldn't Arturia be erased, or else create instability in the World? Same with Iskander. In history he is known for being pretty short, even for a Macedonian. That he is very tall means there is an incongruity with human knowledge and true fact.\nFurthermore, in the Unlimited Blade Works movie Archer is revealed to be Heroic Spirit Emiya. If Heroic Spirit Emiya is summoned before he is even a hero, or acquired his gift from the World, etc., then how is it that Heroic Spirit Emiya is even strong at all? The power of a servant being based on their popularity at the time of their summoning, Emiya should be weaker than pretty much every other servant, and then some.\nMaybe I'm just over-analyzing things, or I have some misconception. In any case, answers are appreciated.\n", "post_id": "11194", "cluster_id": 343, "novelty": true, "order": 1}
