{"body_text": "What all abilities are transferred when hearts are interchanged between bodies? Law's Ope-Ope No Mi gives him the ability to switch the hearts between 2 bodies. This is actually transferring the mind of a person to the other and vice versa. \nSo the question here is, which of the below abilities of the person are transferred along with the mind to the target body?\n\nStrength (Physical and Mental)\nDevil Fruit Power\nHaki using Ability\n\nIt'd be nice if specific incidents/instances can citied along with each of the pointers for reference as it would be easy to visualize and co-relate them with the answer.\n", "post_id": "11351", "cluster_id": 352, "novelty": true, "order": 0}
{"body_text": "What skills introduced prior to the formal introduction of Haki are Busoshoku Haki based? There are 6 techniques that are the keys to Rokushiki.  Despite a claim in another answer from a well informed user that none of the CP9 members are haki users, several of these techniques seem to be rudimentary forms of Busoshoku Haki.  It seems completely reasonable that the marines would be training them in the use of Haki based skills.\nIn particular: Tekkai, Rokuogan, and Shigan seem to clearly be Haki based.  There are, however, some points against this including Luffy's reaction to Shigan.\nGeppo and Rankyaku could feasibly be viewed as imparting ones willpower/Haki to the air like a projectile.\nOnly Soru does not seem to fit this but Sanji's simular technique (Blue Walk) was (at least partially) transfered to Nami when his mind was transfered.  By this answer Haki is transferred but not physical strength.\nThere are several other techniques that, if these are Haki based, would also need to be Haki based such as Sanji's Sky and Blue walks and Zorro's ranged sword attacks.\nFinally we address swordsmen. Not covered by the CP9's skill but still seems to be early stages of learning Haki is Zorro's cutting of steel.  His sword would normally not be able to cut something as hard or harder than itself but he learns to impart his willpower to it to make it cut what and only what he wants it to.  This is complemented by an early use of observation haki immediately prior to it in his fight against Mr. 1.\nMy one question is therefore: Are there any abilities that were shown prior to the introduction of haki on the show (such as the potential examples above) that have either been shown to work by using Busoshoku Haki (knowingly or not) after it's introduction or have been confirmed by canon sources to be Haki?\nAs I consider it Haki was introduced on Amazon Lily and in the several instances that were observed on the archipelago. The nature of this question invites speculation as I've done above but I would prefer justification in canon.  I understand anime physics don't have to be realistic but this would explain alot.\n", "post_id": "11364", "cluster_id": 352, "novelty": true, "order": 1}
