{"body_text": "Is Fullmetal Alchemist based on Nazi Germany? It may be because I'm Jewish (yes, Madara is Jewish), but I couldn't help but noticing the similarities between Fullmetal Alchemist to the German Nazi regime.\n\nGerman names (Edward, Alphonse, Olivier, Bradley)\nA Fuhrer\n\"Dogs of the Army\"\nVery militarized\nThe blond hair, blue eyes meme\nExtermination (Ishvals)\nWar on multiple fronts\nHuman experimentation\nAn obsession with the occult among high ranking officials\n\nIs it just me? Or is there a connection? Is there some written reference to that? Have the mangaka said anything about it?\n", "post_id": "501", "cluster_id": 380, "novelty": true, "order": 0}
{"body_text": "Are the events in Ishbal based on or inspired by the Holocaust? I've noticed that a lot of Western fans seem to associate the genocide / war in Ishval with the Holocaust (or alternatively, the Middle East). However, from somewhat secondary sources, I've heard that Arakawa was inspired by the plight of the Burakumin or Ainu. (The first I don't remember the reference for; the second appears on this page for Scar and on this reported interview, although there's no statement of where this is from.)\nGiven that FMA is a Japanese manga and that the direct linkage of Amestris to Germany seems tenuous, I am more inclined to assume that there isn't an exact real world parallel to Ishbal. (After all, the exact details of what happened in FMA don't entirely match up to what I know about the Holocaust. In combination with the statements by Arakawa and the fact that Amestris isn't really reducible to being a \"fantasy version of German\", I would assume that the events are largely fantasy, even if some portions might be inspired by various real-life events.) \nMoreover, I would see it as best to assume that the events in Ishval were inspired (at least partly) by issues such as Japanese colonialism (per statements about interviewing war veterans1), even if some aspects might be European. My cynical self suggests that Western fans are also more likely to say Ishvalan War of Extermination == Holocaust because they simply are more likely to have more experience with it (or with the Middle East being an issue) than with tensions in East Asia, and not because this was necessarily explicitly stated somewhere.\nWhat exactly is the arc involving Ishbal supposed to be based on, if anything? Is the oft-cited factoid that it is based on the Holocaust true, or is it more reasonable to associate it with issues linked to Japan or to see it as a largely fantastic element with occasional grounding in things that have happened in real life?\n\n\n(Update) I now realise that the most obvious purpose of such interviews would be to get some grounding for the experiences of military characters such as Mustang or Hawkeye. However, I'm trying to preserve the question as close to its original form as possible (and there, I had mentioned East Asia) in this clean-up.\n\n", "post_id": "13069", "cluster_id": 380, "novelty": true, "order": 1}
