{"body_text": "What databases and listing sites exist for anime, manga, etc? What are the major online databases of anime, manga, light novels, visual novels, and other related media? What are the differences between them?\nTo qualify as an answer, the source should list a large fraction of series in some particular medium, not just one or a few related series. The primary purpose of sites here should be indexing information about series. While it's acceptable to link to sites that do have some information related to e.g. fansubs, the primary purpose of all links in answers here should be indexing, not providing download links. Also, databases which are out-of-date should be removed.\nNon-English sources are welcome so long as they qualify, but please specify what language in parentheses.\n", "post_id": "4696", "cluster_id": 386, "novelty": true, "order": 0}
{"body_text": "What's this manga with a woman with body image issues? I was in a bookstore and was looking at a manga listed as a josei manga on the back cover before I had to go somewhere else, and am trying to remember the title. I only looked at the first chapter, but these are the details I remember:\n\nThe protagonist is a woman who seems to have issues related to body image. In the beginning, it seems that she eats very little for her breakfast and hopes that it'll be enough for later, but in a later panel we see her eating a lot of food.\nHer coworkers comment on her fatness at some point in chapter 1.\nHer boyfriend's name is Saito. If I'm not mistaken, he's cheating on her with one of the protagonist's coworkers. She discovers this when she sees them on the street together, and later asks him if they can go out together to some place, which he says is boring. She wonders how he knows this detail when he supposedly never went to said place. The coworker apparently went to a Yokohama hotel with the boyfriend and had sex \"three times\" with him.\nWe see an image of the protagonist on her knees in the nude to show her having sex (during a discussion of something tangentially related to that with her coworkers) with her boyfriend.\n\nMy preliminary searches didn't give anything useful, but I'll try again later.\n", "post_id": "13236", "cluster_id": 386, "novelty": true, "order": 1}
