{"body_text": "Is Misa Amane's early death a plothole in Death Note? According to the wiki, when a Shinigami dies, their remaining lifespan is given to the human they saved.\nSince Rem killed L and Watari, she gained their remaining lifespans. Additionally she probably still had some lifespan left. On top of that Misa was already given a lot of lifespan from Gelus (from which she lost 75% again). So does this mean all of this lifespan is transferred to Misa Amane?!\nYet according to her wiki page, she dies in 2011 at the age of 26, only seven years after Rem died.\nDoes this mean that humans are also capable of reducing their own lifespans? Or would the author have made a mistake by letting Misa die as early as she has? I know she lost 75% of her remaining lifespan through the two eye deals, but you'd think that the cumulation of L, Watari and Rem's remaining lifespans would be greater than just one year, wouldn't you?\n", "post_id": "11296", "cluster_id": 415, "novelty": true, "order": 0}
{"body_text": "What does the Death Note consider as \"original lifespan\"? I was reading this question and it got me thinking about what a person's \"original lifespan\" really was.\nDoes the original lifespan mean the amount of time a person has from birth to death, ultimately caused by old age (e.g. the longest a person could live barring abnormal health problems or unusual circumstances (e.g. murders, accidents))? \nWhat if the person contracts a lethal disease? Surely it would shorten their lifespan, but would it affect their original lifespan?\nSo, take for example:\nJohn has a lifespan of 93 years (as seen through Shinigami eyes). He works for the CIA, though, and at one point comes into contact with a high dose of radiation from a nuclear device. Doctors tell him he only has a couple days to live.\nIn this case, John's lifespan has been shortened from 93 years to 2 days. If he writes his own name in the Death Note, set to die from a different disease that takes years and years to develop, would he have effectively beaten radiation poisoning? \nNote that the 23-day rule (XVII) would not apply here thanks to rule XVIII.\n", "post_id": "13447", "cluster_id": 415, "novelty": true, "order": 1}
