{"body_text": "Are there any anime that play out from a oranyan protagonist's point-of-view? There are anime which I have already watched that narrates based on the male protagonist's point-of-view (not an oranyan). For example is Ano Hana, Clannad, etc. And a lot more anime with main tsundere female protagonist's point-of-view. \nI'm looking for another example of anime (plot more inclined in romance) where the narration is inclined with a main oranyan (\"male tsundere\") male protagonist's point-of-view (since I think they are rare, or I just haven't watched that much anime series), not with the point-of-view of the female character who's in love with an oranyan male protagonist. Is there another example of this kind of anime (well, aside from Sora no Manimani if I'm correct that Saku was kind of oranyan)?\n", "post_id": "2976", "cluster_id": 438, "novelty": true, "order": 0}
{"body_text": "Can someone explain the term \"oranyan\"? I had never heard the word \"oranyan\" before reading this question. The question made it sound like the term referred to a male tsundere.\nI searched this site for more mentions of \"oranyan\", but only found the linked question. I Googled for more info, but the only results I found aside from this TV Tropes page on tsundere and the question I linked above referred to the mythical founder of the Oyo Empire of Yoruba, which I'm pretty sure has nothing to do with the anime meaning of this term. The TV Tropes page just says \"oranyan\" is another word for \"tsundere\" which \"is sometimes used to refer to a male tsundere character—incorrectly since it means the complete opposite\". \nTV Tropes's reputation for accuracy aside, the linguist in me wants to nitpick that statement because of its implicit prescriptivist assumptions about \"correct\" use of language; for this question, I'm going to ask that answers take the linguist's viewpoint and define \"oranyan\" as whatever the majority of people think \"oranyan\" means, and to please explain the situation if no majority definition exists, or if the majority definition differs between Japanese and Western fans.\nSo, here's what I'm curious about:\n\nWhat's the etymology of the term \"oranyan\"? \nIs there any basis to TV Tropes's claim that it means the exact opposite of 'male tsundere'?\nIn the common usage of the term, is there some difference in meaning from 'tsundere' aside from the sex of the character?\n\n", "post_id": "14016", "cluster_id": 438, "novelty": true, "order": 1}
