{"body_text": "What is the significance of the rescue of Nagate and Shizuka by 256 Guardians? I didn't understand what happened at the sixth episode. Can you explain me the point listed below?\n\nWhy did 256 guardians come for the rescue? Why so many, and why 28 of them?\nWhy did the guardians break the law by rescuing them? What is wrong with the rescue? Why does it become unlawful? Why didn't the command center plan the rescue beforehand? Where they abandoned there officially?\n\n", "post_id": "14312", "cluster_id": 505, "novelty": true, "order": 0}
{"body_text": "Does Sidonia no Kishi's 256 frame formation have scientific advantages? In episode five or six of Sidonia no Kishi, Tanikaze and Shizuka were rescued by their fellow knights against orders of the captain. The rescuers adopted a 256 Gardes formation traveling to and from the protagonist's location. Is the scientific reason behind this peculiar formation explained anywhere in the series (because I can't recall)? \n\nTheir formation was a perfect circle when they traveled to Tanikaze's location but was uneven as they carried his frame, hence balance might be out of the answer. This formation was also used later in the series when they were going to attack the massive Gauna (as the picture shows). They used all 256 for the formation but still, the mission-grouping were in 128 frames per objective.\nI don't think this question is a duplicate of this question because I'm asking for the scientific explanation of the formation. I'm also aware this question may be put on hold or closed as too speculative, but it's an interesting thing to ask if the explanation is in the series anyway.\nI believe krazer's explanation to the question above (as ton.yeung comments below) is on spot after a little research. However, what I really want to know is the benefits in having everyone in one giant ring when they could create two 128-frame rings that would've been apt on the later event I mentioned. They could even have 64 4-frame rings that might cover a greater area in the long run (or not). Does it save energy, minimize danger, or perhaps guarantee a lesser chance of being lost in space?\n", "post_id": "15560", "cluster_id": 505, "novelty": true, "order": 1}
