{"body_text": "Why are there sometimes darkened scenes in new anime? In the first Shingeki no Kyojin opening, I've seen some scenes with lower contrast or brightness, something like this:\n\nAnd later, in the same sequence, a scene appears without that contrast change:\n\nI've seen this kind of contrast change in the HxH remake as well, and the first thing that comes to my mind is that legendary Pokemon episode where a lot of kids suffered of photosensitive epilepsy attacks in Japan thanks to Pikachu and Co.\nDoes it has some relationship with that or there is another reason? Maybe a new law in Japan related to these flashy images on TV?\nIt seems this change appears only in new anime (I don't remember seeing something like this before last year). Any clue around that time?\n===UPDATED===\nIt's not just in the opening; here are more examples:\nOne of many scenes where the image is normal:\n\nThen comes the darker scenes. Maybe it cannot be appreciated in the snapshots, but all are a full sequence of images appearing quickly with a bright background:\n\n\n\nAnd then it returns to normal:\n\nThis is from the last HxH episode. At first, the image looks fine:\n\nThen comes an attack and the image looks darker. Maybe the effect is not so intense as in Shingeki no Kyojin, but it is still there. Look, all these bright flashes coming from the hits seem not as bright as they should be:\n\n\n\nAnd then the image looks normal again - compare the smoke color before and after:\n\nAs @JonLin notes, maybe it could be some kind of TV censorship, despite that there's nothing to censor besides all these flashy lights. Is it just me being paranoid or is there something more behind all this?\n==UPDATE 2==\nI've found a Blu-ray rip of the Shingeki no Kyojin opening (no subtitles, no credits) and I took some shots of the same frames that I already put. To the left, the TV version and to the right, the BDRip version (click for more detail):\n\n\n\n\nSo it is not an effect to make things more dramatic, but rather an effect included only on TV. I suppose the same applies to the other shots (at least in SnK).  \nSo my question comes again, why, lately, are there some anime with darkened scenes? My conspiracy theory is that it is related to those bright changes and possible photosensitive attacks. If that's true, why is this being applied lately? And why doesn't it appear on DVD/BD?\nIf not, what else it could be?\n", "post_id": "5092", "cluster_id": 538, "novelty": true, "order": 0}
{"body_text": "Who applies censorship on an ecchi anime? In my few years of watching anime, I have noticed varied amounts of ecchi-ness portrayed and the corresponding censorship it generates. I mentioned \"varied\" because I have noted differences in censorship techniques (black/white bars, excessive lighting) and the amount dealt to the scene. For instance most non-ecchi anime have the breasts censored, some only have the nipples removed, and a quite a few bare them completely. The quite few who go the extremes may even be classified as hentai already.\nPoints in case (I wanted to include pics but then decided against it):\n\nPartial covers: Gokukoku no Brynhildr, Infinite Stratos, Trinity Seven\nBared completely: HighSchool DxD, Yosuga no Sora, Elfen Lied\n\nMy question: How does Japan implement various levels of content ratings (G, PG, R18+)?  Is it the production studio who applies these varying amount of censorship or is there a committee assigned that does it? Does the same apply for violence/gore censorship?\n", "post_id": "16885", "cluster_id": 538, "novelty": true, "order": 1}
