{"body_text": "Who applies censorship on an ecchi anime? In my few years of watching anime, I have noticed varied amounts of ecchi-ness portrayed and the corresponding censorship it generates. I mentioned \"varied\" because I have noted differences in censorship techniques (black/white bars, excessive lighting) and the amount dealt to the scene. For instance most non-ecchi anime have the breasts censored, some only have the nipples removed, and a quite a few bare them completely. The quite few who go the extremes may even be classified as hentai already.\nPoints in case (I wanted to include pics but then decided against it):\n\nPartial covers: Gokukoku no Brynhildr, Infinite Stratos, Trinity Seven\nBared completely: HighSchool DxD, Yosuga no Sora, Elfen Lied\n\nMy question: How does Japan implement various levels of content ratings (G, PG, R18+)?  Is it the production studio who applies these varying amount of censorship or is there a committee assigned that does it? Does the same apply for violence/gore censorship?\n", "post_id": "16885", "cluster_id": 539, "novelty": true, "order": 0}
{"body_text": "Why is the childhood friend trope commonly seen in anime? I've noticed that most anime, especially in genres like slice of life and romantic comedies,  there is at least one character that plays  the role of the childhood friend (osananajimi). This is often coupled with the unrequited love, girl next door, or other related tropes.\nOf course, childhood friends are in every culture out there, but I'm curious if Japan has a special reason for this particular occurrence in anime shows. Also, aside from gender inclination towards the shounen genre, why is it that most osananajimi are girls whereas in real life, our childhood friends are typically of the same sex? Is this occurence more prevalent in Japan than in other cultures?\nAnd feel free to edit (especially the title) and/or comment if this question is off-topic.\n", "post_id": "15452", "cluster_id": 539, "novelty": true, "order": 1}
