{"body_text": "Who is the strongest Hokage? Who is actually the strongest Hokage? It would be such a simple question and answer if Kishimoto just gave us a direct answer. But instead, Kishimoto feeds us different information along the way as the story progresses.\nPre Chuunin Exam\nSarutobi was highlighted as the genius Shinobi. The manga stated that he quickly surpassed both the first and the second at a young age, and was widely known as the Professor. We also find out later that the first and second died in war, while the third and fourth sacrificed their lives to use the demon god. \nChuunin exam era + beginning of Shippuden\nMinato was considered the strongest Hokage. Recall when Orochimaru was using Edo Tensei to revive all dead Kages - Sarutobi was most afraid of the Fourth. For a while, everyone regarded the 4th as the strongest shinobi. I am not sure if this is because they never witnessed the first, but it seems evident that Minato was the powerhouse. Everyone kept saying - If the fourth was here, Orochimaru would be no problem, etc.\nLate Shippuden when Tobi starts acting and Madara is revealed\nHashirama is the God of Shinobi. He is depicted as the strongest of all four, even recognized by Minato. He is the only one to resist Orochimaru's control. Madara Uchiha also regards everyone else, aside from Hashirama, as insignificant.\nThe thing that bothers me the most is how Sarutobi was not worried and was able to handle fighting both Hashirama and Tobirama. Minato was the source of his fear.\nAnd then later on, Hashirama just seems like he is on another level. So I guess I have to redefine my question. Was Hashirama always the strongest Hokage, or did Kishimoto develop his strength later on? Or can this just not be determined?\n", "post_id": "6621", "cluster_id": 572, "novelty": true, "order": 0}
{"body_text": "Why is Hashirama hailed as the most powerful shinobi of all time? Why is Hashirama hailed as the most powerful shinobi of all time and there hasn't been anyone who can surpass him? Also, why is the Wood Style unique to him?\n", "post_id": "18380", "cluster_id": 572, "novelty": true, "order": 1}
