{"body_text": "What is TK's actual name? \"TK\" is a mysterious character who tends to speaks in nonsensical English phrases depending on the situation.\nWas it ever revealed what is his actual name? Also, why do the other SSS members call him \"TK\"?\n\n", "post_id": "3108", "cluster_id": 599, "novelty": true, "order": 0}
{"body_text": "What are these scenes in Angel Beats! parodying? Angel Beats! is full of parodies, some are obvious, and some are not. The following parodies/homages have been identified:\nEpisode 2\n\nThe Laser Hallway is likely a homage to Resident Evil.\n\nEpisode 3\n\nYuri crossing her fingers (finger tenting) is a parody of the Gendo Pose from Neon Genesis Evangelion.\nTakeyama's pi attack, having the same effect as the Ring Tightening Mantra, might be a homage to Journey to the West.\nTakeyama's finger pointing (and appearing from behind Yuri) is a parody of Detective Conan.\nOtonashi's first mosaic image of Angel's area is clearly Laputa: Castle in the Sky.\nOtonashi's second mosaic image of Angel's area is clearly Howl's Moving Castle.\n\nOVA Special: Hell's Kitchen\n\nRadio communications club is ripping off from Apocalypse Now.\nThis is a wild guess, but Girls Dead Monster might actually be a homage to Dead Girls, a four-girl music group in the Red Garden OVA. Granted, it is a common team combination, but there are two more similarities between the two music groups: a former band member of GirlDeMo, Iwasawa, passed away (the second time) and left the team; a former schoolmate of the members of Dead Girls, Lise, who was murdered together with the four girls, also passed away (the second time) and left the team. Moreover, the demon, what Otonashi calls a \"monster\", that Hisako turned into resembles the monsters in Red Garden.\n\n\nI'm still left with many scenes that I believe to be unidentified parodies. What are they parodying? Please include the episode number and a brief description so I know which one(s) you are answering, e.g. Ep 5: Angel vs SSS.\nEpisode 5\n\nOtonashi imagines an all-out battle between Angel and SSS.\n\n\nEpisode 7\n\nOtonashi imagines the monster in Operation Monster Stream.\n\nFishing Saitou realizes they have caught Monster Stream on a hook.\n\n\nEpisode 10\n\nWho are you imitating?\n\nSomeone from Captain Tsubasa?\n\n\nEpisode 11\n\nAngel slashing the shadows.\n\n\nEpisode 12\n\nTK knockin' on Heaven's Door.\n\nThe SSS yakuzas.\n\nYuri upon hearing that she could become god.\n\n\nOVA Special: Stairway to Heaven\n\nGod from another anime?\n\nYuri's evil ojousama laugh.\n\nRed-eyed Yui attacks from the sky with a full moon in the background.\n\n\nOVA Special: Hell's Kitchen\n\nIs this a Rena's death scene from Higurashi no Naku Koro ni?\n\n\n", "post_id": "18861", "cluster_id": 599, "novelty": true, "order": 1}
