{"body_text": "How is Misaka's railgun so destructive? In episode 1 of Railgun, Misaka's railgun up-ends a good chunk of what appears to be an olympic-sized swimming pool. Later in the same episode, it is revealed that her railgun travels at a velocity of 1030 m/s.\n\nHowever, the numbers don't add up.\nSuppose Misaka uses 10 gram coins. At 1030 m/s, that coin has this much energy:\nEnergy = 1/2 m v^2\n       = 1/2 (0.01 kg) (1030 m/s)^2 = 5304.5 kg (m/s)^2\n       = 5304.5 Joules\n\nAn olympic-sized swimming pool has 2,500,000 kg of water. Based on the image above, that cone probably travels a good 100 meters into the air.\nSo let's say for benefit of the doubt, that only 10% of the water is lifted 100 meters into the air.\nEnergy = m g h\n       = (0.01 * 2500000 kg) (9.8 m/s^2) (100 m) = 2.45 * 10^8 kg (m/s)^2\n       = 2.45 * 10^8 Joules\n\nThe coin needs 2.45 * 10^8 Joules of energy to uplift the swimming pool as shown above. But her coin can only provide 5304.5 Joules. There is a difference of about 4 orders of magnitude.\n\nOkay... Before anyone dismisses this as just another case of Anime physics, let's look at what else could produce so much energy:\n\nThe spin of the coin is not captured in the net velocity of 1030 m/s. But given the moment of inertia of a little coin, it would need a tremendous (relativistic?) amount of spin to carry 10^8 Joules.\nThe charge of the coin is unspecified in the Anime. Perhaps Misaka somehow polarizes the charge in the coin and somehow makes it release upon contact with the target.\nThe mass-energy (E = mc^2) of the coin is 9 * 10^14 Joules. Is this what she did?\n\nSo the question is: Is there any official explanation for where the coin gets so much energy? Or are we left to dismiss this as another case of Anime physics?\n", "post_id": "2235", "cluster_id": 681, "novelty": true, "order": 0}
{"body_text": "Is it physically possible to turn a mahjong tile white with a super grip? In the manga Mudazumo Naki Kaikaku, the protagonist Junichiro Koizumi is able to use \"goumoupai\", the ability to turn any mahjong tile into a white/haku tile simply by gripping it with immense strength, usually leaving the tile dented.\nSure, the manga frequently goes overboard with the abilities of each character, but this one seems like it might actually be possible in real life. I'd assume that the material the tile is made out of would be a giant factor, but apparently Koizumi can even do it with depleted uranium tiles.\nHow much grip force would be needed to scrape/dent a mahjong tile so that it turns white? Would it be possible for a human (for any material)?\n", "post_id": "20522", "cluster_id": 681, "novelty": true, "order": 1}
