{"body_text": "Why didn't anybody recognize the Z fighters at the Cell games? During the Cell-games saga, Mr. Satan was supposed to be the World Martial Arts champion and he was held in high regard by most common people.\nBy contrast the Z-fighters, most of whom just happened to be high profile fighters from the 21st through the 23rd World Martial Arts tournaments, were perceived to be nobodies by the general populace.  \nBut they were all the top contestants of the previous Martial arts tournament, which can't be too much more than 15 years before the Cell games.  \nThey were the highest profile Martial artists of the previous decade.\nIf we compared this to modern boxing, it would be analogous to praising Wladimir Klitschko, but completely dismissing Mike Tyson and Evander Holyfiled.(although Klitschko is younger).\nI can understand why they didn't recognize Goku, but Piccolo, Tien, Yamcha, and Krillin should have been immediately recognizable.\nWhy were they dismissed so much?\n", "post_id": "3304", "cluster_id": 698, "novelty": true, "order": 0}
{"body_text": "Why didn't Mr Satan know about Z Warriors and their abilities? Mr Satan was a professional martial artist. Surely, he was also a buffoon, but from what we've seen he is definitely very strong and skilled by the standards of someone who was never trained by someone like Kami or Kaioshin. In \"Dragon Ball\" series he would probably be a decent opponent for Goku or Tien.\nHe also wasn't completely stupid - you don't become champion, millionaire and world star by not knowing what are doing. \nIn the real world it takes a mixture of raw talent, hard work and passion to achieve such level, and we have no reason to assume that it's any different in Dragon Ball universe.\nNow, to finally get to the point:\nHow come that he never came across stories about people like Master Roshi? How come he didn't watch 21st, 22nd and 23rd Tournaments, where flying, Kamehamehas, disappearing and other strange techniques were common?  How come he had no idea about Tien (who won 22nd Tournament)?  Satan must have been a young boy or teenager, and if he had passion for martial arts, people like Tournament Winners should be like Gods to him. \nAnd yet, after these Tournaments, Mr. Satan doesn't recognize Goku, or Piccolo or the other Z-Fighters. \nMind that I'm not questioning why he kept on insisting that everything that happened during Cell Games was a \"trick\" - he wouldn't want to admit that he was outclassed - but why was he actually and genuinely surprised. \n", "post_id": "21057", "cluster_id": 698, "novelty": true, "order": 1}
