{"body_text": "Is it possible for one Master to have multiple Servants? I'm reading the Fate/Stay Night visual novel. Early on, in the Kotomine Church, you can reach a bad ending by choosing to have Shirou give up his Command Spells and withdraw from the Holy Grail War as a Master. He goes outside to sever his contract with Saber, who says that normally she would kill a Master who abandoned her. Shirou asks if she'll form a contract with another Master, and Saber says that Archer's Master (Rin Tousaka) should be able to bring out her full power. Upon parting with Shirou, she goes into the church, presumably to form a contract with Rin. \nAlso, in the 2006 Studio Deen Fate/Stay Night anime (I haven't reached this far yet in the visual novel, but I assume it's similar), \n\n Kirei Kotomine commands both Zero Archer (Gilgamesh) and Stay Night Lancer (Cu Chulainn). I assume he was officially the Master of at least Lancer, since unlike Gilgamesh, Lancer would have required a contract to stay in the world. \nBut would Rin have gotten an extra three Command Spells if she made a contract with Saber, or would she have to save the one she had left as a sign of her control over both Saber and Archer?\nI'm still early into the visual novel, and I haven't yet seen the last four episodes of Fate/Zero, so please use spoiler tags as needed.\n", "post_id": "14559", "cluster_id": 692, "novelty": true, "order": 0}
{"body_text": "In Unlimited Blade Works, why did Caster try to kill Shirou when she hadn't retrieved his Command Seals yet? I've been watching the UBW series. When Caster abducts Shirou to take his Command Seals so she can use Saber against Berserker, Archer comes in and saves him - then fights Caster.\nAt some point during the fight, Caster sees Shirou unprotected, so she fires at him (at which point Archer saves him again).\n\nWhy did Caster shoot Shirou, if she hadn't retrieved his Command Seals yet?\nIt's not like Shirou was any sort of threat. Surely dealing with Archer first would be a better idea, then retrieve the Command Seals off Shirou (since he's no match against Caster) to be able to fight Berserker using Saber.\nCaster was definitely aiming to kill - other than the fact that her attacks literally blow up the ground, she was also smiling (as in, \"gotcha!\"), and then was surprised to see Shirou still alive.\n", "post_id": "20849", "cluster_id": 692, "novelty": true, "order": 1}
