{"body_text": "How are the themes and songs picked for a particular series? Are the opening/ending themes, insert songs, and background music created specifically for the series they represent, or are they just picked by the producers/production committee based on how well they would fit their series? \nWhat typically happens? What exceptions are there? How much have things changed now compared to the past?\n", "post_id": "3744", "cluster_id": 719, "novelty": true, "order": 0}
{"body_text": "Has there been a study or documentary on the influence of Ani-song themes on Japan's music scene? As noted on How are the themes and songs picked for a particular series?, some anime openings are created for their show; thus, the song and anime theme usually coincide and work together.\nSince these songs are widely promoted in Japanese society (and consumed largely by young ones that regard them highly as they grow), I guess these themes heavily influence Japan's music scene too. \nAt least the influence of early video game music is easy to note. The wide spread of anisons has to have had an influence in musicians.\nSure, the trace of influence might start with the society itself as in Society/Home → Author Experience → Piece of Work → Anime+Anison, and then feeds back to Society.\nThe background of the question\nI think that there's a lot more of songs that talk about peers understanding (in love, hurting, etc) in Japan than in Western music. The motivation for this question is to prove or disprove, since I'm making the assumption that these anisons lyrics/themes have influenced current Japanese song writers.\nI do believe that Japanese writers express the need of Japan's society to communicate their problems to others and to understand other people struggles. \nBut there has been any study or documentary talking about this?\nEven a formal investigation about this theme bias I see in the lyrics of Japan's music bands works. And sure, this might be just my imagination, is really uncommon that theme on western songs?\n\nAn example of these kind of differences between japanese music and western music is noted by Marty Friedman (former Megadeath guitarist). But what he talks about is the music composition, not the topics on jpop/jrock lyrics. \n", "post_id": "21354", "cluster_id": 719, "novelty": true, "order": 1}
