{"body_text": "Manga about 3 school friends who have to play games to survive I am having a tough time trying to remember the name of this manga. It had three high school friends and they woke up in an alternate reality where people play games to survive. The games difficulty is determined by a something and can determine the difficulty by a deck of cards.\nThe first game was something like 2 of diamonds and they had to get fortune cookies and survive a bunch of flaming arrows (Which they did). One of the group guys is smart while the other of the group guys is really brave then they have a 3rd member who is worthless it seems.\n", "post_id": "18642", "cluster_id": 731, "novelty": true, "order": 0}
{"body_text": "Which anime it is? (from description) Few months ago I was watching anime on kissanime.com. In Latest update section I found interesting anime. I watched 2-3 episodes and then left site (forgot to bookmark). I thought that was airing anime, because it only had 2 or 3 episodes at that moment. After a month I tried to find it (MAL, google, browser history), but I couldn't. So lets give a try to find that dam anime :).\nStory:\nNowadays. Two guys (cool looking teenagers, like a gangsters) was standing near the river. One said that life was boring. Then suddenly they had been teleported to abandoned city. They went to explore what is going on. When they ware wondering, they met women. After that they all together reach temple. In the temple game of death started. They all had to draw card with question. The answer- number. And if you guest wrong the temple are bombarded with fire arrows (arrow count is difference between correct answer and wrong answer). Finally MC (one of the guys) figured it out and escaped temple. Although his friend was shot with arrow in the leg. After then (or maybe later), someone explained all situation. That they must participate in those death games. And if they win, they can live X days more. Otherwise satellite will kill you (if you run out of time). MC was quit exited, so he suggested to participate in another game. His friend was injured, so he went with that women. The next game was in multistory building. There was about 5 levels with a lot of rooms. And outside stairs and balconies connected to each room. There were a lot of participants and all of them had to find room with red button. They they press it, they will win. Although there was walking a tough guy with MAC smg. And killing everyone.\nOkay, I think that is enough story. Please help me find this anime. Thanks.\n", "post_id": "21669", "cluster_id": 731, "novelty": false, "order": 1}
