{"body_text": "Can an animated show created outside Japan be called Anime? The \"Anime\" called \"Torkaizer\" which will be created in Alter Ego Productions animation studio in Abu Dhabi is created outside Japan but is called Anime officially, can a cartoonic show created outside Japan be called anime?\nThis is the official trailer by the official account of the studio on YouTube,\n in the description it officially states that it is an Anime.\n", "post_id": "6198", "cluster_id": 961, "novelty": true, "order": 0}
{"body_text": "Who produced what on Alexander Senki? Reading the question Can an animated show created outside Japan be called anime?, I recalled one of the worst shows of my teenage years: Alexander Senki, released in the US as Reign: The Conqueror.\nThis show retells the life of Alexander the Great as anime, in much the same style way that the movie 300 retells the battle of Thermopylae as a video game. The first review on the MyAnimeList page pretty much sums up my feelings about this series. \nBeyond its gruesome awfulness, I've always had my doubts that this show really counts as anime according to the definition that ʞɹɐzǝɹ gave in the answer to the linked question.\nAccording to the Wikipedia page, the show was created by an \"international crew that drew from the resources of the worldwide animation community\". The offensively hideous character designs were courtesy of Korean-American animator Peter Chung, well known for such highly regarded anime classics as Matriculated from The Animatrix, Æon Flux, and Rugrats. The animation was by Madhouse, though Wikipedia claims \"[m]ost of the production work was handled by Korean animators.\" The producers of the show also apparently created their own English dub, which was scrapped by Tokyopop when they distributed the series.\nI'm curious who else made up the \"international crew\". Was it essentially a normal anime production, where Madhouse outsources the grunt work to Korean studios, except produced under the creative direction of a guy who thinks the ancient Greeks ran around in thong underwear with metal plates sewn on? Or did the Korean studios play a greater than average role? Was there some other significant part of the show which was produced outside Japan?\n", "post_id": "23570", "cluster_id": 961, "novelty": true, "order": 1}
