{"body_text": "How does the Grail choose the participants? How does the Grail choose the participants?\n\nWe know that the Grail tries to pick people who have some sort of strong desire (when Kotomine asks Tohsaka at the beginning of Fate/Zero).\nDo you need to descend from a mage bloodline? Did the murderer guy (the one who got Caster in Fate/Zero) have magical blood?\nIt seems like you don't need to be aware of the existence of the Holy Grail war (Shirou and the murderer guy were both pretty clueless).\nYou do seem to need an heroic relic... or do you? When Kotomine was surprisingly chosen in Fate/Zero, did he have one already? What if you lose the relic before the summoning occurs? (In Fate/Zero the participants were already making preparations for years before the summoning).\nThe Matou were disappointed that Kariya left behind their magical teachings, so they decided to adopt Sakura to prepare her for the next war. When Kariya returns and chooses to fight, he successfully becomes a master. This suggests that there is a way to opt out/in from the war (?)\n\nSo how does the Grail pick participants exactly?\n", "post_id": "20525", "cluster_id": 985, "novelty": true, "order": 0}
{"body_text": "What happens if there is no relic in a summoning? In Unlimited Blade Works, we eventually learn that Archer was summoned as Rin had a relic associated with him (i.e. the pendant Shiro keeps). In the recent anime adaptation, there is also some statement to the effect of \"a relic is required to summon a servant\".\nSimilar sentiment is expressed in the Fate route of the visual novel. On the last day, Saber tells Shiro that he must have been able to summon her as a result of having had Excalibur's sheath embedded in him (similar to how it was embedded in Irisviel in Fate/Zero):\nThis seems in line with the other summonings we see, such as Waver's use of a cloak to summon Iskandar and the trouble the Einsberns take to retrieve the sheath so that Kiritsugu summons a good servant. Finally, some remark Lord El Melloi makes about having to find a relic last minute suggests that a relic is always required.\nIs this (\"a relic is always required for a successful summoning\") correct? If so, did Rin have anything she knew to be a relic when she summoned Archer? (I feel like she didn't, but if a relic is required, I would have assumed that she'd be aware of this, as a reasonably competent magus.)\n", "post_id": "23773", "cluster_id": 985, "novelty": true, "order": 1}
