{"body_text": "Is Sasuke serious about rebuilding the Uchiha clan? Is Sasuke actually serious about ever restoring his clan?\nRestoring the Uchiha clan, both in population and prestige, was the second of Sasuke's two major life goals since the beginning of the Naruto series. Yet by 700, some 20 years after the massacre, he has so far succeeded in producing only a single Uchiha heir. If we include Sakura, that's only 2 additional Uchiha in that entire time! Given the highly dangerous shinobi training regime and overall risky lifestyle, isn't it  reckless to rely on Sarada alone to carry the tribal line, especially given the number of children he'd need to create a minimal viable population (MVP): sustainability levels for vertibrate mammals is generally estimated at 500 to 1000 individuals, but given there's a whole village of Konoha to interbreed with, let's be generous and say only 5% of that number would be needed (25-35). If so, then Sasuke really should be having in the order of 12 children (who, if each of those keeps up near that birthrate, the Uchiha clan would be fully restored within 2-3 generations!) I know it's common for contemporary Japanese families to produce only one or two children at most, so it's what the readers would be used to, but this is ancient/different dimension Japan! \nWhat exactly is he waiting for?\n(Maybe Shin will have to step up to the plate instead, or Orochimaru making a ton of test tube Uchiha babies, haha!)\n", "post_id": "24153", "cluster_id": 1065, "novelty": true, "order": 0}
{"body_text": "What was the moral of Sasuke and Orochimaru's arcs across the Naruto series? Was there any? So Naruto Gaiden has concluded, and it featured both Sasuke and Orochimaru in his latest iteration. Which again raises the question, what exactly was the moral of the story for these two?\nThe Naruto series excelled at emphasizing certain moral behaviors to its readers/viewers: e.g., with hard work, determination, self-confidence, and a will to succeed, even a loser or social outcast can reach the top; love and understanding each other on a deeper level can solve any problem and bring out all you're actually capable of; kindness and compassion towards wild 'Beasts' can lead to positive results; it's important never to abandon your friends and family; etc etc. All very good, solid shounen values!\nSo what do the lives of Sasuke and Orochimaru teach us (if anything) from their character arcs? By the end of Shipuden neither has really repented or shown remorse for their bad behavior (simple \"sorries\" do not cut it), both have done horrible things (murder, hideous human experimentation, etc) for which they are never punished (Sasuke is pardoned, Orochimaru's 'imprisonment' in Gaiden is pretty milquetoast, and he's even allowed to continue researching with his assistants!), and it is implied that they got a free pass for the simple reason that they joined forces with the Shinobi Alliance to destroy a common threat that was even worse (and one which was against their own interests to see succeed anyway!). Even then, Sasuke attempted to hijack things at the last minute and take over the world, only relenting when he was soundly defeated (i.e., he stopped when it was no longer possible for him to achieve his ends!). Yet both are still allowed to do pretty much whatever they please for the next decade or two. So what are we to make of all this? Do whatever you want and if you have powerful enough friends, you can get away with it, and keep on doing whatever you want?\n", "post_id": "24137", "cluster_id": 1065, "novelty": true, "order": 1}
