{"body_text": "How come the events of Rebellion are possible, with Madoka's wish? It seems to me that, no matter how you look at it, the events of the Rebellion movie are impossible due to Madoka's wish. Her wish-speech can roughly be split into five distinct parts (significant differences between Meguca's and Doki's translation marked):\n\nI want to [erase/eliminate] all witches before they are [even] born.\n[I will erase] every single witch in every universe, past and future, with my own hands.\n(I don't care what you call it. All those magical girls who held onto their hopes and fought against witches - I don't want [to see them cry / them to cry]. I want them to remain smiling until the end.)\nI will destroy any rule [or law] that stands in my way; I will rewrite them all. This is my [desire/prayer], my wish.\n(Now, grant me this, Incubator!)\n\nThe pars in brackets are most likely not part of the actual wish, as we later clearly see that magical girls are not constantly smiling, not to mention that that would be a very weird wish to make for Madoka. So, only #1, #2 and #4 are the actual wish.\n\nNow, in Rebellion, Kyubee apparently manages to create a barrier that shuts out Madoka and causes Homura to turn into a witch in her own world / soul gem. However, this contradicts the wish, as Madoka does not allow for any exceptions to be made. Even if we were to argue that a barrier is not a rule, and hence not subject to #5 (even though the fact that Madoka is barred from entering would be a rule), #1 has no limits whatsoever, and should prevent Homura from turning into a witch. Possibly, we can grant that this may happen not through Madoka's own hands (as we might say that Homura's world is not part of any universe and hence #2 does not apply), but turning into a witch is still impossible - her wish isn't \"I want to eliminate all witches outside of barriers before their are born\", after all.\nFurthermore, Homura \"splitting\" Madoka into Madoka and the Law of the Circle is another such impossibility. #2 says that Madoka - and not the Law of the Circle - will (not can, will - she herself has no choice in the matter anymore) do it with her own hands (provided it happens within a universe). In fact, you might argue that, after the split, the Law will not do it, as it was Madoka, the human, who made the wish, and so, if Madoka, the goddess, and Madoka, the human, are no longer the same entity, it's the latter who has to do it (whether she lacks the power or memory to do so is once again irrelevant - the universe would be changed so she can do it anyway).\nEffectively, the problem is the universal definition of her wish - it has no limitations, and several universal quantifiers, and hence can not really be circumvented.\nThere are even further issues, but they depend on how exactly you interpret the terms \"rule\" and \"universe\".\n", "post_id": "17036", "cluster_id": 1122, "novelty": true, "order": 0}
{"body_text": "How was Sayaka able to join Madoka in the Law of Cycles after her death? Adding onto this question, right after Madoka recreated the entire universe to accommodate with the Law of Cycles, why was everybody placed back in time right after the event where Sayaka gets killed in battle? Why were they placed specifically there in time? Also, do all magical girls join the Law of Cycles after they die? If they do, then what is the point? Madoka's wish was to erase all witches with her own hands, so anybody else in the Law of Cycles wouldn't have a job to carry out since Madoka would be doing it all herself.\n", "post_id": "25699", "cluster_id": 1122, "novelty": true, "order": 1}
