{"body_text": "Why do some anime in Japanese contain English? It seems that many anime and manga aired or printed in Japanese, before they are dubbed or localized, contain English text or lyrics.\nI've tagged a couple of examples here. \nThe first is from Digimon Tamers, wherein there are a couple English lines within the otherwise Japanese title sequence:\n\nAnd another example from Neon Genesis Evangelion, where the text on the monitors is printed in English:\n\nThere are countless other examples (one I couldn't find was another scene from Tamers in which a beer can reads \"BEER\"); so, my question is: \nWhy do these English words make their way into otherwise entirely Japanese productions?\n", "post_id": "835", "cluster_id": 1374, "novelty": true, "order": 0}
{"body_text": "Why is the written language inconsistent throughout One Piece? I noticed even in the Englished Dubbed version of One Piece many of the props (flags, signs, etc) use Japanese symbols rather than alphabetical words, and now, watching on the Subbed version, I notice some things are actually written in English. For example an island entrance says \"Punk Hazard\" and \"Danger\" in English, even though they're speaking Japanese. \nI've noticed this kind of inconsistency elsewhere too, for example, even in the Subbed version, you hear many English words and names, such as their shipwright saying \"Super!\". I've nopticed more things like this throughout the entire series, having watched many episodes in Dubbed and Subbed versions.\nSo, is there an explanation for why English and Japanese are intermingled so heavily in One Piece? it seems odd for the text to be inconsistent. Maybe they produced a few different versions with different text forms, but that would be odd since it's not even an English dubbed version in some cases.  \nWas the writer bilingual? Or was it perhaps a strategy to please English and Japanese viewers equally? Or some other reason?\n", "post_id": "27666", "cluster_id": 1374, "novelty": true, "order": 1}
