{"body_text": "Why does Shurelia appear in Misha's and Aurica's Cosmosphere's? In Ar Tonelico: Melody of Elemia in both Misha's and Aurica's Cosmospheres a girl with white hair appears\n\nIn Level 4 of Aurica's Cosmosphere where she appear as Rei-chan\nIn Level 4 of Misha's Cosmosphere where she appears as Misha's Mother\nIn Levels 5 and 7 she appears as Misha's Sister\n\nIn Stage 3 we find out that the girl seen in Aurica's and Misha's Cosmospheres have to be Shurelia as they have the same hair style and also in Shurelia's Virtual World she looks the exact same as Misha's sister\nNow i could understand why she would appear in Misha's Cosmosphere if the 2 met before Misha became the Star Singer must like how Harmonica appears in Misha's Cosmosphere but not in Aurica's, but Aurica had never met Shurelia before and even thought she was a robot (up until Mir's 3rd attack). while the Cosmosphere is also a mechanic of the game to Develop Misha and Aurica, both have to have passed Level 4 in order to be installed with Purger so regardless of route or personal choice the player will see Shurelia not wearing LINKER as apart of the story.\nSo why was Shurelia appearing in both of their Cosmospheres?\n", "post_id": "23743", "cluster_id": 1434, "novelty": true, "order": 0}
{"body_text": "Why does Mir appear inside Cloche's Cosmosphere According to This answer there is a special reason why Shurelia is able to appear in Misha's and Aurica's Cosmospheres.\nHow in in the 4th Level of Cloche's Cosmosphere Mir appeared despite the 2 never having met. even if the reason for Shurelia appearing in other's Cosmospheres rings true for Mir according to this answer\nthis means IPDs have a totally different server that they connect to plus Infel Pira was man made after the Reyvateils appeared (as Infel, a Reyvateil herself, made it to prepare to sing Metafalica)\nSo i am wondering how is Mir turning up in Cloche's Cosmosphere?\n", "post_id": "28143", "cluster_id": 1434, "novelty": true, "order": 1}
