{"body_text": "What was Natsume hiding in her closet in episode 11? In episode 11 of Tokyo Ravens, what was Natsume hiding in her closet?\n", "post_id": "21200", "cluster_id": 1464, "novelty": true, "order": 0}
{"body_text": "Why is Natsume Desperate During episode 11 of Tokyo Ravens, there was a scene on a weekend that Dairenji Suzuka visited Tsuchimikado Harutora's room and explored its inside just to annoy Harutora.\nThen after that, Suzuka also asked to enter Tsuchimakado Natsume's room. However, Natsume deliberately refused Suzuka's demand even though that they know that Suzuka can black mail Natsume about revealing her great secret.\n\nNatsume even forced herself to go to her room even when Suzuka was already restraining her. \n(Just look at Natsume's worried face XD)\n\nAnd after that, Natsume was forcibly tied by Suzuka in order for them to visit Her room. The inside of the room was pretty normal, so they wondered why would Natsume be that worried, but as Suzuka monitored the room, she noticed a very complicated barrier that is protecting Natsume's closet. Curiously, Suzuka tried to forcibly open the closet by removing the barrier. Then Natsume desperately crawled going to her room with tears in her face showing her great fear of Suzuka opening the closet and them knowing the contents inside.\n(Just look at her annoyingly cute expression as she crawled! XD)\n\nSince Harutora was kind enough to feel pity on Natsume, He ordered Kon to release Natsume from her binding.\nAs soon as Natsume's binding was released, she desperately called Hokuto (Overpowered) just to protect her secret; Thus destroying her room due to Hokuto's size.\n\nNow, this is my question:\n\nWhy was Natsume desperate of not letting them (Suzuka, Harutora, Touji) enter her room, even though its pretty normal? (if there is no exact reason, maybe a girl's perspective will do)\nWhat is inside Natsume's closet? Is it so very important that she even protected it with strong barriers and even called Hokuto just to protect it? (there is also a question related to this but the answers did not fill the void in my heart.\n\n", "post_id": "28293", "cluster_id": 1464, "novelty": false, "order": 1}
