{"body_text": "What does the 'D' stand for in all the names? There are a lot of characters with the middle initial \"D\".  Is this an indication of something, or do they really all just have middle initials of the letter D?  If they are initials, do we know what they stand for?\nExamples of names:\n", "post_id": "724", "cluster_id": 1517, "novelty": true, "order": 0}
{"body_text": "What are the similarities between Gol D. Roger and Monkey D. Luffy? Are they related by blood? What are their and their relatives' ages? This question is regarding One Piece.  \nI have three questions to ask. Since they are interrelated, I'm asking them as a single question on this site.\n\nAs I was reading about the prominent people in the One Piece universe, I came across Roger's page. It has been mentioned there and in many other places that Luffy is quite similar to Roger in character. Theories on some forums have gone so far as to state that Luffy is Roger's reincarnation. So, \n1. Could anyone list ALL the similarities between Roger and Luffy? \nThis question might seem too broad and ambiguous, but when I say similarity, what I'm mostly referring to is\n\nA common something that the two share\nAn instance where Luffy says or does something that reminds someone of Roger\nParallel life events\n\nI came across this video and this link that cover a few of them. I'll post the relevant ones here.\n\nA common something that the two share:\n\nWill of D \nGol D. Roger\nMonkey D. Luffy\nThe Straw Hat \n*Garp\n**Roger  \nHave there been other time related statements in the manga/anime in relation to these four people that could be used to make a rough estimate of their ages? \n\nMy apologies regarding the lengthy question.I put in all the facts that I know so that if anyone answers this question, the things I already know will be skipped. A hardcore One Piece fan will probably be able to answer. Also, my knowledge about the series is mostly limited to the Wikia and Wikipedia pages.\n", "post_id": "28778", "cluster_id": 1517, "novelty": true, "order": 1}
