{"body_text": "What is the viewing order of Fate-related works? I've watched just the 2006 Fate/Stay Night anime series. I know there are other series in the franchise (Fate/Zero, Fate/kaleid Liner Prisma Ilya), as well as the Unlimited Blade Works movie, and the manga. Given that I don't intend to read the VN, what order should I take these works in, and are there any I can skip without losing out?\nEDIT: Some great answers here. I figured there might be some confusion about my unwillingness to read the VN. It's not about the H scenes or the translation patches; it's just an issue of access. I'm not quite willing to spend the $130 to import it, even though I know I would love it if I did. (I read and loved the Tsukihime VN; just don't ask me how I got it.)\n", "post_id": "12832", "cluster_id": 1710, "novelty": true, "order": 0}
{"body_text": "Fate/Zero and Fate/stay night: Unlimited Blade Works - prequel vs sequel vs something else? This may not be the appropriate place to ask this, but since you guys are the most intimately familiar with the anime, I thought I'd ask here.\nI'm designing an anime database for a personal project (not unlike MAL or AniDB), but unlike those two, I have a much stricter definition of the two terms. I define them as:\n\nsequel: a work produced after the original story and continues or expands upon the original story.\nprequel: a work produced after the original story and is set chronologically before the original story.\n\nThis means that all prequels are implicitly sequels, which is what a prequel means.\nNow, the situation with F/Z and F/SN:UBW is tricky. Everyone and their mother tends to see F/Z as a prequel to UBW, because the F/Z visual novel actually is a prequel to the F/SN VN.\nHowever, when it comes to the anime, F/Z was produced first, and then UBW after. In this case, would the UBW anime be considered a sequel to the F/Z anime? Some have argued that UBW was not intended to be a sequel to F/Z at all, but then what would their relationship be? Spin-off? \n", "post_id": "30687", "cluster_id": 1710, "novelty": true, "order": 1}
