{"body_text": "How to summarise the whole Naruto franchise without giving a lot of spoilers? So I've been trying to make one of my friends get into anime. My cousin and I talk about the Naruto franchise and other animes a lot, so my friends wonders a bit whats the big deal.\nI would like to recommend Naruto to her, but she would want me to summarize it for her to see if it sounds interesting or not. The problem is that I don't know how to summarize it. Yes, I can summarize it, but I might get to deep into the story that I might give out some BIG spoilers.\nExamples:\n\n Naruto has a demon inside him (which my friend is going to find out either way). Sasuke leaving the leaf village to kill his older brother. Sasuke has an older brother. Kakashi, Neji, Jiraiya, Asuma, Orochimaru, Deidara, Gaara, etc. die in Naruto Shippuden. Asuma and Kurenai have a kid. There's a war. Tobi being Obito all along. Who Obito is. Kakashi coming back from his death after Pain destroyed the Konoha (Leaf Village). Konoha getting destroyed by Pain. Who Pain is. Stuff like that.\n\nSo my question is how to summarize the whole Naruto franchise to make it sound interesting and not give a lot of spoilers out.\n", "post_id": "30553", "cluster_id": 1723, "novelty": true, "order": 0}
{"body_text": "How to summarize the whole SAO, Sword Art Online, franchise? So yesterday I way talking to my mom about SAO. I'm really bad at explaining stuff so I think I might have confused her when I was talking about it. I was also jumping around from the story. For example I was talking about the beginning then went to the end, then to the middle, back to the end, then back to the beginning. After struggling to explain it to her I tried to summarizing it, but I'm also bad at that so I had a hard time doing that too.\nCan someone please summarize it for me like that I can explain it better to my mom. I told her the main point of the first season, Sword Art Online 1, which was that people got stuck in a game and to get out they had to clear out levels. I also told her that if you die in the game you die in real life. I pretty much told her the main point of the the first season, but didn't get that into the second one.\n", "post_id": "31028", "cluster_id": 1723, "novelty": true, "order": 1}
