{"body_text": "In what order should I watch the Ghost in the Shell series? The Ghost in the Shell series is comprised of several movies and animated TV series.\nTV series:\n\nGhost in the Shell: Stand Alone Complex\nGhost in the Shell: S.A.C. 2nd GIG\nGhost in the Shell: Arise\n\nMovies:\n\nGhost in the Shell\nGhost in the Shell 2: Innocence\nGhost in the Shell: S.A.C. 2nd GIG – The Laughing Man\nGhost in the Shell: S.A.C. 2nd GIG – Individual Eleven\nGhost in the Shell: Stand Alone Complex − Solid State Society\nGhost in the Shell: The New Movie \n\nFor someone completely new to the series, what order should these be watched in? (Are the movies even important to the animated series?)\n", "post_id": "2922", "cluster_id": 1751, "novelty": true, "order": 0}
{"body_text": "Ghost in the Shell separate continuities From reading threads here, I gather there are separate continuities in (all) Ghost in the Shell animes, including TV and movies.  I had a lot of questions about continuity and the separate contuity answers most of them, as there are things that don't make sense if we put all the animes in order.  So trying to separate the continuities, my understanding is the following.  Can someone help and see if this makes sense?\nContinuity 1\nArise serves as a prequel on explaining how Major and Section 9 comes together\nMajor went missing after first movie\nMajor still missing and helps Batou in second movie\n2027- Arise\n2029 - Ghost in the Shell\n2032 - Innocence   \nContinuity 2\nArise serves as a prequel on explaining how Major and section 9 comes together\nCrime solving storyline.  Major stayed with Section 9 all the way through end of S.A.C. 2nd GIG.\nBeginning of Solid State Society mentioned Major left for \"a couple of years\".  This matches the timeline of S.A.C. 2nd GIG end, \nassuming Major's departure is unmentioned in S.A.C. 2nd GIG.\n2027- Arise\n2030 - Stand Alone Complex\n2032 - S.A.C. 2nd GIG\n2034- S.A.C. Solid State Society   \nContinuity 3\nArise serves as a prequel on explaining how Major and section 9 comes together\nMajor looks the same between the two shows.\nOne thing uncertain is in Arise, Major and team reports to Section 9.  But in The New Movie, Major/team and Section 9 seem to be separate entities.\n2027- Arise\n2030 - The New Movie   \n", "post_id": "31664", "cluster_id": 1751, "novelty": true, "order": 1}
