{"body_text": "Is it possible to combine all five chakra elements? The title says it all... but I'll elaborate:\n\nInitially we see techniques derived from a single chakra element (Katon, Doton, Suiton, Fuuton and Raiton). These are the most common, since usually a ninja can master only one chakra nature (since normally ninjas tend to have an affiliation with only one chakra nature)  \nLater we discover these can be combined in a number of ways, creating new elements (Mokuton=Doton+Suiton, Ranton=Raiton+Suiton, Youton=Katon+Doton, among several others). From what I understand, these are usually transmitted as a Kekkei Genkai. But I believe they can also be created by the combinations of the elements, by ninja who didn't inherit it from other generations (correct me if I'm wrong). These are not uncommon, but less frequent than the ones above (there are ninja who can master and possess affiliation to more than one chakra nature: Sasuke comes to mind, since he can master both Katon and Raiton. Katon is his clan's natural affiliation, and he mastered Raiton too. However, I don't remember if he has ever combined the both of them)  \nEven later, we find about combinations of even more elements by ninja who can master several elements, such as Muu (Nidaime Tsuchikage) and Oonoki (Sandaime Tsuchikage), who can combine Katon, Doton and Fuuton, to create Jinton. These are called Kekkei Touta. I don't know if they can also be transmitted through Kekkei Genkai, or if they can only be taught. They are even rarer than the ones above, since ninja can rarely master or be naturally affiliated to more than two chakra natures (Terumii Mei the Godaime Mizukage, can also master Doton, Katon and Suiton, but I don't think she ever combines more than two at each time). \n\nMy questions are:\n\nAre combinations of chakra natures taught or only transmitted by Kekkei Genkai (or both)? \nAre combinations of more than three chakra natures possible? \nAnd the above question created a new one for me: Can a ninja master more than three chakra natures? (I think Kakashi does, but I am not quite sure about this)\n\n", "post_id": "304", "cluster_id": 1764, "novelty": true, "order": 0}
{"body_text": "Kakuzu's way of getting all the five chakra elements So I went back and started reading, or just looking at, really old questions about Naruto, including Shippuden. I read this question, but this answer got my attention. After looking at the answer, I started to wonder how exacly Kakuzu's methods of getting the chakra natures work.\nWe know that he gets all the chakra natures by stealing people's hearts throughout the years once the heart he has on are damaged or just get too old, but how does that work. I always thought the the nature of the chakra was in the body not the exacly the heart. Or do both, body and heart, have the chakra nature, so when Kakuzu gets the heart he gets part of the chakra nature?\nAlso, since we also know that Kakuzu has been living for a while, until Kakashi killed him, exacly how old is he? I know he has been living since the First Hokage was alive, which I guess was about 100 years ago, so I think he was at least a little more than 100 years old.\n", "post_id": "31896", "cluster_id": 1764, "novelty": true, "order": 1}
