{"body_text": "Hinata's & her children's family name by the end of Naruto What is Hyuuga Hinata's family name after she married Naruto? Is it still Hyuuga, or has it changed to Uzumaki? And what about their children? Are their surnames Uzumaki or Hyuuga?\nPlease also post the proof of them being called with their family name and not just quoting their name in Wikia, as the Wikia page currently doesn't have the proof of them being called with their family name (by 29-04-2015 4:20 PM GMT+7 time).\n", "post_id": "21229", "cluster_id": 1799, "novelty": true, "order": 0}
{"body_text": "Why are a lot of characters in anime and manga named after their mothers and not their fathers? I've noticed this a lot in many manga I've read. The character (usually the protagonist) is named after their mother's family name and not their father's. Some examples I have found of this are as follows:\n\nIn Special A, Kei Takashima is named of his mother's family not his father's. Unless the parents were cousins, it seems the dad changed his name to Takashima, too.\nIn Naruto, Naruto Uzumaki is named after his mother Kushina Uzumaki. I know that this may be a plot device to hide who Naruto's father is at the beginning, but still why name after the mother? Why wasn't he named Namikaze?\nIn Shokugeki no Soma, Saiba Jouichiro changes his name to his wife's: Yukihira. Why doesn't he keep his name? It's possible that he wants to stay out of the public eye, but is it common for the man to take his wife's name?\nAnother example from the same manga as above, Azami Nakamura. He changed his name to Nakiri after marrying into Erina's mother's family. It could have been for prestige, but isn't it normally the wife who changes the name and not the husband? And Erina is named from her mother's family too.\n\nSorry for all the examples, but I really would like it if someone could help me understand. I know it could be because of a plot device, but it has confused me for a while.\n", "post_id": "32376", "cluster_id": 1799, "novelty": true, "order": 1}
