{"body_text": "When do the sub-titles (\"determination to fist\", etc.) for each season of Symphogear get dropped? Each season of Symphogear comes with a rather amusing sub-title.\n\nSeason 1: \"Meteoroid-falling, burning, and disappear, then...\"\nSeason 2 (G): \"In the distance, that day, when the star became music...\"\nSeason 3 (GX): \"Believe in justice and hold a determination to fist.\"\n\nWhen, if ever, are these lines uttered in-show? \n", "post_id": "32546", "cluster_id": 1809, "novelty": true, "order": 0}
{"body_text": "Are the Symphogear activation chants translatable? The activation chants (聖詠) for the Symphogear relics are somewhat peculiar. If you've heard them, you likely wondered what was being said. If you've read them (the \"lyrics\" were provided in the booklets accompanying the season 2 OST discs), you're probably outright bamboozled.\n\nAme-no-Habakiri: Imyuteus amenohabakiri tron [OST 1 #10]\nGungnir (Hibiki): Balwisyall nescell gungnir tron [OST 1 #3]\nGungnir (Maria):  Granzizel bilfen gungnir zizzl [OST 1 #6]\nIchaival: Killter ichaival tron [OST 2 #3]\nAirgetlam: Seilien coffin airget-lamh tron [OST 3 #7 (Serena) / OST 6 #6 (Maria)]\nShul Shagana: Various shul shagana torn [OST 5 #5]\nIgalima: Zeios igalima raizen tron [OST 6 #1]\nShen Shou Jing: Rei shen shou jing rei zizzl [OST 5 #5]\nAlso, the Zesshou (Superb Song / Swan Song / Climax Song):\nGatrandis babel ziggurat edenal\nEmustolronzen fine el baral zizzl\nGatrandis babel ziggurat edenal\nEmustolronzen fine el zizzl\n\nNow, these don't look like any actual language (though I obviously can't claim to know all languages that exist). Yet, sites like the Symphogear wikia claim (or at least have, in the past, claimed) to translate the chants - for example, Ichaival's chant was given the translation \"Evening draws in the awakened Ichaival\". \nIs it genuinely possible to translate the chants? If so, from what language or languages are they translated? (In the context of the show, Sumerian or some other old Mesopotamian language would make the most sense, because of Finé's connections to the region.)\nAuxiliary question: if, as I suspect, they are not translatable, by what citogenetic process did these putative translations come into being in the first place?\n(Side note: the zesshou / Superb Song / Swan Song has the same problem: its lyrics are given as \"\", and there are supposed translations of it, as well.)\n", "post_id": "25827", "cluster_id": 1809, "novelty": true, "order": 1}
