{"post_id": "8489", "novelty": true, "cluster_id": 139, "order": 0, "body_text": "Which anime has a girl with spider-shaped music box which is worn as a necklace? This is the part of the episode that I remember:  \nA flashback when they were kids- A boy and girl(antagonist) were playing/dancing to a music box. The music box belongs to the boy and the girl was holding the music box when suddenly she had to leave and forgot to give it back. At that time other kids were also leaving. The boy forgot to ask for her name, so he ask a passing kid if he knew the name of the girl in the white dress. The other boy's friend was also in a white dress so he gave his friends name.\nPresent day(grown up) - the girl(antagonist) has long hair. Maybe it was yellow and the other girl(protagonist) has short hair. I think they were supposed to do something so that they can meet the boy. In the end the boy confronts the short haired girl but found out she was not who he was looking for. After that he saw the long-haired girl holding a music box and dancing.\nThat's all I could remember. hope it helps.\n"}
{"post_id": "8267", "novelty": true, "cluster_id": 139, "order": 1, "body_text": "Anime about a guy searching for some girl with a music box I am looking for this one anime where I saw only one episode. It is about this guy searching for some girl. They played and danced with a music box when they were kids but they were separated before he could ask for her name, then he got her name by asking who the girl in the white dress but it was actually the wrong girl. Then when they grew up the right girl fights so she can find him again to return the music box while the guy keeps thinking it was the other girl.\n\nThe wrong girl had short hair and the right girl had long hair.      \nthe right girl opens a portal to summon the guy. The guy is supposed to be powerful or something, however the guy ignores her and instead goes to the wrong girl who she tells him shes not the one.     \nthe guy then saw a long-haired girl dancing to some music and remembers her.\n\n"}
