{"post_id": "6099", "novelty": true, "cluster_id": 14, "order": 0, "body_text": "How was the Ten Tails actually separated? As we know about the Ten Tails.\n\n Hagoromo separated the monster's chakra from its body before using\n Chibaku Tensei to seal the husk in what would become the moon. From\n there, the Sage used his Creation of All Things ability to divide the\n chakra into the nine tailed beasts.\n\nNow what my question is, How was it divided?\n\nIf we count the total number of tails.\nShukaku  -  1 Tail\nMatatabi -  2 Tails\nIsobu    -  3 Tails\nSon Goku -  4 Tails\nKokuo    -  5 Tails\nSaiken   -  6 Tails\nChomei   -  7 Tails\nGyuki    -  8 Tails\nKurama   -  9 Tails\n--------------------\nTotal    -  45 Tails\n\nI'm kinda curios, that the Juubi had 10 tails in total, so how was it divided?\n"}
{"post_id": "1940", "novelty": true, "cluster_id": 14, "order": 1, "body_text": "Can the Tailed Beasts' relative power levels be compared? A Tailed Beast's power seems to be greater the more tails it has. For example:\n\nPower of 3-Tailed Beast = Power of 2-Tails + 1-Tails.\nPower of 9-Tailed Beast = Power of 8-Tails + 7-Tails + ... + 1-Tails.\n\nThis is clear. But is it possible to compare the power level of the 1-Tails and 2-Tails with this equation? Does the power of the 2-Tailed Beast = the power of the 1-Tailed one? Or is it greater?\nReference links:\n\nMost of them have shared the same idea in this link.\nBadranious's answer in this thread.\n\n"}
{"post_id": "14280", "novelty": true, "cluster_id": 14, "order": 2, "body_text": "Why does Konoha have only 1 tailed beast? While others have 2 considering 1st hokage distributed it to other villages.\nIt doesn't make sense to give other villages to have advantage of having more power. I haven't read manga so have no clue if it's been addressed somewhere.\n"}
{"post_id": "2057", "novelty": true, "cluster_id": 14, "order": 3, "body_text": "Is the Nine Tails still stronger than the Eight Tails even though half of him was sealed away? I've not read the manga series, so the question may be quite basic. \nIn an earlier discussion, it was said that the number of tails determines the power of the tailed beast. Since half the Nine-tail's chakra was sealed by the Fourth Hokage, does it mean that the Eight-tails now has more chakra than the Nine-tails?\n"}
