{"post_id": "9588", "novelty": true, "cluster_id": 145, "order": 0, "body_text": "How did the society where the story of Shin Sekai Yori takes place come to be? How did the society where the story of Shin Sekai Yori takes place come to be? i.e. How did Saki's Society came to existence from the societies of the Dark age?\nI am curious about how Saki's society came to be because, in her society, there is knowledge about science (implied from their knowledge about genes). However, part of it is also mixed with aspects of less modern societies, which makes me want to know how these different aspects came about, from previous societies during the Dark age.\nFurthermore, there are these \"creatures\" called false Minoshiro which seem to be some kind of very advanced bio-technology, which suggest very advanced technology (but their society doesn't really live that way). With these different aspects of ancient Japanese societies and much newer societies, how did Saki's society came to existence? Why does it have this mix of modern technology and more ancient aspects? What happened to the previous Dynasties during the dark age? Did they combine/converge to form the modern society which Saki lives at? From which dynasty from the Dark age did they come from and what do we know that explains their present society?\nAs a refresher, here are some of the dynasties from the dark age:\n\n1st, Slave Dynasties, Where PK users controlled those without PK capabilities.\n2nd, non-PK users who escaped the Dynasties and lived as hunter-gatherers.\n3rd, Bandits who used PK to attack other settlements. \n4th, a group of those who managed to preserve some remnants of the technological age.\n\n"}
{"post_id": "9570", "novelty": true, "cluster_id": 145, "order": 1, "body_text": "What does the \"Dark age\" mean in Shin Sekai Yori? I was wondering, in the anime on the 4th episode \"Bloody History\", they refer to some period of time called the \"Dark Age\". I was wondering (maybe the people that can read the original Japanese Novel can respond this better) what exactly was meant by the \"Dark Age\"? \nI tried to figure what the Dark age was and while searching for that answer, I approximately transcribed (from the subbed english version) when the False Minoshiro talks about that. In that scene he approximately says:\n\nThe turning point for Japan was when \"Boy A\" committed a series of crimes.\n  He realized he could use his PK powers and open the most difficult of\n  locks.  “A” broke into the bedrooms of 19 sleeping women, assaulted\n  them and eventually killed them. At this point Saki and her friends\n  couldn’t comprehend how a human was capable of killing other humans.\n  Even after his arrest people continued to use PK to commit crimes. It\n  became a weapon for terrorists. It split society into a complex mix of\n  opposing political, humanitarian, and ideological factions… ...and the\n  world entered an era of war, unlike any known before. Ironically, the\n  constant threat to the lives of PK users led to a dramatic evolution\n  of their abilities. Meanwhile, the human population plummeted\n  worldwide, until it was less than 2% of what it it’d been at its\n  height. These events serve as an overview of the Dark Ages that lasted\n  five centuries.\n\nFrom that, I concluded that around 2011 A.D. society was something very similar to what we have now (with cars, iPhones, airplanes and normal technology). Then people with PK caused a war and for that reason, human population suffered a terrible decrease to 2%. Then this era lead to a war and then to an era where northeastern Asia divided itself into four distinct and irreconcilable units:\n\n1st, Slave Dynasties, Where PK users controlled those without PK capabilities.\n2nd, non-PK users who escaped the Dynasties and lived as hunter-gatherers.\n3rd, Bandits who used PK to attack other settlements. \n4th, a group of those who managed to preserve some remnants of the technological age.\n\nThen we have the present time where Saki and the others live.\nMy question is, which time period does the \"Dark Age\" correspond to?\nIs the following time scale correct?\n\nOr is the Dark age before the dynasties/division of asia age? Also, what is known about the dark age?\n"}
