{"post_id": "9988", "novelty": true, "cluster_id": 157, "order": 0, "body_text": "How exactly were Madara and Obito able to control Kurama? Madara and Obito could control Kurama with their Sharingans. My question is how exactly did they do it? What is required to control this beast? Is the Sharingan enough to do that? Can they control any other beast with the same technique?\nI remember Kurama once said Madara's chakra could summon it, but how was Obito able to summon and control it on his very first attempt? There's no way he could've practiced it because it was sealed inside Jinchuriki since Madara's defeat against Hashirama.\nSo how exactly were Madara and Obito able to control Kurama?\n"}
{"post_id": "10099", "novelty": true, "cluster_id": 157, "order": 1, "body_text": "How can Madara summon Kurama? According to the wiki trivia:\n\n\"Among the tailed beasts, only Kurama has been shown to be subject to the Summoning Technique.\"\n\nBut how can this possible? Controlling a tailed beast doesn't mean that it can be subject to Summoning Technique. Did Madara sign a contract (form of a scroll) with Kurama?\n"}
{"post_id": "7531", "novelty": true, "cluster_id": 157, "order": 2, "body_text": "Does Obito master the Summoning Jutsu? I've seen the recent episode of the anime, and I saw,when Obito summoned Kurama. I'm interested in the fact,that does he got some kind of \"contract\" with some animals/things??(that would mean,that you are really able to summon). I've checked out on the Narutopedia,and it appears only the Gedo Mazo by his name,so the summoning of the Nine-tails,it's a normal(just simple) summoning technique?? Because you must have that kind of bond between you and the summoned animal,which is made with your chakra/blood, just like Naruto did with the toads and it would be weird if you would be able to summon a tailed beast just \"because\"\n"}
{"post_id": "13666", "novelty": true, "cluster_id": 157, "order": 3, "body_text": "How did Uchiha Obito summon Kurama? If Uchiha Madara was the only one who could summon Kurama, how did Obito do it? Also, Naruto was 16 while Kakashi looked about 30, so if Kakashi and Obito were the same age, and Obito summoned Kurama while Naruto was born, he would be younger than Naruto is now.\n"}
