{"post_id": "11347", "novelty": true, "cluster_id": 165, "order": 0, "body_text": "What anime is this? It's a bit old and I don't think it's popular I watched a few episodes of this show a little over 4 years ago and i'd like to know what it is so i can watch it again. This has been bothering me for a long time now. If i'm not specific enough, or get details wrong i apologize. My memory about this show is very vague.\nThe main protagonist was a young boy, age range anywhere from middle school to high school. He had dark hair and i think he rode a motor scooter around the town. I also believe he was poor. It has a kind of 'Baccano' feel to it so the setting for the time period is probably similar.\nHe finds a small box and eventually it turns into a giant robot. Not a mecha per say because it couldn't be piloted. So he and the robot become friends and he tries to hide the robot from his family, often sneaking out to the junkyard where he hid it. Eventually a couple other kids pop up that also have robots. I think it mostly focuses on one girl. \nThere's also an organization, maybe the government, maybe some guy just lusting for power. Either way he's trying to get his hands on all these robots, so the kids have to fight him off and eventually the kids and their robots are wanted by the police.\nFinally, there's a guy, probably an older man, who lives in the junkyard and he knows all about the robots and assists the kids in whatever ways he can. \nI know this explanation is very vague and i apologize. Any help identifying this show is greatly appreciated. Thanks for reading and if you have any help, thank you for that too.\n"}
{"post_id": "9898", "novelty": true, "cluster_id": 165, "order": 1, "body_text": "Man on a motorcycle who tries to deliver a package in one scene I am trying to find an anime I have been searching countless hours for! I was incredibly young when I first watched it, maybe 10 years ago or longer. There is only one scene that is in it that I remember and I'll try my best to describe it!\nI think this could be an anime movie or a series - I have no idea!\nSo, the only thing I remember is watching somebody on a motorcycle try to deliver a package. I think the address that he was told to go to did not exist and he runs into some trouble (people seeking the package). He tries to escape, but in doing so, he falls off his motorbike and the package slips off and opens. Inside is a black cube that looked highly magnetised and it attached to a big metal garbage bin, and after that, it started attracting all things metal to it, which it absorbed in abundance, and after that had happened, it turned into a robot or mecha or something that was humanoid but large and made out of metal!\nThat is about all I can remember clearly but everything else I could have said is terribly vague so it's not likely for it to be true!\n"}
