{"post_id": "10068", "novelty": true, "cluster_id": 191, "order": 0, "body_text": "Forgot the name of a romance anime series I watched I forgot the name of an anime series I watched between 2000 and 2010. It had a boy and girl who fell in love in it. The girl had an older brother that she really looked up to, and he went off and got married. It flashed back to her watching his older brother and his girlfriend kissing before they got married at a river at sunset. I don't know much more, but this same thing happened near the end with the girl and the guy that fell in love. They kissed at the same river... I think it mentioned something about fireflies in it. If anyone can answer this question correctly, thank you so much.\nRefined plot summary\n\nGirl looked up to her older brother a lot. Once he got a girlfriend\n  and got married, she got angry at him and couldn't forgive him. She\n  later kissed with the main character at the same place that her older\n  brother did once.\n\n"}
{"post_id": "10043", "novelty": true, "cluster_id": 191, "order": 1, "body_text": "Anime about an orphan boy, that lives with pirates on a sky-ship I saw an anime about an orphan boy who lives with pirates on a sky-ship. \nThey rob rich ships. Then they find a crate and in there is a girl that has a stone in her forehead.\nLater, she turns into a weapon when she and the boy sing a song together, and the story is about them getting her back to the land of those people who can turn to weapons. \nI think they are called something with Elden.\n"}
{"post_id": "13364", "novelty": true, "cluster_id": 191, "order": 2, "body_text": "Need help identifying an anime about a boy traveling on a sailing ship It was an anime set in what seemed to be 19th century Europe. The animation style resembles LoGH so I suspect it might be from the '80s.\nA blond boy called Cory or something similar (though the japanese name may be different) is traveling/working on a sailing ship trying to find his missing parents. There was someone - I think an evil uncle - who wanted to eliminate him to get the family fortune. \nThe boy had a love interest who was traveling on the same ship. She was a dark-skinned girl who was being sent to marry a prince or a nobleman she didn't really fancy. She was traveling with a tiger (I think his name was Rajah) and a bear? \nThe ship was either heading for or sailing from India. I remember there was a crew member called Scar or Scarface who worked for the guy who wanted to get rid of Cory.   \nI remember watching it as a little girl in the late '90s but it could easily have been from the '70s or '80 since I'm from Europe and the shows we got to see were an amalgam of cartoons from various periods and countries. \nI've been looking for ages on Wikipedia through lists of anime from the '60s all the way to the '90s but can't find it so it might not have a page there. If you remember a show like this any help is greatly appreciated because I've almost gone nuts trying to find it :) \nThanks in advance!\n"}
{"post_id": "12926", "novelty": true, "cluster_id": 191, "order": 3, "body_text": "Little girl that gets power to turn into a gorgeous older person and can sing very well So when I was a little kid that was around 2000-2003/2004. It was an old anime, one of those 1990 anime, I used to watch this anime or cartoon.\nI think the cartoon originated in Chinese making, but I'll just call it anime.\n\nThe main character is a girl who is not that much of a looker and she likes an older boy.\nShe wanders off and by coincidence meets magical beings which give her the power to turn into a pretty pinked hair girl, taller in height, and is able to sing.\nShe is so pretty that she gets a job as a singer/model and she sings in front of a crowd, at first she hums. \nWithout a name, and not wanting to give her identity, she names herself what her parents food store is. I forgot.\n\nCan anyone please tell me the name of this anime?\n"}
