{"post_id": "22813", "novelty": true, "cluster_id": 197, "order": 0, "body_text": "Why did Yoshihiro Togashi recycle designs from yu yu hakusho for his characters in hunter x hunter? \nAlthough Gon's not similar by facial design he is similar by green schemes that yusuke has and hair color is similar\n\nKillua is similar from hiei's demeanor\n\nBoth have androgynous appearances\n\nPersonalities are similar\n"}
{"post_id": "22624", "novelty": true, "cluster_id": 197, "order": 1, "body_text": "Why do anime and manga use the same faces? \n\nMany shows use the same face template throughout.  Why do they use this?\n"}
{"post_id": "2872", "novelty": true, "cluster_id": 197, "order": 2, "body_text": "Why do many characters tend to have crazy hair colors and styles? It's fairly common that anime characters tend to have \"wilder\" hair than most people we see in real life. This can be seen as far back as Neon Genesis Evangelion (though somewhat mild) from the 90s (though some older anime, like Akira, do not have this characteristic).\nThe \"wilder\" hairstyles tend to have interesting colors from throughout the rainbow (pink, blue, green, etc.) that are only seen in real life with dyes or highlights. They also tend to be spikier, another trait not seen in real life (probably because gelling one's hair that way every day is quite tedious).\n\nWhy do anime and manga characters tend to have this spiky, colorful hairstyle? What is the cultural origin of such a style? (And did the growing trend of Japanese teenagers spiking their hair in a similar style originate from this?)\n"}
{"post_id": "29080", "novelty": true, "cluster_id": 197, "order": 3, "body_text": "How did the unnatural hair color aka You gotta have blue hair trope originate? I specifically want to know which manga or anime started the trend, and reason from there, not make general assumptions.\nFor example, from the short clips I've seen of the anime \"アタックNo.1\", it contains mostly black-haired girls, a couple of brunettes and a sparse blonde. No one there is pink/red/blue-haired. Same with Princess Knight.\n"}
{"post_id": "8181", "novelty": true, "cluster_id": 197, "order": 4, "body_text": "Is it common for mangaka to maintain the same characters design between different titles? After reading rave-master and fairy-tail I noticed the high similarity in their characters. Some even being identical copies of the characters out of the other series.\nSo how common is it for a mangaka to maintain the same character design through out several of their manga's? Or is this just something Hiro Mashima does ? \n"}
{"post_id": "21310", "novelty": true, "cluster_id": 197, "order": 5, "body_text": "Are the similarities between Homura Akemi and Kiritsugu Emiya intentional? Puella Magi Madoka Magica's Homura Akemi and Fate/Zero's Kiritsugu Emiya were both written by Gen Urobuchi, although Kiritsugu was created by Type Moon's Kinoko Nasu. There are numerous similarities between them:\n\nBoth are magic users with control over time.\nBoth augment their magical powers with modern weaponry.\nBoth are very taciturn, but deeply loving towards certain people (Homura towards Madoka and Kiritsugu towards Iri and Illya).\nBoth are mentally damaged by the horrors of war (Homura's experiences in the time loops and Kiritsugu's experiences in various war zones over the years).\nBoth characters are pivotal to the events of the story, but for most of the series the viewers, and even the main heroine herself, have no idea what they are thinking.\nBoth have something of a gap in ideals with the main heroine (Homura's actions during the movie go against Madoka's wishes, while Kiritsugu and Saber clash so much from the very beginning that Kiritsugu assigns her to work with Iri).\nBoth have great hair :)\n\n\n\nWas this just an archetype of Urobuchi's writing, the way Stephen King spent three decades writing about common household objects trying to kill people? Or is there an interview or any evidence which suggests this was intentional? As a related question, how much of Kiritsugu's overlap with Homura was Nasu's doing, and how much was Urobuchi's?\n"}
{"post_id": "8074", "novelty": true, "cluster_id": 197, "order": 6, "body_text": "Is Plue in Fairy Tail and in Rave the same? Plue exists on both Hiro Mashima's manga Rave Master and Fairy Tail. Is Plue the same in Fairy Tail & Rave?\nPlue in Rave:\n\nPlue in FT:\n\n"}
