{"post_id": "14186", "novelty": true, "cluster_id": 209, "order": 0, "body_text": "I'm searching for an anime from the 90s/2000 I remember watching this anime years ago, probably around 1999/2000 or maybe some years later. \nIt was about a human (important point) girl who woke up after some kind of cataclysm because she was inside a capsule shaped like a bird, with an AI able to speak to her. From what I can recall that she never leaves said capsule when she wanders the world.\nShe is trying to reach a place where there should be living humans, since the rest of the population is either dead or has undergone some kind of mutation which gave them animal traits.\nI remember that she had at least 3 companions, a boy who could have had monkey traits, a \"mascot\"-like character looking like a lion who could transform into a muscular version of himself when they were fighting and another one of whom I can't recall anything. \nAt some point she finds out that she's actually the only human still alive, but I'm pretty sure there was more to it. \nI watched this after it was translated in italian so it probably came out some years before the moment I saw it. \n"}
{"post_id": "14173", "novelty": true, "cluster_id": 209, "order": 1, "body_text": "An anime in in late '90s/early 2000's So I remember this anime I watched when I was little.\nI'm 17 now so I'd say this anime is somewhere around the early 2000's or late '90s. The only things I can remember about it are that the main character is a boy and he wears this like crown headband thing that I believe has a jewel in it. And that he meets this girl and he offers to protect her (I assume after saving her) and says \"I could protect you? What do ya say?\". The characters in this show have some sort of powers but I can't remember what it was exactly, since my memories is a bit blur as it was so long ago.\nI also remember that the protagonist had brown hair and was wearing yellow armor (I believe). In one episode, the protagonist fought this guy (who for some reason reminds me of a clown), and during the fight he went through this transformation and was able to beat him.\nThat's all I can remember about it. I've been searching it up for hours with no luck so if you could help that would be amazing!\n"}
