{"post_id": "3282", "novelty": true, "cluster_id": 222, "order": 0, "body_text": "How far into the manga did the Kimi ni Todoke anime reach? Since the Kimi ni Todoke manga is still running, and the anime ended in 2011, it's safe to assume that the anime didn't adapt everything. However, I know that a lot of it was adapted reasonably faithfully, and I'd rather avoid rereading things which were part of the anime.\nWhat manga chapter corresponds to the end of the second season of the anime? Also, are there any story arcs which were omitted from the anime up to that point?\n"}
{"post_id": "14744", "novelty": true, "cluster_id": 222, "order": 1, "body_text": "Does Sailor Moon Crystal contain the Black Moon arc of the manga (Pluto and Chibiusa)? Has it been officially stated anywhere by a representative at the production company whether Sailor Moon Crystal's 26 total episodes cover the Black Moon arc of the manga (Chibiusa, Sailor Pluto, and the Black Moon Clan, equal to season R of the classic anime series)?  Has it been stated anywhere that it only covers the content of the Dark Kingdom arc of the manga (equivalent to the first season of the classic anime)?\nCrystal has covered in a mere 8 episodes the equivalent of 33 episodes of the classic anime series which contained 46 episodes total.  In other words, it has covered 72% of the classic anime's first season content within only 31% of Crystal's scheduled episode count. I know that Crystal is based on the original manga, that it is not adapting the classic anime, and that the manga storyline progressed much faster (less filler), but even so, that's a big percentage of the manga's Dark Moon arc to have already shown us in only 8 episodes.\nThe opening animation sequence does not include any characters introduced in the Black Moon arc, but then again, it could receive a new animation sequence mid-run at the point in time when that manga arc would begin (without a second season needing to occur to herald the story arc shift).\n"}
