{"post_id": "15105", "novelty": true, "cluster_id": 231, "order": 0, "body_text": "Excalibur and Calibur in fate stay night, which one is King Arthur using in history? So in fate stay night Saber her Noble Phantom is called \"Excalibur\" which is the same name as her sword. But when Shiro trace the Excalibur, it turns out that is the one that Saber lost forever.\nSo my question is, did King Arthur in History own two sword called Excalibur and Calibur?\n"}
{"post_id": "11194", "novelty": true, "cluster_id": 231, "order": 1, "body_text": "In Fate/Zero and Fate/Stay Night, why is King Arthur female? Why is Iskander tall? I've watched both the Fate/Zero and Fate/Stay Night anime, and the Unlimited Blade Works movie, (none of the visual novels so no spoilers from that, unless they are light spoilers). One thing that bothered me was that despite the fact that heroic spirits are defined by the public opinion/view of them, some heroes had qualities that were in direct opposition of what the public thought.\nWe know that heroic spirits, being sealed on their Throne of Heroes, are meant to be completely unchanged. This is the entire point of the Throne of Heroes. But this seems to be in opposition of the previous fact that heroic spirits are defined by what others think they are. Then there are counter-guardians who are completely different, I believe, in that they are not sealed on their Throne of Heroes.\nOne particular important counter-guardian of the series is Arturia, or Saber. Arturia is female, despite the fact that she was treated by even her contemporaries as male, and has gone done in history as male. In fact, there isn't even any small hint as to Arturia's gender being anything other than male in our history, or the history of the Nasuverse (I believe). This being true, shouldn't Arturia be male?\nThis not being the case shouldn't Arturia be erased, or else create instability in the World? Same with Iskander. In history he is known for being pretty short, even for a Macedonian. That he is very tall means there is an incongruity with human knowledge and true fact.\nFurthermore, in the Unlimited Blade Works movie Archer is revealed to be Heroic Spirit Emiya. If Heroic Spirit Emiya is summoned before he is even a hero, or acquired his gift from the World, etc., then how is it that Heroic Spirit Emiya is even strong at all? The power of a servant being based on their popularity at the time of their summoning, Emiya should be weaker than pretty much every other servant, and then some.\nMaybe I'm just over-analyzing things, or I have some misconception. In any case, answers are appreciated.\n"}
{"post_id": "14238", "novelty": true, "cluster_id": 231, "order": 2, "body_text": "Why is Rider called \"Iskander\" instead of \"Alexander\"? The true identity of Rider in Fate/Zero is Alexander the Great, the famed conqueror and King of Macedonia. Since Alexander conquered so many countries, his name has been adapted to many different languages, including Arabic, Persian, and Turkish, in which he's known as Iskandar, Eskandar, and İskender. (Source.)\nThe page I linked says the Japanese forms of the name are \"アレクサンドロス (Arekusandorosu), アレクサンダー (Arekusandā), アレキサンダー (Arekisandā)\" which are all based on the Greek form, Ἀλέξανδρος (Alexandros), or the English/general European form, Alexander. Did the staff ever publish any statements about why Rider is called by a Middle Eastern form of his name, Iskander, instead of using one of the European forms based on \"Alexander\"?\n(Note: If the answer contains spoilers for Season 2, please use spoiler tags, or at least warn me at the top.)\n"}
