{"post_id": "16706", "novelty": true, "cluster_id": 248, "order": 0, "body_text": "What is the gender of Armin in Shingeki no Kyojin? One of my friends read an article which claimed that Armin Arlert of Attack on Titan is female. Can anyone confirm or deny this?\nThis article included the following statement:\n\nQ: Out of the group of female characters in the 104th Trainee Squad, who did Mikasa get along with the most?\nA: Armin\n\nThis related article further states the following:\n\nIsayama has revealed that Armin is a female character.  Now this is a huge surprise for Shingeki no Kyojin fans.  Everyone thought that Armin was always a boy but it looks like she was a girl.\n\nFinally, here's another article discussing the possibility of Armin being female.\n"}
{"post_id": "3520", "novelty": true, "cluster_id": 248, "order": 1, "body_text": "Who was the first \"trap character\"? A \"trap character\"(UrbanDictionary entry, may be NSFW) is a character who appears to be a girl until you get in close enough (plot-wise) to discover they are, in fact, a boy. The inverse trope exists as well; a \"reverse trap\" character is a girl who appears to be a boy. \n(Note: The word trap here is not intended to be offensive, or a slur; it is only used to refer to fictional characters of this type.)\nSome examples are Ruka Urushibara of Steins;Gate and Sora Kamomeya of Tsui☆Teru (pictured below):\n\nWho was the first trap character in anime and/or manga, and what media did the trope originate from?\n"}
{"post_id": "23272", "novelty": true, "cluster_id": 248, "order": 2, "body_text": "Why are \"traps\" and \"genderbending\" so common in anime and manga compared to Western media? It seems to me that anime and manga has tropes like \"traps\" and even characters that change gender quite frequently, especially in comparison to Western series, which seem to have characters more consistently within \"the binary.\" In particular, I'm thinking of shows like Ranma 1/2, Maria Holic, Ouran High School Host Club.\nI am under the impression that Japanese culture is quite conservative, so this doesn't make much sense to me. I would expect a conservative culture to create series that aren't so liberal with gender related themes.\nIs there a reason for this? Or am I somehow biased? Are there strong counterexamples to my observation?\n"}
