{"post_id": "11371", "novelty": true, "cluster_id": 266, "order": 0, "body_text": "What is this old Anime set in prehistoric times? I watched it as a kid in the early 90's but the style was a bit older. It was on VHS.\nThe title was something like: Ray/Rei the hero? of the jungle? but it was a dubbed version so I'm not sure.\nThe protagonist is Ray? a young man. He has black hair and wears yellow furs. I don't remember the plot but he travels with his friends in a prehistoric world.\nI remember two scenes:\nSomewhere in the middle of the movie - they are on a raft on a lake and under them is a ginormous dinosaur. I guess it emerges from the water causing them to ride the wave and scream.\nTowards the very end - there is a village where a volcano is about to erupt so they want to sacrifice a girl to it: that would be the friend of the protagonist and the granddaughter of the old woman who wants to sacrifice her. \nBeware Spoilers!\n\n Volcano erupts, girl gets killed somehow I think in a fight, someone lays the girl down on the ground with the volcano with flowing lava in the background, old woman is praying to the volcano. And my friend's mom turned off the TV saying \"you shouldn't watch films like this\" (well, too late) and I never knew the end.\n\nThe old woman had long white hair & purple robes?, girl had long brown hair.\nPlease tell me what this is, I cannot find it anywhere.\n"}
{"post_id": "18550", "novelty": true, "cluster_id": 266, "order": 1, "body_text": "An old anime/cartoon set in prehistoric time where the main character dresses like Tarzan and lives in a jungle I am looking for an old anime/cartoon. I have no idea about the name, the year it was published, the original language or whether or not it was an actual anime.\nThings I know:\n\nIt takes place in prehistoric times, a little bit after dinosaurs.\nIt was an adult man (dressed like Tarzan) that was struggling to survive (I think he had blond hair, and possible a girlfriend or wife).\nHe was living in the jungle with thick vegetation.\nI watched it in 2000 ± 2 years but the anime could be 20 years older than that.\n\nI think the main character's name was Koblan(k)/Coblan(k)/Moblan(k). His name was also mentioned in the intro.\nIt was played in Greece. It's not Shounen Kenya or Genshi Shounen Ryuu.\nThank you for your time.\n"}
