{"post_id": "252", "novelty": true, "cluster_id": 269, "order": 0, "body_text": "Is it possible for a Byakugan user to awaken the Rinnegan? Well... the title says it!\nI ask this because, supposedly, Hyuuga and Uchiha are descendants of the Rikudou's eldest son (at least I am under that impression). In that way, does the Byakugan have any other special techniques that can be awakened (such as Tsukuyomi, Susano'o and Amaterasu in the Sharingan), and can it (ultimately) awaken the Rinnegan?\nSo far we have not seen techniques that derive from the Byakugan itself, but rather techniques that are possible because of it: the whole Hyuuga fighting style comes from the use of Byakugan, but it is not related to it in the same way that every Mangekyou technique is related to the Sharingan. They were only able to develop/and use it properly due to them having the Byakugan, but (again) it does not relate to it in the same way the Mangekyou relates to the Sharingan.\nTo sum up:\nIs it possible for a Byakugan user to awaken a Rinnegan?\n"}
{"post_id": "15494", "novelty": true, "cluster_id": 269, "order": 1, "body_text": "Why doesn't the Byakugan have a second stage? The Uchiha Clan had the Sharingan which  has a lot  of different stages: \n\nSharingan (Increases power with age/3 commas = maturity)\nMangekyo Sharingan (Unlock = Kill a close friend/family member) (Blindness over time)\nTime Erase (Kasashi's Mangekyo Sharingan)\nEternal Mangekyo Sharingan (Perfect vision/Incredible Power)\nAmaterasu (Invincible Fire Attack)\nTsukuyomi (Illusion Technique)\nMind Control (Shisui Uchiha 'Mental Genjustu')\nCopying Ability (Endless library of techniques) (See opponents techniques/Mimic opponent)\nSusano'o (Giant Skeleton/Invincible Sword 'Totsuka Blade'/Invincible Shield 'Yata Mirror')\nThe Blade and Mirror were found by Itachi, by unknown means - Teleportation\nIntangibility (Madara Uchiha)\nIzanagi (Dream/Illusion Technique)\nSharingan+Rinnegan Techniques\nMangekyo/Eternal Mangekyo \n\nAnd it varies for each user in shape and appearances:\n\nSasuke Uchiha - Six-Sided Star Shape (Mangekyo) Six-Sided Cyclone (Eternal)\nItachi Uchiha - Three-Sided Cyclone\nKakashi Hatake - Bizarre Three-Sided and Curved Cyclone\nMadara Uchiha - Izuna Uchiha - Stange Opened Circle with Three Squarish-Openings\nShisui Uchiha - Four Sided Throwing Star\n\nBut the Byakugan stays the same and every member has the same one.\nSo it makes me curious, why doesn't Byakugan have a second stage?\n"}
