{"post_id": "18861", "novelty": true, "cluster_id": 277, "order": 0, "body_text": "What are these scenes in Angel Beats parodying? Angel Beats! is full of parodies, some are obvious, and some are not. I identified the following parodies/homages:\nEpisode 2\n\nThe Laser Hallway is likely a homage to Resident Evil.\n\nEpisode 3\n\nYuri crossing her fingers (finger tenting) is a parody of the Gendo Pose from Neon Genesis Evangelion.\nTakeyama's pi attack, having the same effect as the Ring Tightening Mantra, might be a homage to Journey to the West.\nTakeyama's finger pointing (and appearing from behind Yuri) is a parody of Detective Conan.\nOtonashi's first mosaic image of Angel's area is clearly Laputa: Castle in the Sky.\nOtonashi's second mosaic image of Angel's area is clearly Howl's Moving Castle.\n\nI'm still left with many scenes that I believe to be unidentified parodies. What are they parodying? Please include episode number and a brief description so I know which ones you are answering, e.g. Ep 5: Angel vs SSS.\nEpisode 5\n\nOtonashi imagines an all-out battle between Angel and SSS.\n\nOoyama is so scared that he shat bricks.\n\n\nEpisode 7\n\nOtonashi imagines the monster in Operation Monster Stream.\n\nFishing Saitou realizes they have caught Monster Stream on a hook.\n\n\nEpisode 10\n\nSomeone from Captain Tsubasa?\n\n\nEpisode 11\n\nOtonashi imitating Yagami from Death Note?\n\nAngel slashing the shadows.\n\n\nEpisode 12\n\nTK knockin' on Heaven's Door.\n\nThe SSS yakuzas.\n\nYuri upon hearing that she could become god.\n\n\nOVA Special: Stairway to Heaven\n\nYuri's evil ojousama laugh.\n\nRed-eyed Yui attacks from the sky with a full moon in the background.\n\n\n"}
{"post_id": "3108", "novelty": true, "cluster_id": 277, "order": 1, "body_text": "What is TK's actual name? \"TK\" is a mysterious character who tends to speaks in nonsensical English phrases depending on the situation.\nWas it ever revealed what is his actual name? Also, why do the other SSS members call him \"TK\"?\n\n"}
