{"post_id": "464", "novelty": true, "cluster_id": 28, "order": 0, "body_text": "If there's only one of each fruit, how could Blackbeard recognize the \"Dark Dark\" fruit? If someone had seen it before you'd think it would have been eaten. \nAnd I also thought I remember a segment about no one knowing their fruit before they ate it. (I think it was with the CP9 arc)\n"}
{"post_id": "7818", "novelty": true, "cluster_id": 28, "order": 1, "body_text": "Which devil fruit is this, and what happend to it? During the punk hazard arc we can see one of the apples in the sleigh transform into a devil fruit just before smiley turns every thing in to a deadly gaseous goo. \nWhat happened to this devil fruit afterwards, and which devil fruit is it to begin with. Is it ever shown?\n"}
{"post_id": "3134", "novelty": true, "cluster_id": 28, "order": 2, "body_text": "What happens if a Devil Fruit is destroyed? We know that if a Devil Fruit user dies, their fruit reappears (see In One Piece, does the devil fruit reappear after the user dies?). However, this doesn't answer the question of what happens when the fruit gets destroyed without being eaten. I don't know if that's even possible, but I imagine so with sufficient effort. \nIf a devil fruit is destroyed, would the fruit reincarnate in a nearby fruit (the same as when the user dies), or would it be destroyed for good? \n"}
{"post_id": "2979", "novelty": true, "cluster_id": 28, "order": 3, "body_text": "In One Piece, does a Devil Fruit reappear after the user dies? In chapter 702, we see Ace's Devil Fruit 'Mera Mera no Mi' being showcased as the prize of the event held in the Colosseum. The announcer of the event mentions that the \"fruit is reborn.\"\nDoes it mean every Devil Fruit has that ability to be reborn once the user dies, or is it an artificial Devil Fruit made by Doflamingo's factory?\n"}
{"post_id": "5919", "novelty": true, "cluster_id": 28, "order": 4, "body_text": "How is the ability of a Devil Fruit discovered? Since there is just one Devil Fruit for a specific ability, how does one know about what ability it holds?\nFor example, Buggy and Teach knew about the powers their Devil Fruits would have provided them.\nIt is mentioned that they had read about it.\nBut if the fruit occurs only once till the user dies, how did they find out about the fruits' powers?\n"}
{"post_id": "13660", "novelty": true, "cluster_id": 28, "order": 5, "body_text": "How long does Devil Fruit take to re-spawn after the death of user? After the death of Devil Fruit (DF) user, the DF re-spawns. This has been explained. After the death of Ace, Mera Mera no Mi re-spawned as shown in chapter 701.\nMarshall D. Teach, user of the Yami Yami no Mi fruit, stole the power of the Gura Gura no Mi from White Beard after he died. It is explained that it does not re-spawn as soon as the user dies.\nSo how much time does it take to re-spawn and how long does the power of DF remain inside the user after he/she dies?\n"}
{"post_id": "931", "novelty": true, "cluster_id": 28, "order": 6, "body_text": "Can multiple people/animal eat a single Devil Fruit? Provided, Chopper eats the Devil Fruit along with the other deers, will they all have the Devil Fruit ability, given that acquiring the ability only requires a single bite?\n"}
{"post_id": "28202", "novelty": true, "cluster_id": 28, "order": 7, "body_text": "How did Brook know what his devil fruit was? What I'm wondering is...is it possible to know what devil fruit power a devil fruit holds before a character eats it? Don't devil fruit eaters find out what their devil fruit powers are by experiencing the powers first hand.\nI'm asking this because how on earth would Brook know that he ate the revive-revive fruit if he hasn't died yet? (For reference, in a flash back before he became a skeleton, the crew members ask him how his revive-revive devil fruit power works, to which he replies \"I'm not exactly sure, I haven't died yet, so I wouldn't know.\" -I'm paraphrasing of course)\n"}
