{"post_id": "19281", "novelty": true, "cluster_id": 282, "order": 0, "body_text": "Did Kirito lie about being the *best* beta tester? I watched SAO on Crunchyroll, where the subtitles for episode 2 have Kirito saying: \n\nI made it higher than anyone else during the beta test.  The reason I knew the bosses skills is because I fought monsters with katana skills on floors far above us.\n\nAt the time, I just accepted this as \"Kirito is just that good,\" which was born out by his skills and abilities later on in the series.  After all, someone had to be the best.\nHowever, this question claims he lied during that speech, and I've since checked the dubbed version, where he says\n\nDuring the beta, I made it to floors that were higher than any of the other testers.  That's a fact.  I knew about the boss 'cause I fought tons of monsters with way more sword skills on higher floors.\n\nThe implication of word choice and tone in the dub does sound like the kind of exaggerated bragging that gamers do when they're claiming preposterous things, but the subs don't convey that to me at all.\nIs there any information showing whether he was actually lying?  Was he just a good beta tester (possibly in the lead group), or was he really significantly above everyone else?\n"}
{"post_id": "13233", "novelty": true, "cluster_id": 282, "order": 1, "body_text": "What other Beaters were there in Sword Art Online? In Episode 8 - Black and White Sword Dance, after Kirito got Asuna to agree to cook the Ragout Rabbit, Asuna dismissed Kuradeel and got refused:\n\nKuradeel: I can not leave you alone with a shady character like this\nAsuna: While I can't say anything about his shadiness, he is actually quite strong. In fact, he's 10 levels above you, Kuradeel.\nKuradeel: Are you implying that I am somehow inferior to him? Wait, don't tell me he is one of those Beaters.\n\nIn Episode 2 - Beater, after beating Illfang the Kobold Lord, Kirito was discovered as a Beta player. Reflecting on Diavel's request, Kirito takes an antagonist stance and lies about how far he had progressed during the beta of SAO:\n\nKirito: I made it to floors not even the other Beta players could reach.\nKibaou: Then that makes you worse than a Beta, YOU A GODDAMN FILTHY CHEATER.\nBackground Player: He's a Beater!\nKirito: Beater huh? Yeah, I like the sound of that.\n\nI was under the impression that Kirito was the only \"Beater\". However, Kuradeel says one of those Beaters, which implies that there are more as apart from him. Using the plural form, Kuradeel is grouping Kirito with others.\nSo I am wondering, were there any other Beaters in SAO? If there were, do we know who they were?\n"}
