{"post_id": "121", "novelty": true, "cluster_id": 31, "order": 0, "body_text": "Why does Himura Kenshin say ～ござる (~gozaru) at end of every sentence? Why does Himura always end almost every sentence with gozaru in this show? Is this normal for people in that time period?\n"}
{"post_id": "124", "novelty": true, "cluster_id": 31, "order": 1, "body_text": "Why does Naruto have a catch phrase? In both the anime and manga Naruto often ends his sentences with either \"dattebayo\" or \"believe it\" in the English translations. \nWhy is this a thing?\nIs it meant to further his character or provide a bit of remembrance of his character to the reader or viewer, or even other characters of the series?\n"}
{"post_id": "7069", "novelty": true, "cluster_id": 31, "order": 2, "body_text": "Where did \"dattebayo\" come from? In Naruto, at least in the early show, he uses the catchphrase \"dattebayo\" in the Japanese. This question answered on a canon-level where it came from (his mother), but I was wondering where (if anywhere) it came from in terms of the language. I know that there's no direct translation, but is it a sort of portmanteau or version of somebody's name or of some phrase in Japanese?\n"}
{"post_id": "27241", "novelty": true, "cluster_id": 31, "order": 3, "body_text": "What does it mean when Kenshin says 'oro'? Throughout the series Kenshin has added 'oro' somewhat comedically to his sentences. Is there any actual meaning to this or is this just a speech style/pattern that he has?\nIn episode 62 he says it several times in a row and Kaoru points this out.\n\n"}
{"post_id": "22719", "novelty": true, "cluster_id": 31, "order": 4, "body_text": "Why does Trafalgar D. Law use 'Ya-や(屋)' suffix while addressing others? Using ~-san, ~-kun, ~-sama while addressing other people is common in Japanese culture.But Law uses ya as suffix while addressing people, like in the nicknames Strawhat-ya for Luffy and Blackleg-ya for Sanji, and in real names Zoro-ya, Nami-ya and Nico-ya.\nYa are translated as Mr. or Miss. in English. But in Japanese adding ya defines someone's profession. It is not that Law does not use ~-san at all, Like with Corazon and sarcastically with Vergo. As stated in this page.\nSo why does Law use ya rather then ~-san, ~-kun, etc. while addressing others?\n"}
{"post_id": "3317", "novelty": true, "cluster_id": 31, "order": 5, "body_text": "What is the significance of anime characters' catch phrases? Uzumaki Naruto (Naruto) has a catch phrase \"dattebayo\". Ika Musume (Squid Girl) has a catch phrase \"de geso\". Himura Kenshin (Rurouni Kenshin) has a catch phrase \"gozaru\". And a lot more examples here.\nWhat is the significance of anime characters' catch phrases? \n"}
