{"post_id": "19036", "novelty": true, "cluster_id": 323, "order": 0, "body_text": "Help Identify This Mecha Anime Please help me identify this mechs anime from my childhood. I only have vague memories of it. I completely understand if this info is too generic to help, but I figure it's worth a try.\nIt was about a boy who gets involved in some kind of (military? government?) mech program. There are already some other people there piloting mecha. The boy forms some kind of connection with a mecha that is smaller than the rest, and also somewhat feminine-looking. At least, it seemed to have high heels on its feet. To my childish brain that may have registered as something very feminine. Anyway, this mech, though smaller than the rest, turns out to have some hidden power in it.\nIf this vague mish-mash is at all identifiable, please help me.\n"}
{"post_id": "21315", "novelty": true, "cluster_id": 323, "order": 1, "body_text": "Mecha anime where boy pilots small, somewhat feminine robot that can teleport to him I found one post on this site that might be about the same anime that I'm looking for. It's not answered and already closed.\nFrom that question, Help Identify This Mecha Anime:\n\nIt was about a boy who gets involved in some kind of (military? government?) mech program. There are already some other people there piloting mecha. The boy forms some kind of connection with a mecha that is smaller than the rest, and also somewhat feminine-looking. At least, it seemed to have high heels on its feet.  \n\nNot sure but I think I watched it the late 1990s.\nNow, what I remember is that, that boy also gets another, big yellow robot. Once, when his fraction is under attack and he gets cornered in a corridor, he steps back and surprisingly appears in that yellow robot, it turns on and he starts fighting.\nThe small robot isn't usual. It's not just standing there and waiting for that boy to drive it. Boy and small robot, they have some kind of spiritual connection. Boy can call him and the robot somehow teleports to him. He also can combine that small and big yellow robot.\nAnd I also remember that scene when that boy is stack in a big spaceship, which is about to explode and he calls that small robot but it's not teleporting.\nI think these shows are the same; does anybody know it?\n"}
