{"post_id": "8177", "novelty": true, "cluster_id": 324, "order": 0, "body_text": "How do Luffy's Gear attacks work? Might just be me missing an explanation part in the manga, or just not properly understanding at the time. But how does Luffy's Gear 2nd and 3rd attacks work? \n\n"}
{"post_id": "8594", "novelty": true, "cluster_id": 324, "order": 1, "body_text": "Does the usage of Haki affect the user in any way? We know that Haki is a mysterious power present inside every individual. But only few people are able to awaken and use it. It is very closely related to the willpower of a human being. So the question which arises here is: Does the use of Haki affect the user (physically or mentally) in any way? Does excessive use of Haki take a toll on the user?\n\nIf it is so, how exactly does it affect the user, since Haki isn't something like a physical energy?\nIf it isn't so, why don't the Haki users use it all the time? Why do they use it only in specific cases like a battle, or entering enemy territories, etc?\n\n"}
{"post_id": "22011", "novelty": true, "cluster_id": 324, "order": 2, "body_text": "Why does Luffy use Gear Second so much? As mentioned here, Gear Second decreases the user's life span. When he first used Gear Second, it was a really important decision to make since it's side effect is so brutal. But after Enies Lobby Arcs he started using it casually. What changed and made Gear Second from a very risky technique to a casual technique? \n"}
{"post_id": "22004", "novelty": true, "cluster_id": 324, "order": 3, "body_text": "In the Dressrosa Arc, why doesn't Luffy use Gear Second to quickly reach Doflamingo? In the Dressrosa Arc, Luffy runs or rides constantly in order to reach Doflamingo - first he rides the bull Moocy, then he rides Cabbage's horse, and later starts running himself. \nWhy doesn't Luffy use his Gear Second instead to quickly reach Doflamingo? We have seen how swiftly he moves and jumps from one place to another in Gear Second. \nI get the point that he was carrying Law with him, but I guess that shouldn't be problem for him.\n"}
{"post_id": "11497", "novelty": true, "cluster_id": 324, "order": 4, "body_text": "Why are Haki attacks not effective on Marine admirals? Why are Haki attacks not effective on Marine admirals?\nIn the Marineford war, we see countless instances where Haki-imbued attacks don't affect Marine admirals. When Marco and Vista attack Sakazuki, he even acknowledges that they are Haki-imbued, but nothing apparently happens:\n\nAnother case is when Whitebeard attacks Aokiji: \n\nWhat's with the admirals? Their Logia powers don't seem to be easily affected by Haki attacks. I mean we have many instances where Haki has touched their body, but still there are many instances where attacks on their body don't result in damage. What's the deal with Marine admirals? \n"}
