{"post_id": "21427", "novelty": true, "cluster_id": 340, "order": 0, "body_text": "Why do the subtitles say \"tetsusaiga\" for \"tessaiga\"? I've been watching Inuyasha with subtitles and in episode 6 and 7, Inuyasha fights with his brother Sesshomaru about a sword. The English subtitle says \"Tetsusaiga\" but they're clearly saying \"てっさいが\". Why are they subtitling it in this way?\n"}
{"post_id": "894", "novelty": true, "cluster_id": 340, "order": 1, "body_text": "What does 'moe' mean? I've now watched quite a few anime and I'm still at a loss as to what the term moe represents. Is there an agreed upon definition for it? If a character is moe, what does that mean?\n"}
{"post_id": "28922", "novelty": true, "cluster_id": 340, "order": 2, "body_text": "What is gap moe? I often hear the word gap moe, but I do not know what it means. So what does the word gap moe mean?\n"}
{"post_id": "22089", "novelty": true, "cluster_id": 340, "order": 3, "body_text": "What's does sama and kun means? Previously I though that sama was for equal or higher rank shinobi's \nand kun was for junior rank Shinobi's.\nFor example -\nYamato called Kakashi as Kakashi-sama, whereas Naruto as Naruto-kun.\nBut I noticed that I might be wrong as Hinata too called Naruto as Naruto-kun. \nSo what's the actual meaning of Sama and Kun?\nI found some answers here. But can anyone explain this with respect to the anime?\n"}
{"post_id": "26528", "novelty": true, "cluster_id": 340, "order": 4, "body_text": "What are the characteristics of a \"tsundere\"? Although this question might be a naive thing to ask, I believe that I would get an much detailed answer to this question keeping in mind all my simple questions answered wonderfully by people in the past. I read the wiki page on Tsundere but there's not much, I understand the broad definition where a person has a combative attitude towards a particular protagonist in any anime. What I am looking for, is an all-encompassing criteria/concept of a 'tsundere' and the highlights of their social behavior.\n"}
{"post_id": "20981", "novelty": true, "cluster_id": 340, "order": 5, "body_text": "How does \"The Disappearance of Nagato Yuki-chan\" relate to the Haruhi Suzumiya series? MAL's page on The Disappearance of Nagato Yuki-chan lists it as a spin-off for both The Melancholy of Haruhi Suzumiya and The Melancholy of Haruhi Suzumiya (2009).\nHow exactly does the new series relate to the others?\nWhere does it fall into the timeline?\nOr is it completely independent aside from using the same characters - in which case, can it be watched without previously having watched any of the older series?\n"}
