{"post_id": "4748", "novelty": true, "cluster_id": 361, "order": 0, "body_text": "Why do anime/manga characters have big eyes? Going as far back as Astroboy, anime and manga characters have had big eyes.\nWhat is basis of this trend? How and where did this originate?\n\n"}
{"post_id": "7539", "novelty": false, "cluster_id": 361, "order": 1, "body_text": "Why are most people in anime white or European-looking (instead of Japanese)? Anatomically speaking Europeans don't look like that either. But most of the people look more European than Japanese, at least it seems to me ... Maybe it's the round eyes? And the non-black hair in some cases?\n"}
{"post_id": "20641", "novelty": false, "cluster_id": 361, "order": 2, "body_text": "Why was One Piece white washed? After the two-year time skip, Zoro and Robin came back lighter skinned. I would have thought nothing of it, but after searching for \"fishman racism\" on Google, I ran into an article on Oda's racism towards \"ethnic\" people. One Piece is my favorite anime and I watch it a lot, so I don't take any \"white washing\" argument lightly. I don't even want to think of Oda as having racial bias, but I won't ignore the facts.\nThe article discusses different aspects of One Piece that can lead one to believe that the show has some racist undertones, but I won't go into detail about the article. The story about racism in One Piece mentions that Oda did tell the animators to change certain things concerned with the two-year time skip, and two of the dark-skinned characters came back way lighter. Is Oda racist? I don't know but I can't say he isn't, as the article had valid and reasonable points to prove that he at least has a racial bias.\nThen after reading the article above, I am sitting around thinking about it from time to time. So was it actually white washed or did these changes happen for some other reason?   \n"}
{"post_id": "4748", "novelty": true, "cluster_id": 361, "order": 3, "body_text": "Why do anime/manga characters have big eyes? Going as far back as Astroboy, anime and manga characters have had big eyes.\nWhat is basis of this trend? How and where did this originate?\n\n"}
{"post_id": "7539", "novelty": true, "cluster_id": 361, "order": 4, "body_text": "Why are most people in anime white or European-looking (instead of Japanese)? Anatomically speaking Europeans don't look like that either. But most of the people look more European than Japanese, at least it seems to me ... Maybe it's the round eyes? And the non-black hair in some cases?\n"}
