{"post_id": "14021", "novelty": true, "cluster_id": 364, "order": 0, "body_text": "What are the differences between the original and the re-cut versions of Psycho-Pass? I know that the original show has 22 episodes and the re-cut version has 11 one hour long episodes. However, I want to know if there are any major differences. What are the differences between the 2012 version and the 2014 version of Psycho-Pass? Did they add new scenes or information? \n"}
{"post_id": "16775", "novelty": false, "cluster_id": 364, "order": 1, "body_text": "When does Brotherhood and the 2003 series split? So I've watched FMA: Brotherhood and Star of Milos. I want to watch conqueror of Shamballa but it seems like it continues from the  original series.  I don't want to have watch the original series since I know that the earlier portions of the story are the same as Brotherhood . Is there an episode in the original series I can start watching from that's starts to have a different story path from Brotherhood? Or should I just read about the originals ending?\n"}
{"post_id": "15574", "novelty": false, "cluster_id": 364, "order": 2, "body_text": "What are the differences between the original Kaito Kid specials vs. the new Kaito Kid 1412 series? I am currently watching Kaito Kid 1412.\nShould I watch the other Kaito Kid anime films?\nWhat's the difference between this version and the 1412 version?\nAnd another question, what's the meaning of 1412?\n"}
{"post_id": "8694", "novelty": false, "cluster_id": 364, "order": 3, "body_text": "What are the differences between the Broken Blade films and series? I've been watching the Broken Blade \"films\" (as they're referred to on Wikipedia), and they're each about 50 minutes long. I was reading, however, that they are releasing an anime series. I don't really get why they're releasing a series when they already have a series, so I was wondering what the difference is, both in structure (is the difference only length, or is it also methods of video release, etc.) and content between the film series and the anime series.\n"}
{"post_id": "4781", "novelty": false, "cluster_id": 364, "order": 4, "body_text": "What are the differences between the 2002 and 2006 versions of Kanon? I only watched Kanon (2006) which is made by Kyoto Animation. What are the differences between the 2002 version and the 2006 version of the series?\n"}
{"post_id": "17153", "novelty": false, "cluster_id": 364, "order": 5, "body_text": "What is the correct watching order of Fullmetal Alchemist? I have been recommended to watch Full Metal Alchemist. However, the person who recommended this series to me can't remember the correct order. After googling it, I'm confused as many people have posted different orders.\nSo what is the correct watching order of Fullmetal Alchemist?\n"}
{"post_id": "6867", "novelty": false, "cluster_id": 364, "order": 6, "body_text": "What differences are there between the Magical Girl Lyrical Nanoha anime and manga? I'm look into reading ViviD and Force, the two sequel manga to the StrikerS manga, and I am wondering: what differences are there between the three anime seasons and the three related manga that could affect the reading of ViviD and Force?\n"}
{"post_id": "4299", "novelty": false, "cluster_id": 364, "order": 7, "body_text": "Does the Fullmetal Alchemist manga deviate significantly from either of the anime series? I've seen both the 2003 anime and Brotherhood, and I know Brotherhood is more faithful to the manga than the 2003 anime. So I'm wondering if it's worth the effort to get all the Fullmetal Alchemist manga, or is Brotherhood so faithful to the manga that it's just the manga in anime form (i.e. the manga has no major plot twists that deviate from the anime)?\n"}
{"post_id": "16689", "novelty": false, "cluster_id": 364, "order": 8, "body_text": "What episode and what chapter do Fullmetal Alchemist 2003 series and Fullmetal Alchemist Manga start to differ? I just finished watching Fullmetal Alchemist 2003 series. I would like to read the manga now. Does anyone know at what chapter the story of FMA2003 and the story of the manga go different ways?\n"}
{"post_id": "55", "novelty": false, "cluster_id": 364, "order": 9, "body_text": "What's the difference between the FMA and FMA Brotherhood series? I haven't watched Anime in many years, but recently I've had time to get back into it. I've seen that one of my favorite series, Fullmetal Alchemist, has done a series reboot.  What I'm wondering is:\nDoes it present a lot of deep variations (plot-wise, character-wise or otherwise), or is it just the same series with updated art?\n"}
{"post_id": "4423", "novelty": false, "cluster_id": 364, "order": 10, "body_text": "What's the difference between Fullmetal Alchemist and Fullmetal Alchemist: Brotherhood? I've recently finished watching Fullmetal Alchemist and I then proceeded to watch an episode of Brotherhood before realizing, Brotherhood isn't actually a continuation of the first series. I then discovered there was a movie that tied up the loose ends at the end of the first series. Now, I want to know, what actually is Brotherhood? I've read that it's simply a version of the show that follows the manga more closely, but I haven't read the manga and I really enjoyed the first series. Will watching Brotherhood disappoint me or change my views of the ending? Could I have watched Brotherhood without having watched the first series (or at least before)? Are there any major (specific) changes that might frustrate someone who is dead-set on things happening like they did in the first series?\nI know I have a lot of questions, but I hope someone can answer most of them! Thank you so much!\n-Junebug\n"}
{"post_id": "726", "novelty": false, "cluster_id": 364, "order": 11, "body_text": "How do the Homunculi differ between the FMA manga and anime? I know that the actual characters who are the homunculi differ between the FMA manga and original anime. For instance, Sloth is a different person between the manga and the anime. However, do they differ in how they are created? If so, how do they differ?\n"}
{"post_id": "18840", "novelty": false, "cluster_id": 364, "order": 12, "body_text": "Psycho Pass Episode / Special Order I just watched season 1 (episodes 1-22) of Psycho Pass on Netflix and now I want to watch the rest.\nOn the Funimation site there is:\n\nEpisodes 1-22 (Season 1)\nSpecials 1-11\nEpisodes 23-33 (Season 2)\nAlso there is the recently released movie.\n\nI haven't started any of the specials or season 2 yet; I don't want to accidentally watch something out of order and spoil it. My question is: Where do the specials fit into the series? Between the two seasons? Side stories? Prequel? After season 2? When should I watch them?\nThe episode lists I've found seem to leave out the specials so I'm not sure how they fit in.\n"}
{"post_id": "7460", "novelty": false, "cluster_id": 364, "order": 13, "body_text": "How much different are the live action and manga versions of \"Yamada-kun to 7-nin no Majo\"? I ususally read Yamada-kun to 7-nin no Majo manga from time to time.\nRecently, I heard a Live Action version was aired and completed. But its manga is still ongoing.\nSo how much of the manga is covered by the live action version? And how closely does the live action version follow the manga version?\n"}
{"post_id": "14021", "novelty": true, "cluster_id": 364, "order": 14, "body_text": "What are the differences between the original and the re-cut versions of Psycho-Pass? I know that the original show has 22 episodes and the re-cut version has 11 one hour long episodes. However, I want to know if there are any major differences. What are the differences between the 2012 version and the 2014 version of Psycho-Pass? Did they add new scenes or information? \n"}
{"post_id": "55", "novelty": true, "cluster_id": 364, "order": 15, "body_text": "What's the difference between the FMA and FMA Brotherhood series? I haven't watched Anime in many years, but recently I've had time to get back into it. I've seen that one of my favorite series, Fullmetal Alchemist, has done a series reboot.  What I'm wondering is:\nDoes it present a lot of deep variations (plot-wise, character-wise or otherwise), or is it just the same series with updated art?\n"}
{"post_id": "7460", "novelty": true, "cluster_id": 364, "order": 16, "body_text": "How much different are the live action and manga versions of \"Yamada-kun to 7-nin no Majo\"? I ususally read Yamada-kun to 7-nin no Majo manga from time to time.\nRecently, I heard a Live Action version was aired and completed. But its manga is still ongoing.\nSo how much of the manga is covered by the live action version? And how closely does the live action version follow the manga version?\n"}
{"post_id": "15574", "novelty": true, "cluster_id": 364, "order": 17, "body_text": "What are the differences between the original Kaito Kid specials vs. the new Kaito Kid 1412 series? I am currently watching Kaito Kid 1412.\nShould I watch the other Kaito Kid anime films?\nWhat's the difference between this version and the 1412 version?\nAnd another question, what's the meaning of 1412?\n"}
{"post_id": "8694", "novelty": true, "cluster_id": 364, "order": 18, "body_text": "What are the differences between the Broken Blade films and series? I've been watching the Broken Blade \"films\" (as they're referred to on Wikipedia), and they're each about 50 minutes long. I was reading, however, that they are releasing an anime series. I don't really get why they're releasing a series when they already have a series, so I was wondering what the difference is, both in structure (is the difference only length, or is it also methods of video release, etc.) and content between the film series and the anime series.\n"}
{"post_id": "6867", "novelty": true, "cluster_id": 364, "order": 19, "body_text": "What differences are there between the Magical Girl Lyrical Nanoha anime and manga? I'm look into reading ViviD and Force, the two sequel manga to the StrikerS manga, and I am wondering: what differences are there between the three anime seasons and the three related manga that could affect the reading of ViviD and Force?\n"}
{"post_id": "4781", "novelty": true, "cluster_id": 364, "order": 20, "body_text": "What are the differences between the 2002 and 2006 versions of Kanon? I only watched Kanon (2006) which is made by Kyoto Animation. What are the differences between the 2002 version and the 2006 version of the series?\n"}
