{"post_id": "22969", "novelty": true, "cluster_id": 365, "order": 0, "body_text": "Dimensional train I'm looking for an anime with two siblings traveling via train that transported them to another dimension. They were looking for their parents. On their travel they met a girl that can transform in to a tiger/cat humanoid whenever she looked in a circular mirror, they also met a mysterious guy that saves them. The guy has a gun with different kinds of bullets that when fired have different effects.\n"}
{"post_id": "20465", "novelty": false, "cluster_id": 365, "order": 1, "body_text": "What is this anime which started with a boy and his sister riding on a train to another dimension to search for their scientist parents? I watched this anime 10 years ago or more, and I missed the ending. During my childhood, this is one of my favorites.\nThe anime started with a little boy and his little sister riding a train at midnight to search for their lost parents. They met a girl in the train who rode the train to unlock the mystery of the train, and she also revealed that the train only appeared at midnight. The siblings told her they were in search of their parents who were scientist and was lost during the blast a year ago.\nTheir journey began when the train sent them into another dimension or world, where they met a man who possessed a gun with bullets of different type of effect (like fire, ice, water, air, etc.). Eventually, the man joined them in their search for the children's parent and sent them home too.\nI guess that's a lot. Hope someone knows. Thank you :)\n"}
{"post_id": "22886", "novelty": false, "cluster_id": 365, "order": 2, "body_text": "Anime where brother and sister hop through different dimensions? I remember getting an anime box set from the library, and it had this really cool plot, but I never finished it because they only had the first box set or something like that?\nAnyway, there's this brother and sister, and theres some cataclysmic event that opens a rift to another universe, which is really just several different interconnected worlds. I think theres a train that connects them, but I'm not positive. \nTheres also a guy with a gun that has weird bullets in it, I don't remember exactly what his deal was, but he was like, this stereotypical stoic character. \nI believe their parents/father had something to do with some kind of research about the event, but I don't think that was a huge part of it.\n"}
{"post_id": "30025", "novelty": true, "cluster_id": 365, "order": 3, "body_text": "How to find an anime you don't know the name of About two kids who go on a mysterious train to look for there parents in wonderland the main characters are twins ones a boy and ones a girl they meet a women on the train and get to wonderland and there they meet a chicken and have many adventures on there way\n"}
{"post_id": "20465", "novelty": true, "cluster_id": 365, "order": 4, "body_text": "What is this anime which started with a boy and his sister riding on a train to another dimension to search for their scientist parents? I watched this anime 10 years ago or more, and I missed the ending. During my childhood, this is one of my favorites.\nThe anime started with a little boy and his little sister riding a train at midnight to search for their lost parents. They met a girl in the train who rode the train to unlock the mystery of the train, and she also revealed that the train only appeared at midnight. The siblings told her they were in search of their parents who were scientist and was lost during the blast a year ago.\nTheir journey began when the train sent them into another dimension or world, where they met a man who possessed a gun with bullets of different type of effect (like fire, ice, water, air, etc.). Eventually, the man joined them in their search for the children's parent and sent them home too.\nI guess that's a lot. Hope someone knows. Thank you :)\n"}
{"post_id": "22969", "novelty": true, "cluster_id": 365, "order": 5, "body_text": "Dimensional train I'm looking for an anime with two siblings traveling via train that transported them to another dimension. They were looking for their parents. On their travel they met a girl that can transform in to a tiger/cat humanoid whenever she looked in a circular mirror, they also met a mysterious guy that saves them. The guy has a gun with different kinds of bullets that when fired have different effects.\n"}
