{"post_id": "24209", "novelty": true, "cluster_id": 398, "order": 0, "body_text": "Logia Type Devil fruit user with power to control WATER We know that devil fruit users are weak against water and even if a part of body is submerged inside water they can't use their powers. \nSo consider a Devil Fruit User who has power to manipulate water (hoping there isn't one already that I missed out). \nWhen Ace is fighting Blackbeard or Smoker, being a Fire-type he could walk through fire so going with the same logic, same should be the case with water type users.\nWill he be an exception to the above rule?\n"}
{"post_id": "5041", "novelty": false, "cluster_id": 398, "order": 1, "body_text": "Would a water manipulating Devil Fruit user be able to swim? If all Devil Fruit users in One Piece anime are not capable of swimming, what about a Devil Fruit user whose ability is to control water? Can such a person able to swim or evade the Devil Fruit's curse?\n"}
{"post_id": "24209", "novelty": true, "cluster_id": 398, "order": 2, "body_text": "Logia Type Devil fruit user with power to control WATER We know that devil fruit users are weak against water and even if a part of body is submerged inside water they can't use their powers. \nSo consider a Devil Fruit User who has power to manipulate water (hoping there isn't one already that I missed out). \nWhen Ace is fighting Blackbeard or Smoker, being a Fire-type he could walk through fire so going with the same logic, same should be the case with water type users.\nWill he be an exception to the above rule?\n"}
{"post_id": "23344", "novelty": true, "cluster_id": 398, "order": 3, "body_text": "Why Can Devil Fruit Users Use Their Abilities While Wet My understanding was that the sea is supposed to weaken devil fruit users and rob them of their powers. The One Piece wiki elaborated: \n\nDevil Fruit users are susceptible to all types of water, not just\n  seawater. This includes the white sea surrounding Skypiea. [Oda]\n  elaborated on this, saying that \"moving\" water, like rain or waves,\n  does not weaken Devil Fruit users, while standing water does.\n\nThe wiki also states the users cannot use their powers while submerged.\n\nEven if a part of the user is submerged, they cannot use their Devil\n  Fruit powers, no matter how much or how little is submerged. However,\n  if the user's body has been permanently altered by the fruit, then the\n  user's ability can be manipulated by outside sources (eg Luffy's neck was stretched while submerged at Arlong Park).\n\nMy questions:\n\nHow did Ajoki freeze the ocean?\n\n\nMay I emphasize he submerged his hand in the sea to use Ice Age.\nHow did Luffy fight Crocodile while wet at Marine Ford?\n\n\nHe was dripping wet after having fallen into the sea. Does the water not weaken him since he was no submerged? I assumed since sea stone worked just by touching it and it has the same effect a the ocean, then by having part of the ocean \"touch\" him would drain his power.\nAre these just plot holes or am I missing something?\n"}
{"post_id": "25754", "novelty": true, "cluster_id": 398, "order": 4, "body_text": "Is there a Fish-Fish no mi? Is there any Zoan Akuma No Mi that gives the user the ability to transform in fish (Fish-Fish No Mi)? If so can the user swim in the sea?\n@Edit: I don't read the manga, so I don't know if anything like this has already happened or not\n"}
{"post_id": "5041", "novelty": true, "cluster_id": 398, "order": 5, "body_text": "Would a water manipulating Devil Fruit user be able to swim? If all Devil Fruit users in One Piece anime are not capable of swimming, what about a Devil Fruit user whose ability is to control water? Can such a person able to swim or evade the Devil Fruit's curse?\n"}
