{"post_id": "10075", "novelty": true, "cluster_id": 413, "order": 0, "body_text": "What is the total Naruto runtime up to this point? Naruto seems to be one of few longest-running series, and considering the number of episodes so far, this adds up to quite considerable time.\nWhat is the total runtime - the time I'd have to spend in front of the screen if I wanted to watch the whole series (including any 'paraphenalia' like OVA etc), from beginning up to current point?\n"}
{"post_id": "29853", "novelty": true, "cluster_id": 413, "order": 1, "body_text": "Where should I start in the Naruto Series I'm not new to the Naruto franchise. I'm also up to date with what's currently going on (Madara vs Naruto & Sasuke). But I want to know the details of how everything happened. From which episode should I start. I want to at least start past the whole Pain storyline and around where the Fourth Ninja War starts? Anyone got an idea on where I should start?\n"}
{"post_id": "8768", "novelty": true, "cluster_id": 413, "order": 2, "body_text": "How can I quickly understand the basics of Naruto and the story without watching all 300+ episodes? I would like to start watching Naruto as I have never attempted or tried to get into watching Naruto. The main problem I have is that I don't want to watch all 300+ episodes in Naruto or read the dozens of Mangas to understand what Naruto is about and the many plots that are involved.\nI know this might be a really silly question for someone who watches anime and this may sound very far fetched but I havent watched Naruto before. I do not want to read through pages and pages of information from Naruto's Wikia and do not want to go watching through episode through episode of about 300+ to understand Naruto.\nAre there any episodes in Naruto that will help me understand the story and key terms/terminology without doing this? In other words I am looking for a short cut.\nThink of this scenario: Death Note created two special episodes for those who have not watched it before so they wouldn't have to go through all the episodes to understand the plot. Did Naruto do this? If so that would be extremely helpful.\nPlease note: I have not watched ever Naruto or Naruto Shippuden and as such have no actual knowledge of anything Naruto.\n"}
{"post_id": "25968", "novelty": true, "cluster_id": 413, "order": 3, "body_text": "What is the total runtime of One Piece up to this point? After reading this Question and the ingenious answer from Dimitri mx (kudos) and a related comment, I came to wonder how One Piece would compare.\nThe anime was launched in October 1999 and is still ongoing.\n"}
