{"post_id": "26178", "novelty": true, "cluster_id": 419, "order": 0, "body_text": "Waiting in the Summer and Onegai Sensei seem to plagiarise each other. Is this normal in anime/manga? Waiting in the Summer and Onegai Sensei have TONS of things in common:\n\nLuscious Redhead Alien Main Romantic Interest? Check.\nIs she a Meganekko (warning: TV Tropes) even though her advanced alien civilization surely can fix the need for glasses? Check.\nMature demeanor indicating a slightly older woman? Check.\nWorks as a neutral observer on Earth? Check.\nCannot get into a relationship with natives due to alien regulations and job specifications? Check.\n\n\nLikes to look candidly over the shoulder while holding arms stiff against the back so to enhance the \"natural attributes\" during the show OP? CHECK!\n\nAlmost kills the MC during the first episode due to crappy piloting re-entry skills? Check.\nSaves the life of MC after the crash? Check.\n\nStrange critter that doubles as the spaceship control interface? Check.\nCritter has the ability to teleport said alien redhead on demand? Check.\n\n\nLolita manipulator that seems to know everything behind the scenes? Check.\nSecondary \"death flagged\" romantic interest that never stands a chance against the aforementioned hot redhead alien? Check.\nRedhead is forcefully removed from Earth for breaking alien law? Check.\nJapanese countryside (almost rural) setting? Check.\nCharacter design by Taraku Uon? Check.\nManga serialized by Media Works? Check.\n\nI really felt deja vu all the time.\nIs it common to repack almost the same story, setting and characters into another series?\n\nI already told how the series are almost a copy of one another, I want to know how common is it to repack the same basic storyline and sell it again.\nIf the two series are in the same world is stuff for another question: What proof do we have that Waiting in the Summer and Onegai Sensei (and Twins by proxy) are set in the same Earth?\n"}
{"post_id": "26236", "novelty": true, "cluster_id": 419, "order": 1, "body_text": "What proof do we have that Waiting in the Summer and Onegai Sensei (and Twins by proxy) are set in the same Earth? Offshot of: Waiting in the Summer and Onegai Sensei seem to plagiarise each other. Is this normal in anime/manga?\nIt is said that both animes are set in the same Earth (I.E., Waiting in the Summer is a sequel of Onegai Series). While my first question addresses how common is to have two series that are almost a plagiarims of one another, this question is about these two series per se.\nWhat evidence do we have to prove that Waiting in the Summer is indeed in the same World/Earth/Universe than Onegai Sensei, Onegai Twins?\n"}
