{"post_id": "26614", "novelty": true, "cluster_id": 425, "order": 0, "body_text": "Questions about nationalities and languages in Death Note In the Death Note 2015 series, some people sometimes speak English. For instance when Raye Penber and Bell talk and when Lind L Tailor comes out on TV, it's in English.\nThe Death Note anime of course acknowledges the existence of the English language, like in the first episode, when people with English names are written down in the Death Note and when Near says 'Mister' Aizawa, but a lot of English speaking people instead speak Japanese.\nSo this got me to thinking,\n\nAre L, Mello, Near, Watari, Beyond Birthday et al Western people who just so happen to be fluent in or at least sufficiently speak and understand Japanese?\nL once adopted the alias Ryuga Hideki. How would anyone think that a Western-looking person has a Japanese name? Is his cover story that he was adopted by a Japanese family or something?\nAre they necessarily British just because Wammy's House is in England?\nIn general, is there anyway to know for sure what language is being spoken between a Western person and an Eastern person in the Death Note anime? For instance, when Light and L talk, are they talking in Japanese or English? How about when Near and Light talk?\n\n"}
{"post_id": "26678", "novelty": true, "cluster_id": 425, "order": 1, "body_text": "Do the Wammy's House members speak to each other in English? Related to this question: Questions about nationalities and languages in Death Note\nIt seems the Death Note 2015 series tries to incorporate the English language when appropriate, but even though Watari, L and Near are supposedly Western, they speak Japanese to each other. I guess it would be weird if they were played by Western actors even though their characters are supposedly Western. Artistic license and all that.\nMight be a dumb question, but in the anime and manga, is it safe to assume that the Wammy's House members speak to each other in English?\nI guess it's obvious that when Mello and Near here about L's death, they speak in English to each other and w/ the person who informed them about L's death.\nWhat about for instance when Mello and Near were talking in the SPK place or whenever L and Watari talk privately? It's in English right?\n"}
