{"post_id": "18711", "novelty": true, "cluster_id": 456, "order": 0, "body_text": "An anime with a \"ghost\" younger sister, a witch who kills undead and a goth loli sadistic witch I'm looking for an anime where the main character was on board a train on his way to school with whom appeared to be his younger sister (apparently, only he could see her), where he met a girl on the train when another girl seemingly committed suicide by jumping in front of the train. The problem was that the girl committing suicide was not dead. The girl on board proceeded to get off the train, then cast some strange spell and finished off the undead girl. The boy's \"younger sister\" then told him that the girl was a witch. I think all of this happened in the first episode.\nThere is another scene in this anime where a goth loli witch showed up and got picked up by some pervert. She let him strip her at a hotel maybe? Then she cast a spell, leaving the man to be eaten by a swarm of insects from her nether regions. The goth loli then transferred to the same school as the main character and the witch on the train. \nThe transferred witch went on a tour of the school with the main character. The goth loli had a sadistic nature and enjoyed killing.\n\nThe first scene shows the main character near a body of water (I can't quite remember if it was a river or the ocean), with some type of golem forming in front of him, but he wasn't scared. This leads me to believe that he could use some form of magic, and it might be the case that the little girl who accompanied him on the train wasn't a ghost, but maybe something he created.\nAbout the witch on board the train with them, I think she wore glasses and she was just sitting there until the train stopped because a girl jumped in front of it. At this point, I vaguely remember some form of monologue from the main character about how people kill themselves by train and how he never paid too much attention to the witch on board with him. After the girl who committed suicide was \"killed\", his invisible friend then stated that the girl on the train with them was a witch.\n"}
{"post_id": "15338", "novelty": true, "cluster_id": 456, "order": 1, "body_text": "A romance anime where the male protagonist slowly get interested in the female protagonist, who can smell the seasons It was a school romance.\nThe main girl was short with brown/blond hair and a big forehead. The main guy was tall with dark hair.\nHe had been going out with a model (I think) since middle school but was slowly becoming interested in the main girl.\nShe can smell seasons? Like she can smell if it's spring or winter.\nEventually another interest gets involved, I think a friend of his, but I think he backs off and tells him to get it together?\nI remember a scene if it will help. When they finally get together, they're at a train station and hug tighter, and tighter. Well, the next day the class knows and teases them\nI have looked and looked and cannot for the life of me figure out what this anime is.\n"}
