{"post_id": "28355", "novelty": true, "cluster_id": 473, "order": 0, "body_text": "What are the swastikas on the car's navigation supposed to represent? In episode 12 of Himouto! Umaru-chan there appear swastikas on the car's navigation. What are these supposed to represent? \n \n"}
{"post_id": "864", "novelty": true, "cluster_id": 473, "order": 1, "body_text": "Is the Hyuuga main family's juinjutsu a Swastika? In Naruto, the Hyūga clan is divided into two houses: the main house and the branch house.\nThe main house members brand the branch house members with a Juinjutsu (Cursed mark), which has the objective of sealing away the Byakugan upon the death of the one branded. It also has the function of controlling the branch house members through the destruction of the wearer's brain cells, which can be activated by a hand seal only known by the main house members.  \nThe seal looks like this:  \n\nAlthough the Hyūga Main Family's Juinjutsu was altered in the anime for its resemblance with a swastika (and the connotation with the Nazi regime), the manga version maintains its original design.  \nQuoting directly from Wikipedia:  \n\nThe word \"swastika\" comes from the Sanskrit swastika - \"su\" meaning \"good,\" \"asti\" meaning \"to be,\" and \"ka\" as a suffix. The swastika literally means \"to be good\". Or another translation can be made: \"swa\" is \"higher self\", \"asti\" meaning \"being\", and \"ka\" as a suffix, so the translation can be interpreted as \"being with higher self\".  \n\nBoth these translations would fit (at least according to my interpretation) the secondary purpose of the Juinjutsu:\n- To be good: the secondary function of the Juinjutsu is to control the branch house members, which is to 'make them good' (at least to make them submit themselves to the main house members' will).\n- Being with higher self: the Juinjutsu links the branch house members ('lower self') with the main house members ('higher self').\nAre there any canon sources that state:\nIf this resemblance is purely coincidental? Or if the seal is really a swastika?\n"}
