{"post_id": "29585", "novelty": true, "cluster_id": 485, "order": 0, "body_text": "What are the anime/manga references in Gintama In the anime of Gintama, there are several references made directly or indirectly to other works in anime and manga.\nfor example in the first/second episode they make a reference to Ashita no Joe, similarly Itachi's quote from Naruto is used in episode 25. \nI would like to know what are the works that gintama makes references to in order to fully understand the parody they are doing.\n"}
{"post_id": "28451", "novelty": true, "cluster_id": 485, "order": 1, "body_text": "What are the reference of Heaven's Lost Property to the Greek Mythology? In Heaven's Lost property, there are some obvious references to Greek Mythology, such as Zeus' cannon which is obviously linked to the Greek God Zeus.\n\nWhat are the references to Sora No Otoshimono in Greek Mythology? Are there any links between the references and the character designs?\n\nThis question is intended to be self-answered, but other hints and recommendations are welcome.\n"}
{"post_id": "15130", "novelty": true, "cluster_id": 485, "order": 2, "body_text": "About the artworks used in the Elfen Lied opening scenes (contains nudity) The anime Elfen Lied is notorious for its one of a kind OP, featuring the mesmerizing theme song Lilium composed by MOKA and performed by Kumiko Noma, as well as sequences of art porn, a homage to Austrian symbolist painter Gustav Klimt. The idea to pose the characters as in Klimt's artworks came, as far as I know, from director Mamoru Kanbe, who continued this idea in the OP of Sora no Woto. (In my humble opinion, the OP of Sora no Woto is rather bland, and seriously, Klimt with Kalafina?)\nThis is a self-answered question and a modest attempt at unraveling the sources of and the symbolism represented in Elfen Lied's OP scenes. Other answers and/or suggestions are welcome.\n"}
{"post_id": "29186", "novelty": true, "cluster_id": 485, "order": 3, "body_text": "What are the many references Dragon Ball Series makes to other franchises/people? I was watching Dragon Ball and couldn’t help noticing the reference to Bruce Lee and Jackie Chan  in the World Tournament Saga. \n\n                                  \n  \n\nSo my question is, are their more such references in the series or this is as far as it gets?\n"}
