{"post_id": "188", "novelty": true, "cluster_id": 488, "order": 0, "body_text": "Are anime and manga subsidized or actively used by Japanese government to promote Japanese culture/relations internationally? Around 2003-2005, Japan External Trade Organization (JETRO) produces some documents highlighting the importance of manga and anime to promote Japan culture and international/business relations overseas.\nThe now unavailable online issue of Jetro Business Topics, \"Japan's Soft Power Moves into the Limelight\" (2 Sept 2004) by Tsutomu Sugiura, Marubeni Research Institute director at time, stated:\n\nIf, for instance, children overseas learn to love anime, they may continue to feel a fondness for things Japanese as they grow older. And it is possible that such friendly feelings will translate into business deals involving Japan after they become adults.\n\ndirectly citing the Soft Power concept by Joseph Nye. Similar concepts are expressed here by the same Tsutomu Sugiura, identifying the phenomena as \"third wave of Japonism\", where animation and videogames are:\n\ncapturing the essence of Japanese character and lifestyle disseminates Japanese culture and Japanese soul to young people the world over\n\nA document produced by JETRO Economic Research Department on March 2005 titled \"Cool Japan's Economy Warms Up\" associate it with the \"Gross National Cool\" cultural index theorized by Douglas McGray, and soft power concept is cited again.\nAfter 7 years, are these concept actually implemented by the Japanese administration? Are there documents related to direct intervention by the Japanese government to spread or boost the anime and manga industry overseas aiming to these goals in international relations?\n"}
{"post_id": "29307", "novelty": true, "cluster_id": 488, "order": 1, "body_text": "Are any animation studios open to the public for tours? There are lots of anime fans all over the world, and Japan does promote the industry to boost tourism. \nHowever, I am unaware of any animation studios that allow visitors. I'm sure a lot of visitors would like to peek inside and see what it is like - perhaps not the working areas, but the general surrounds & going-ons. \nI have noticed one tour group doing such a trip - but for the traveller who goes without a guide group - are there any options?\n"}
