{"post_id": "29326", "novelty": true, "cluster_id": 489, "order": 0, "body_text": "Who is to say if someone is 'murdered'? Who is to say if someone is 'murdered' (This is the main question. The sentences marked with '?' are just to help provide motivation and context for the question) ?\nExample cases:\n\nDoes suicide count as murder?\nWhat if A accidentally or unintentionally (there might be a difference. I talked to a law expert once. not sure though) kills B, whether or not there are witnesses?\nWhat if C kills D in self-defense?\nWhat if some student E trips over and dies, without the death being intended by any of the other students, while there are no witnesses? How do the students know Monokuma would really state that E's death was an accident instead of calling a classroom trial to trick everyone?\nWho decides if a killing is done in self-defense? Who decides if a killing in an accident? The students? Monokuma?\nIf one of the students has dissociative identity disorder like in Identity (2003), and one of the identities murders another student, what happens to the body containing the multiple personalities?\n\nRe the self-defense (hardly spoilerous but just in case):\n\n There was this one murder claimed by the murderer to be self-defense, but it wasn't.\n\nOr it could be. I think that's kind of why we have juries, law experts, etc.\nOh and I guess 'not guilty by reason of insanity' is not a defense in Danganronpa.\nPS I'm done with the anime. Go ahead and spoil other media. But please use spoiler tags for others.\n"}
{"post_id": "29330", "novelty": true, "cluster_id": 489, "order": 1, "body_text": "In Danganronpa, what happens in the event of drawn vote? Unlike the games in Liar Game, the rules of a Danganronpa game are sometimes made up or stated midway, which for me kind of sucks but is tolerable so long as the rules are consistent.\nIn Liar Game, afaik, the dealers have always accounted for all possible situations so whenever there are changes in the game, they state it outright. For example, in games involving voting, the dealers have stated what happens in the event of a draw.\n\nSuppose in a Danganronpa game starting with 15 students,\n\nall murders are committed by exactly one person (no collaborative murders during the act, but before or after the act is fine, assuming there would be some incentive) and to exactly one person (no multiple victims)\nall murderers are successfully guessed and convicted (iirc, this is by majority vote) so long as there are more than 3 players\nNo one dies in a way other than being murdered. So, no one messes with Monokuma, dies of an accident, dies of health conditions (eg asthma) or naturally (eg old age), etc, but suicide is fine.\nNo murders will be hidden from the other students indefinitely, as in all corpses will be discovered or if the body is burned, then there will be enough evidence to say a murder has taken place and thus enough evidence for a classroom trial to be called.\n\nAssuming the above situation is consistent internally and consistent with the initial set up of a Danganronpa game, such game will eventually come down to 3 students, whom I'm going to call Kotonoha, Yuno and Mion.\nSuppose further:\n\nThe game continues (so it's not declared a draw between the 3).\nYuno dies.\nIf there is a corpse (body is not burned or anything), it will be discovered. If none, Yuno's death is discovered in another way.\nDespite insufficient witnesses, a classroom trial will be called.\nYuno did not commit suicide or die of an accident.\nThe murderer is Kotonoha or Mion.\n\nQuestions:\n\nSo what happens in the event of a drawn vote between the two?\nGenerally, whenever there are an even number of voters in a classroom trial, what happens in the event of a drawn vote? Since it's not a majority, everyone but the culprit dies?\n\nI would like to know what are the stated rules regarding this, if any, and from any media.\n\nIf I made any logical errors either internally (inconsistent with itself) or externally (inconsistent with Danganronpa), please point them out.\nPS I'm done with the anime. Go ahead and spoil other media. But please use spoiler tags for others.\nPPS Re 'Kotonoha, Yuno and Mion'\n\n Don't spoil please.\n\n"}
