{"post_id": "20924", "novelty": true, "cluster_id": 492, "order": 0, "body_text": "What is this anime with a weird style and short title about a little girl who is possibly not a human? I remembered this one frame from this one anime and I had no clue what it was, so I was thinking \"okay, I better ask the internet.\"\nThe one frame (or manga cover, anime DVD cover, illustration) I remembered had a little girl on a fence, sideways. The show was about that little girl, who might not have been human, and what she did. I think the anime was set in a somewhat strange world, post-apocalyptic perhaps? I think the girl knew a younger boy, and she might have lived alone in a bad home. The scenery around the girl might have looked very earthy or had many buildings toppled.\nI'm pretty sure the anime had a very strange art style: the style was pretty, but it kinda looked like the eyes were farther apart; the style was serious, but it kinda was a little chibi-ish? I think the style was somewhat similar to Code Lyoko? The anime was full of yellows and browns for colors. It might have been a darker anime, but it did seem pretty cute.\nI think the anime was made in the time frame of 2000–2009, but probably near the middle of that. I think it had a very short title, maybe like 4–6 letters, and it might have had weird letter combinations like \"ae\" and a colon (so the title might be formatted like xxx: yyyyy). I think the anime had an English dub. It reminded me of Paranoia Agent in the way that not many people knew about it, but those who did really thought it was innovative, great and unique! I also feel the anime was a little psychological?\nI just really hope you can help me, even though I don't know much about this! It's no problem if you can't. Thanks so much!\n"}
{"post_id": "20191", "novelty": true, "cluster_id": 492, "order": 1, "body_text": "Mecha shounen children-friendly anime about kids' minds stuck in a data world The kids have to fight robots to get out of the data world.\n\nThe anime is old, and was pretty cheap-looking. Something like Digimon/Yugioh with robots. \nThe protagonist has red colour-theme; other characters have different colours including brown, purple, green and blue (and maybe more). MC is typical hot-headed naive-but-brave spiky hair shounen hero. \nThe robots can talk, and might be sentient beings. Something about heros from the past/alternate world.\nThe data world is a spaceship-like, galaxy-spanning battle kind of environment.\nMost kids but the protagonist turned evil earlier in the series, and it becomes \"fight-friend-of-the-week\" show.\nI believe it ran for 25-ish episodes or less. \nThe outside world has little to no contact with the inside world. Relatives of the children (father, sister, grandpa etc) work in military-like organization to bring them back.\nOnce enter the data world, their body in the real world become dormant and unresponsive.\nSet in distant future Japan, probably. \nThe children wear skinny jumpsuit like in NGEvangelion, with three vertical stripe of white-character colour-white.\n\nI saw this anime in the late '90s to early 2000s. It was Thai dubbed.\nDoes anyone know the name of this anime?\n"}
