{"post_id": "29732", "novelty": true, "cluster_id": 501, "order": 0, "body_text": "Is there a single member of the Einzbern family who is a human being? From the information I could find, nearly all known members of the Einzbern family are (female) homunculi (Justeaze, Irisviel, Illyasviel and all the maids), the only exception being Jubstacheit, who is supposed to be an A.I. controlling an array of humanoid golem bodies. Is there any information on Einzberns who are actually human beings? Are there any alive at all at the time of the events of Fate/Zero and Fate/Stay Night? If there is not, can the Einzberns actually be considered a \"bloodline\" in the strict sense of the word, or are they more like an army of self-cloning homunculi?\n"}
{"post_id": "29750", "novelty": true, "cluster_id": 501, "order": 1, "body_text": "Where was it revealed that Jubstacheit is an A.I? So I read this question, where it says:\n\nthe only exception being Jubstacheit, who is supposed to be an A.I. controlling an array of humanoid golem bodies.\n\nI've never read this before, so I looked it up on Jubstacheit's Wikia page, where it says:\n\nJubastacheit is an artificial intelligence made to control the Einzbern Castle, Golem Jubstacheit (ゴーレム・ユーブスタクハイト, Gōremu Yūbusutakuhaito?). It manufactures humanoid golem terminals, and Acht is the eighth generation.\n\nHowever, this was not the case as on June 11, 2015, the same paragraph said:\n\nDeclared the eighth head of the Einzbern family, Jubstacheit was not around during Justeaze Lizrich von Einzbern's era, but kept himself alive for nearly two centuries by continuously prolonging his life. \n\nThis part started to change on January 13, 2016, and this new information had not been cited, as the only reference on the page is the Fate/Zero Season 1 Boxset - Drama CD 1, which has been there for quite some time.\nSo I am wondering, what Nasuverse title/material book says that Jubstacheit is an A.I?\n"}
