{"post_id": "1971", "novelty": true, "cluster_id": 57, "order": 0, "body_text": "What defines one \"season\" of anime? From what I've been able to follow, the seasons of anime shows have been tied to thirteen week blocks, directly correlating with the actual season in Japan (for instance, this is the Winter 2013 season).\nHowever, there are instances in which shows with more than 13 episodes are considered to have only run for one season.\nWhich is the correct definition - are seasons 23-26 episodes, or are they 11-13 episodes?\n"}
{"post_id": "5599", "novelty": true, "cluster_id": 57, "order": 1, "body_text": "How long does producing a cour take? I've read through some questions about financing anime and so on, but don't know how long it takes to produce a complete cour of anime. I'm talking writing about 12 to 13 episodes, of a standard-length anime (roughly 20 minutes, nothing like Aiura).\nIs there an average time needed to produce a series? Are we talking about months?\n"}
{"post_id": "4785", "novelty": true, "cluster_id": 57, "order": 2, "body_text": "What DBZ fight lasted a whole season? I've heard that Dragonball Z once stretched a fight (sometimes they say one punch) over most of a season. Which season was it? What are the episode titles? How did they do it, were there flashbacks or cut-aways, or constant fighting?\n"}
{"post_id": "7971", "novelty": true, "cluster_id": 57, "order": 3, "body_text": "Why does season 2 of Gurren Lagann start so differently compared to season 1? Episode 1 of  the second part of season 1 of Gurren Lagann features more political themes than those seen in season one. However from episode two onwards it returns to being more about action.\nIs this to do with how they were aired? Was this change enforced, so as to move away from the Mecha stereotype, by a 'higher up' in Gainax...and simply ignored from episode 18 onwards? In western TV, ratings that are seen by executives can influence the show...has something similar happened here?\nWhy is this?\n"}
{"post_id": "7977", "novelty": true, "cluster_id": 57, "order": 4, "body_text": "What is a \"cour\"? I often hear shows talked about as being some number of \"cours\". For example, Evangelion is apparently \"two cours\", while Madoka is \"one cour\". \nBut what on earth does \"cour\" mean? I can't find it in any dictionary!\n"}
{"post_id": "17186", "novelty": true, "cluster_id": 57, "order": 5, "body_text": "What was the first anime that used a split-cour format? Split-cour airing format is a noticeable trend in the anime industry recently. Unlike most multi-season shows that are aired two or more seasons in succession, split-cour shows have a break in between that usually lasts 3 months (1-cour). However, these cours are produced  as a single product over the course of several months, not two separate anime, per se. For more information on cours and split-cours, this question might help.\nRecent examples of anime that followed this format are:\n\nSpace Dandy - Winter 2014 [break: Spring] Summer 2014\nHitsugi no Chaika - Spring 2014 [break: Summer] Fall 2014\nAldnoah.Zero - Summer 2014 [break: Fall] Winter 2015\nTokyo Ghoul - Summer 2014 [break: Fall] Winter 2015\n\nSome upcoming anime that are announced to be split-cour are Durararax2, F/SN UBW, and the Grisaia VN franchise, though I'm not really sure. Anyway, as the title states: I want to know what was the first anime that used this format of having a 3-month break in between cour/s.\n"}
