{"post_id": "2358", "novelty": true, "cluster_id": 78, "order": 0, "body_text": "How is the passage of time handled in Pokemon? I stopped following the Pokemon anime a while ago, but I know the series has had Ash go through many regions, including retreading at least one of them.  When Ash was about to get his eight badge, Misty mentioned that they'd been on the road for a year at that point.\nI saw some recent episodes, and Ash looks nearly identical to when he first started as a trainer.  Normally I'd attribute that to cartoon sitcom logic, where the characters never age; but in a series with continuity and references to earlier seasons, this makes no sense.\nWhat's the official word on a timeline for the Pokemon anime?\n"}
{"post_id": "5884", "novelty": false, "cluster_id": 78, "order": 1, "body_text": "Why Ash does not grow up? In all the series only the dress is changed.\nAsh doesn't grow up or does his maturity changes.\nWhat is the reason?\n"}
{"post_id": "6854", "novelty": true, "cluster_id": 78, "order": 2, "body_text": "Why do some anime characters never grow old? Ash Ketchum from Pokemon\n\nBy never growing old, I mean the anime has been airing for a long time, but the character never grows old. I think the most popular example for this kind of character is Ash Ketchum from Pokemon and Nobita and his friends from Doraemon. (Yes, I do realize that both anime are for kids - I don't remember any other example that the character never grows up for a long time). However, most characters from long-running anime that I know of always grow up, like those from Dragonball, One Piece, Naruto, Fairy Tail, and Shin-chan. (The last one I mentioned has similar traits to Pokemon and Doraemon, although I'm not sure Shin-chan is for kids). Any reason behind this?\n"}
{"post_id": "2358", "novelty": true, "cluster_id": 78, "order": 3, "body_text": "How is the passage of time handled in Pokemon? I stopped following the Pokemon anime a while ago, but I know the series has had Ash go through many regions, including retreading at least one of them.  When Ash was about to get his eight badge, Misty mentioned that they'd been on the road for a year at that point.\nI saw some recent episodes, and Ash looks nearly identical to when he first started as a trainer.  Normally I'd attribute that to cartoon sitcom logic, where the characters never age; but in a series with continuity and references to earlier seasons, this makes no sense.\nWhat's the official word on a timeline for the Pokemon anime?\n"}
{"post_id": "7293", "novelty": true, "cluster_id": 78, "order": 4, "body_text": "Do Pokemon age and die? There are old people in Pokemon but I have never seen any old Pokemon. Do Pokemon age and die? Also, if they get hurt too much, will they die of wounds? Have there been any deaths so far?\n"}
