{"post_id": "4568", "novelty": true, "cluster_id": 82, "order": 0, "body_text": "Why do characters often pull down one eyelid and stick out their tongue? I see characters making this motion frequently in anime.  They pull one (or sometimes both) eyelid down, and stick out their tongue.  What does that mean?  Where does the gesture originate and what's the history behind it?\n\n\n\n\n"}
{"post_id": "4568", "novelty": true, "cluster_id": 82, "order": 1, "body_text": "Why do characters often pull down one eyelid and stick out their tongue? I see characters making this motion frequently in anime.  They pull one (or sometimes both) eyelid down, and stick out their tongue.  What does that mean?  Where does the gesture originate and what's the history behind it?\n\n\n\n\n"}
{"post_id": "28353", "novelty": true, "cluster_id": 82, "order": 2, "body_text": "What does this grinning gesture signify? The gif below shows Noriko from minute 11 of GunBuster's episode 3.\n\nThis is the dialogue directly preceding it:\n\nNoriko: I should at least memorize basic space manoeuvring patterns. [...]\nSmith: All that stuff is useless in real combat.\nNoriko: Why do you have to keep patronizing me?\nSmith: 'cause your such a cute little freshman.\nNoriko: I'll have you know that Onee-sama and I are the best\n  team in the entire Top Squadron! A \"solo\" like you with no partner\n  couldn't possibly appreciate everything we've been through together as\n  a team. So long!\n\nIn terms of usage it seems somewhat interchangeable with the Eyelid pull taunt. I assumed it is meant to show defiance, kind of like baring one's teeth but in a more cheeky way?\nThe sound she makes is \"bi-\" I would say, but her action doesn't really fit any of the common uses of that onomatopoeia which I'm aware of. \nI feel I've seen this before but I couldn't find it among any of the teeth and smile realated tropes on tvtropes.\nSo, TL;DR, does this have a name, is it repeated throughout anime and signifies something particular or is it just Noriko being random and I'm overthinking it?\n"}
