{"post_id": "20028", "novelty": true, "cluster_id": 88, "order": 0, "body_text": "What happens if too much is given during a transmutation? In Brotherhood, during a transmutation, what happens if too much is given as a part of the equivalent exchange? In the series, the brothers lose something each for trying to give too little during the human transmutation attempt to bring back their mom... So what would happen if they give too much? Anything at all?\n"}
{"post_id": "5180", "novelty": true, "cluster_id": 88, "order": 1, "body_text": "How did Homunculus come into being? In FMA, the being that became Father, the one known originally as Homunculus or the Dwarf in the Flask, seemed to have been created by Van Hohenheim's master using some of Van Hohenheim's blood. Is the creation ever explained in any greater detail?\n"}
{"post_id": "6368", "novelty": true, "cluster_id": 88, "order": 2, "body_text": "How did the characters learn alchemy? How did the characters gain their power to perform alchemy in FMA:Brotherhood? Is it genetic, or is it something that can be learned? After all, not everyone in the series can use alchemy.\n"}
{"post_id": "3324", "novelty": true, "cluster_id": 88, "order": 3, "body_text": "Why did Colonel Mustang lose his sense of sight and not his arm or body? In Fullmetal Alchemist, when an alchemist performs human transmutation, they lose a part of their body. What determines the body part an alchemist loses?\n"}
{"post_id": "8699", "novelty": true, "cluster_id": 88, "order": 4, "body_text": "If the \"Truth\" didn't exist, would that mean that feats such as Human Transmutation would work? In FMA Brotherhood, It is said that Truth watches over all alchemic exchanges in the world. \nThe entity at the Gate calling itself Truth:\n\nMy question is if Truth didn't exist would impossible feats such as Human Transmutation be possible? Would such a thing be possible?\n"}
{"post_id": "8679", "novelty": true, "cluster_id": 88, "order": 5, "body_text": "When Edward and Alphonse try to transmute their mother, how come they didn't gain anything? So, to my understanding, the idea of alchemy is equivalent exchange, in which you get in return as much as you gave.\nThis doesn't make sense to me, as in the beginning when they tried to transmute their mother back, Alphonse lost everything, and Edward lost his leg. They didn't get anything in return, or at least anything worth of a soul and a body. After this Edward transmuted his arm to get Alphonse back.\nSo, put in a calculation:\nThings lost\n\nRandom piled ingredients which were supposed to compose the average human\nAlphonse's body\nAlphonse's soul\nEdward's arm\nEdward's leg\n\nThings gained\n\nA blob of purple stuff with Alphonse's soul affixed to it ( for a while )\nAlphonse's soul\n\nSo, where the hell did the rest of the stuff go? And more importantly, why could they not just have transmuted everything back?\n"}
{"post_id": "196", "novelty": true, "cluster_id": 88, "order": 6, "body_text": "In Fullmetal Alchemist, what does a State Alchemist's pocket watch do? In Fullmetal Alchemist, it is stated a number of times that a state alchemist's pocket watch increases their power, but there doesn't seem to be a clear mechanism for that. How does that work, and what does increasing the power of an alchemist mean?\n"}
{"post_id": "7258", "novelty": true, "cluster_id": 88, "order": 7, "body_text": "Can someone learn more than one alchemy? In Fullmetal Alchemist: Brotherhood, the characters gain skill in alchemy through learning. So I'm wondering, is it possible to learn more than one alchemy? Because it seems like everyone is a specialized in particular alchemy. Also, if this possible, can they perform more than one alchemy at the same time?\n"}
