{"corpus": "SKNews", "post_id": "1981", "novelty": false, "cluster_id": 198, "order": 1, "body_text": "KT apologizes after 8.7M subscribers' data hacked Published: July 29, 2012 9:23 a.m. ET SEOUL--South Korea's KT Corp. (KT, 030200.SE) apologized Sunday after acknowledging that the personal data for 8.7 million of the company's subscribers had been hacked and said it will devote efforts to prevent any recurrences. Earlier in the day, media reports said the police have arrested hackers who are suspected of having stolen personal data of the customers of the nation's second-largest mobile operator. KT had requested a police investigation on July 13 after detecting signs of possible hacking through internal monitoring, the company said in a statement. The company has has since retrieved all the personal data that had been allegedly collected by the hackers, it added."}
{"corpus": "SKNews", "post_id": "1980", "novelty": true, "cluster_id": 198, "order": 0, "body_text": "South Korean crackers arrested Yet another data leak at KT 29 Jul 2012 at 23:30, Richard Chirgwin South Korean police say they have arrested two malicious hackers that obtained personal details of 8.7 million KT mobile customers and on-selling the data to telemarketing firms. The police accuse the pair of earning one billion won, which sounds a lot more than the roughly $US800,000 it converts to, in the scam. The data theft took place between February this year and early this month, when KT detected signs of intrusion on their networks. Seven individuals have been charged over buying the data, according to AFP. In the kind of apology you never get from Western companies suffering data breaches (or, for that matter, repeatedly and egregiously breaching their customers’ privacy – we know who we’re talking about), KT issued a statement to customers saying that “We deeply bow our head in apology” for the leaks. This may, however, reflect KT’s humiliation at being still vulnerable to data leaks, following last year’s attack in which KT’s Cyworld social network site and Nate Web portal were infiltrated and personal data of 35 million customers copied. That attack was blamed on Chinese intruders. Other major attacks on South Korean sites included a breach at game developer Nexon (13 million customers exposed), and retailer Shinsegae along with 24 other companies (20 million customers exposed)."}
{"corpus": "SKNews", "post_id": "1982", "novelty": true, "cluster_id": 198, "order": 2, "body_text": "Two arrested for hacking personal data of 8.7 million phone users KT Corp., South Korea's second largest wireless service provider, has apologized after personal data of 8.7 millions of its mobile phone subscribers was stolen by hackers. The details are suspected to have been sold to marketing firms, netting the hackers close to $1 million. By Emil Protalinski for Zero Day | July 29, 2012 -- 19:54 GMT (12:54 PDT) | Topic: Security South Korean police have arrested two men who allegedly stole the personal information of about 8.7 million cellphone customers from KT Corp., the second biggest mobile carrier in South Korea. The company alerted police on July 13 after detecting traces of hacking attacks. The data was collected for the last five months, starting in February 2012. \"It took nearly seven months to develop the hacking program and (the suspects) had very sophisticated hacking skills,\" a KT Corp. spokesperson told Yonhap News. \"In light of this incident, we will strengthen the internal security system and raise awareness of security among all employees to prevent causing inconvenience to customers.\" The duo developed a hacking program that stole the customers' names, phone numbers, residential registration numbers, and phone contract details of more than half of KT Corp.'s customers. Seven other people who allegedly bought and distributed the hacking program and the stolen personal data were also booked without physical detention. The attack, described as one of the country's largest hacking schemes, is estimated to be valued at six figures: police said the two made about 1 billion won ($878,000) by selling the information to telemarketing companies. Those firms in turn used the details to contact customers (especially those whose contracts were close to expiration or considered likely to change phone plans), soliciting them to switch to other mobile operators. \"We deeply bow our head in apology for having your precious personal information leaked... we'll try our best to make such things never happen again,\" KT said in a statement to customers. That apology may not be enough; KT could easily end up facing a class action lawsuit filed by angry subscribers."}
{"corpus": "SKNews", "post_id": "1983", "novelty": false, "cluster_id": 198, "order": 3, "body_text": "Hackers steal, sell data on 8.7 million Korea Telecom subscribers By Amar Toor on July 29, 2012 11:19 pm Authorities in South Korea have arrested two computer programmers suspected of hacking into Korea Telecom's customer database and stealing personal information on approximately 8.7 million mobile subscribers. According to the provider, these data included user names, telephone numbers, and resident registration numbers. Police are also investigating seven other suspects accused of selling this information to telemarketers, as part of an operation that began in February. As the Korea Times reports, authorities believe the hackers made at least $877,000 from selling this information to marketers, who purportedly used it to contact customers whose contracts were about to expire, as well as those deemed likely to switch providers. The identities of the two men arrested have not been released, though the Times reports that one is a 40-year-old male whose family name is Choi. Korea Telecom, South Korea's second-largest provider, publicly acknowledged the breach Sunday, issuing an apology to its 16 million subscribers. \"We deeply apologize for worrying you,\" the company said, adding that it will adopt stronger measures to safeguard its system. \"In light of this incident, we will strengthen the internal security system and raise awareness of security among all employees to prevent causing inconvenience to customers,\""}
{"corpus": "SKNews", "post_id": "1984", "novelty": false, "cluster_id": 198, "order": 4, "body_text": "Data of 8.7 Million KT Subscribers Hacked in South Korea 30 July 2012, 3:23 am EDT KT Corp., South Korea's No. 2 wireless service provider, apologized on Sunday after personal data of millions of mobile phone subscribers was hacked. It is the latest in a string of large-scale personal information hacking cases in one of the world's most wired countries. Police said two computer programmers had been arrested for hacking personal data of about 8.7 million KT subscribers. KT claims a mobile service subscription membership of 16 million. Police were also investigating seven others suspected of having purchased and used the hacked KT data, which included names, resident registration numbers and phone numbers. \"We deeply apologize for worrying you,\" KT said in a statement. The company said it had blocked any further illegal access to data. The hacking began in February. In November, more than 13 million subscribers of Nexon Korea Corp, a leading game developer, fell victim to a hacking attack. Months before the Nexon Korea case, information of up to 35 million users of an internet portal and blogging site operated by SK Comms, the country's top mobile service provider, was attacked by hackers from China."}
{"corpus": "SKNews", "post_id": "1985", "novelty": false, "cluster_id": 198, "order": 5, "body_text": "South Korea arrests phone firm KT Corp hacking suspects 30 July 2012 From the section Technology South Korea is one of the world's most wired nations Two men suspected of accessing details illegally of 8.7 million users of South Korea's largest fixed-line phone operator, KT Corp, have been arrested. The company says hackers stole subscribers' names, phone and personal identification numbers, and then sold the data to telemarketers. The hackers made an estimated 1bn won (£560,518; $877,000) from the sale. An illegally installed computer program had collected subscribers' information over several months, KT Corp said. \"It took nearly seven months to develop the hacking program and [the suspects] had very sophisticated hacking skills,\" the company told the Yonhap News agency. KT is also second biggest mobile operator in South Korea. The company apologised to its subscribers, promising to \"strengthen the internal security system and raise awareness of security among all employees to prevent causing inconvenience to customers,\" Yonhap News quoted KT as saying. Attacks common In July 2011, South Korea said it had traced the theft of data from 35 million accounts from the Cyworld website and the Nate web portal, both run by SK Communications, to computer IP addresses based in China. In April 2011, hackers targeted a government-backed bank in South Korea. And in May the same year, data on more than 1.8 million customers was stolen from South Korean consumer finance company Hyundai Capital. In November 2011, one of South Korea's main games developers, Nexon, was hacked, with personal details of 13 million users of its MapleStory online game stolen. Government ministries, the National Assembly, the country's military headquarters and networks of US forces based in South Korea were also hit by hackers in 2011."}