{"post_id": "4754", "novelty": true, "cluster_id": 117, "order": 0, "body_text": "Where does the term \"waifu\" come from? I was stalking a forum looking for images to nab to use as wallpapers, and there was a post where posters were claiming characters as their \"waifu\".\nSeeing how it is spelled, I would assume that what they mean is \"wife\"; however, it seems weird to use the term \"waifu\" rather than the normal Japanese term for wife (my understanding is that it's \"Tsuma\" (妻); however, I could be wrong).\nSo, where did the term \"waifu\" come from? If I am wrong, and \"waifu\" isn't what I think it is, could someone explain what it is and where it came from?\n"}
{"post_id": "7861", "novelty": true, "cluster_id": 117, "order": 1, "body_text": "Is there such a thing as Waifu-Wednesday? I found an interesting phrase here on Facebook page, \n\nWhat is Waifu-Wednesday? Is there such a thing as Waifu-Wednesday?\n"}
{"post_id": "24038", "novelty": true, "cluster_id": 117, "order": 2, "body_text": "On the origins of the term \"forced drama\" as it is used in discourse about anime User /u/JekoJeko5 has recently posted on /r/anime his observation that the term \"forced drama\" is almost exclusively used in discussions of anime. It is difficult to give a concrete description of what \"forced drama\" is, but many users in the linked thread have offered their opinions on the matter. The one that seems most \"correct\" (or at least, most pithy) to me is this one by /u/OverKillv7:\n\nForced drama is every idolmaster-like show that has the stupid sprain-the-ankle-before-the-big-show thing... every time for no reason other than they need something to happen.\n\nIn retrospect (now that the topic has been brought up), I do notice that the term really isn't used in non-anime circles. I find it interesting that the English-speaking anime community has developed this term, presumably to describe a particular kind of frustrating storytelling that is common in anime. \nWhat I would like to know is this: how did the term originate and gain cachet in discussions of anime? (Basically, I'm looking for something analogous to my earlier answers about \"waifu\" and \"best girl\".)\nAs with many internet neologisms, I suspect this one originated on 4chan, though I'm not sure whether we can pin this on /a/ specifically. Snowclones of the term are reasonably popular on 4chan; for example, \"forced fun\" on /v/ and \"forced animation\" on /a/ (both of these examples are mostly used parodically). The /a/ archiver returns results going all the way back to February 2008, when archival began, which gives us an upper bound on how late the term could have been coined. I'm not sure how to proceed for getting to the root of \"forced drama\", though - and that's where you come in, dear answerers. \n"}
{"post_id": "19716", "novelty": true, "cluster_id": 117, "order": 3, "body_text": "What exactly does \"best girl\" mean and where did the expression originate from? I've seen the expression \"best girl\" being used several times, and I find it quite self-explanatory. However, some people seem to define it in slightly different ways. Here are some different definitions from one or two reddit threads:  \n\nIt's when I get a boner in my heart.\n\nBest Girl = Mai Waifu\n\nI'm not sure if everyone thinks about it like I do, but with 'best girl' I just mean it's my favourite girl from a show.\n\nAs far as I can tell, it just means you post a hundred pictures of a pretty anime girl you're in love with. And its creepy without context. Unless its being done ironically, then its only a little creepy.\n\nI was wondering if there's some sort of \"official\" definition for the expression \"best girl\".\nBeside that, where did the expression (or meme, I'm not sure it is considered a meme) originate from?\nIs this an expression that is used in Japan too, or is it a Western thing?\n"}
