{"post_id": "4245", "novelty": true, "cluster_id": 161, "order": 0, "body_text": "Weren't the 1st and 2nd Hokage sealed forever? In recent chapters, all the Hokages that have passed away have been summoned by Orochimaru with Edo Tensei. \nDidn't the Third Hokage, during his fight with Orochimaru, in which Orochimaru used Edo Tensei to summon the 1st and 2nd, seal both Kage away in some way, so that they could never be summoned again?\n"}
{"post_id": "11234", "novelty": true, "cluster_id": 161, "order": 1, "body_text": "Can a person killed by Death Soul Reaper be brought back to life through Reanimation? While fighting Orochimaru, Sandaime Hokage Hiruzen stated that a person killed by Death Soul Reaper Jutsu will have his soul imprisoned in the Soul Reaper's body for eternity and will be restless there. How can they be reanimated then? And in the event that they are reanimated, what will happen when they are released from reanimation? Will they go back to the Soul Reaper or will they rest in peace?\n"}
{"post_id": "11250", "novelty": true, "cluster_id": 161, "order": 2, "body_text": "Reanimation of Yondaime during Chunin exams I read everywhere that Orochimaru tried to reanimate the 4th Hokage during the Chunin exams, but he was unable to reanimate him because he was sealed inside Soul Reaper's belly. But if he can't reanimate him, what was the point of the coffin? To perform reanimation, he needs a host first. He must have reanimated him earlier on a host if it was possible. So what was the point of summoning that coffin?\nAccording to the Naruto wikia's page on Summoning: Impure World Reincarnation (specific revision),\n\nTo perform this technique, the user must first acquire some of the DNA of the person they intend to reincarnate. Kabuto remarks that this basically amounts to grave-robbing, although blood stains or organs salvaged after the target's death also work. The soul of the intended reincarnated must also reside in the pure world (浄土, jōdo); for example, those whose souls have been consumed by the Death God cannot be reincarnated. However, if it is a case where the souls are freed from inside the Shinigami, then a user of this technique is free to reincarnate them once again.\nNext, a living sacrifice is required for the soul of the reincarnated to use as a vessel.\n\n"}
{"post_id": "3281", "novelty": true, "cluster_id": 161, "order": 3, "body_text": "Who's inside the third coffin that Orochimaru tried to summon? In the battle between Sarutobi Hiruzen and Orochimaru during the Chunin Exams, (on the rooftop where the Sound Four sealed them in a barrier) Orochimaru summoned the two previous Kages. He also tried summoning another coffin but Hiruzen successfully stopped it. \nWho was inside that third coffin? It can't be the Fourth Hokage right? Because that time, he was still under the Shiki Fuujin Seal.\n"}
