{"post_id": "11316", "novelty": true, "cluster_id": 162, "order": 0, "body_text": "Why is there consistent seasonal variability in the quality of anime? Recall that the anime industry produces TV anime according to a 4-season schedule: winter (Jan-Mar), spring (Apr-Jun), summer (Jul-Sep), and fall (Oct-Dec). \nSince at least 2010 (and perhaps even before than that), there have been consistent differences in the average quality1 of anime released in each season.2 The details are open to argument, but most commentators will agree that spring is consistently the best season of anime in any given year, while winter is the worst.3 My personal impression is that on average, spring > fall > summer > winter. \nIt is not surprising that seasonal trends would exist - in Hollywood, for example, all the big \"blockbusters\" come out in the summer, and it seems that January and February are off-months for the industry (or so this article claims). \nThe real question, though, is why? What is it about winter that makes it the dumping ground for lousy anime? What is it about spring that gets the anime industry to put out good content? \n\n1 When I talk about \"quality\" here, I'm basically talking about Rotten Tomatoes ratings - an aggregate of opinions from critical reviewers and ordinary consumers. Quality may not be objectively measurable, but quality-as-perceived-by-the-consumer certainly is. Technical merits of the production (e.g. sakuga, sound direction, etc.) are important in this context only insofar as they factor into the \"Rotten Tomatoes ratings\" here.\n2 For ease, let's restrict ourselves to thinking about anime that run for one year or less (so no Naruto, Bleach, Yugimanz, etc.), and treat anime as belonging exclusively to the season in which they began airing (so e.g. all of Shingeki no Kyojin counts as a spring anime). \n3 I can substantiate this claim if need be, both by reference to user ratings on sites like MAL and by reference to more subjective impressions by commentators who know a thing or two about anime. That said, I'm sure those of you who have a finger on the pulse of the anime-osphere probably have more or less the same impression. \n"}
{"post_id": "4327", "novelty": true, "cluster_id": 162, "order": 1, "body_text": "How are anime seasons released? Are there set periods of time in which seasons start and end? In America, generally, TV shows begin in the Fall or the Summer. Many shows will start within a week or two of each other. Is the same true for anime? If not, what controls when anime seasons start/are released?\n"}
