{"post_id": "18481", "novelty": true, "cluster_id": 166, "order": 0, "body_text": "How can a death note shorten the lifespan of others? The use of the Death Note in the human world sometimes affects other humans' lives or shortens their original life span, even though their names are not actually written in the Death Note itself. In these cases, no matter the cause, the god of death sees only the original lifespan and not the shortened lifespan.\nWe saw, that Misas lifespan was shortened because Light was killed by Ryuk. So this means, that you can shorten a persons lifespan with the death note. So let's say, A has a death note and knows that C wants to kill B with a death note. He writes B's name in his death note, thus preventing him from being killed by a death note. So C, can't kill B with a death note anymore. But since the death note can shorten the lifespan of those, whos name isn't written in the death note, C decides to use Y, to set up a trap. C writes:\nY, Car accident. Dies at 12:30, after he produces a deadly poison, which he injects into the food the person he knows as ''B'' eats. After he did this, he will die 9 days later in a car accident.\nSo, could C shorten B's lifespan in this way, so that he is able to indirectly kill him? \n"}
{"post_id": "23596", "novelty": false, "cluster_id": 166, "order": 1, "body_text": "Is the death note 23 days rule inconsistent? We all know about the 23 day rule. Well. I've been rewatching the series, and I've found something strange in episode 8...\nAt 4:10 (youtube) Light asks Ryuk if you can use any date, as long it's before the victims lifespan, to which Ryuk replies; yes\n"}
{"post_id": "17280", "novelty": false, "cluster_id": 166, "order": 2, "body_text": "How long can you manipulate a person with a Death Note? \nIf you write die of disease with a specific disease's name and the person's time of death, there must be a sufficient amount of time for the disease to progress. If the set time is too tight, the victim will die of a heart attack after 6 minutes and 40 seconds after completing the Death Note.\n\nLet's say Y has a Death Note. He also has Shinigami Eyes, and because he's a genius he can read in Shinigami time. So he wants to kill Z.\nHe writes:\n\nZ, bradykardie, dies of bradykardie at 11:59 on this date: 25.07.2062. Till he dies, he will always do whatever the person he knows as A tells him to do. \n\n(Yes, Z is destined to die at the mentioned date.)\n(A won't die, since he already wrote his own name in his Death Note.)\nWould this work?\n"}
{"post_id": "17169", "novelty": false, "cluster_id": 166, "order": 3, "body_text": "Can a person who influences others lives be killed by a Death Note? There's a rule, that a death note entry can't lead to another's dead. So here is a bad example:\nA has a bomb, which will explode, if his heart stops, (this bomb is extremely accurate, so if his heart even stops for one second, the bomb will explode.) \nB has a death note, and wants to kill A. \nA, has a hostage, who is close to him, and if the bomb will explode, the hostage will also die. \nB writes A's name in its death note. Will A die, or will he survive, because if he dies, the hostage will also die? \n"}
{"post_id": "20221", "novelty": false, "cluster_id": 166, "order": 4, "body_text": "Can a person do the shinigami eye deal without losing half of his lifespan? Let's say, Bob has a death note. He gives up ownership, so that another one with shinigami eyes can tell him his lifespan. Bob is a genius, so he can calculate his death date. He writes his own name in it. \nBob Hyrule, Bradykardie, 2.3.2034. \nHe set his death date, by killing himself with a disease. Now he makes the shinigami eye deal. Will he die earlier? \n"}
{"post_id": "907", "novelty": false, "cluster_id": 166, "order": 5, "body_text": "Can I increase my lifespan by killing myself using the Death Note? Suppose I wrote that I will be killed by a UFO falling from space in the year 2315 while I am lifting.\nWill the Note increase my lifespan? In other words, will I still be alive by then? \n"}
{"post_id": "11515", "novelty": false, "cluster_id": 166, "order": 6, "body_text": "Death Note: Old age as cause of death? If you would write something like: \"Bob Hyrule dies of old age\", would this work? \n"}
{"post_id": "13551", "novelty": false, "cluster_id": 166, "order": 7, "body_text": "Another question about the 23 day rule Let's say there are two people with Death Notes, John Zeürtö and Bob Schnittlauchkäsebrot.\nJohn Zeürtö writes:\n\nBob Schnittlauchkäsebrot dies 23 days after the latter willingly forfeits ownership of the death note.\n\nWhat would happen? Some guesses:\n\nBob dies only after 23 days after he gives up the ownership of the death note, if he does or until his lifespan runs out.\nBob gets killed in 23 days.\nBob gives up ownership of his death note and then gets killed in 23 days.\nBob dies of a heart attack.\n\n"}
{"post_id": "21883", "novelty": false, "cluster_id": 166, "order": 8, "body_text": "Can Death Note be used to indirectly kill more than one person by killing the driver of a train/bus/plane? If you state \"Jack Hare\" will die at precisely 15:00 12/03/14 without stating the location, and you write this without knowing where they will be at the time, and the person goes to work as per normal, can this be used to kill more than one person?\n"}
{"post_id": "51", "novelty": false, "cluster_id": 166, "order": 9, "body_text": "What would happen if a Shinigami with exceedingly long life-span dies for a human? It was said that when a Shinigami saves a human with his Death Note, that Shinigami dies, and his remaining life-span is transferred to the human he saved.\nBut imagine the following situation, a Shinigami has accumulated 500 years of lifespan by killing a lot of humans. That Shinigami then kills someone for a human, to save his life, and dies.\nDoes that mean the human would gain 500 years to his lifespan?\n"}
{"post_id": "11607", "novelty": false, "cluster_id": 166, "order": 10, "body_text": "Is Misa's suicide being caused by Light's death a flaw in the story? In Episode 37, Light dies. Soon after that, Misa commits suicide. But I'm a little confused now, because of this rule:\n\nthe death of the person whose name is written in the book can not lead to anyone else's death\n\nNow, everyone knows that Misa will commit suicide if Light dies. But the death of a person whose name is written in the book can't lead to anyone else's death. So basically, Ryuk shouldn't have been able to kill Light, because if Light is dead, that will indirectly lead to Misa's death. So, have I missed something in Death Note, or am I right?\n"}
{"post_id": "15364", "novelty": false, "cluster_id": 166, "order": 11, "body_text": "When was the 23 day rule in Death Note revealed? In episode 34 Near asks Mogi how long you can manipulate a victim before their death. He replies 23 days because the Yotsuba incident proved this? When in the data from the Yotsuba incident was this proved?\n"}
{"post_id": "12798", "novelty": false, "cluster_id": 166, "order": 12, "body_text": "Death Note 23 Day rule? Okay, first read this rule:\n\nIn the Death Note, you cannot set the death date longer than the victim’s original life span. Even if the victim’s death is set in the Death Note beyond his/her original life span, the victim will die before the set time.\n\nSo that means if you wrote something like John zeurtö dies peacefully in the year 2315, that wouldn't work because this date is beyond his lifespan. But that would mean, if you wrote a date thats within his actual lifespan, that would work.\nBut now, there's this 23 day rule.\n\nThe Death Note can only operate within 23 days (in the human calendar). This is called the 23 day rule.\n\nSo, could the first example work? \n"}
{"post_id": "7415", "novelty": false, "cluster_id": 166, "order": 13, "body_text": "Is it possible to kill people indirectly with the Death Note? Rule X in the Death Note states:\n\n\nWhether the cause of the individual's death is either a suicide or accident, if the death leads to the death of more than the intended, the person will simply die of a heart attack. This is to ensure that other lives are not influenced.\n\n\nHowever, Rule XXVI states:\n\n\nEven though only one name is written in the Death Note, if it influences and causes other humans that are not written in it to die, the victim’s cause of death will be a heart attack\n\n\nBesides the fact that I find these 2 rules to be contradicting (correct me if I'm wrong), it still made me curious: Is it possible to kill people indirectly with the Death Note?\nFor example, writing a heart surgeon's name during a operation, or a pilot's name while mid-flight.\n"}
{"post_id": "11296", "novelty": false, "cluster_id": 166, "order": 14, "body_text": "Is Misa Amane's early death a plothole in Death Note? According to the wiki, when a Shinigami dies, their remaining lifespan is given to the human they saved.\n\nShinigami who die are reduced to dust, and their remaining lifespan is given to the human they saved.\n\nSince Rem killed L and Watari, she gained their remaining lifespans. Additionally she probably still had some lifespan left. On top of that Misa was already given a lot of lifespan from Gelus (from which she lost 75% again). So does this mean all of this lifespan is transferred to Misa Amane?!\nYet according to her wiki page, she dies in 2011 at the age of 26, only seven years after Rem died.\nDoes this mean that humans are also capable of reducing their own lifespans? Or would the author have made a mistake by letting Misa die as early as she has? I know she lost 75% of her remaining lifespan through the two eye deals, but you'd think that the cumulation of L, Watari and Rem's remaining lifespans would be greater than just one year, wouldn't you?\n"}
{"post_id": "13447", "novelty": false, "cluster_id": 166, "order": 15, "body_text": "What does the Death Note consider as \"original lifespan\"? I was reading this question and it got me thinking about what a person's \"original lifespan\" really was.\nDoes the original lifespan mean the amount of time a person has from birth to death, ultimately caused by old age (e.g. the longest a person could live barring abnormal health problems or unusual circumstances (e.g. murders, accidents))? \nWhat if the person contracts a lethal disease? Surely it would shorten their lifespan, but would it affect their original lifespan?\nSo, take for example:\nJohn has a lifespan of 93 years (as seen through Shinigami eyes). He works for the CIA, though, and at one point comes into contact with a high dose of radiation from a nuclear device. Doctors tell him he only has a couple days to live.\nIn this case, John's lifespan has been shortened from 93 years to 2 days. If he writes his own name in the Death Note, set to die from a different disease that takes years and years to develop, would he have effectively beaten radiation poisoning? \nNote that the 23-day rule (XVII) would not apply here thanks to rule XVIII.\n"}
{"post_id": "21874", "novelty": false, "cluster_id": 166, "order": 16, "body_text": "Killing Conjoined Twins using Death Note There are Mr. A and Mr. B. They are conjoined twins who each has their own set of organs except for the heart. I write the name of Mr. A while imagining his face, with the cause of death being falling from the top of Tokyo Tower head first. Let's say the difference in height between the two is less than 1 cm. Will Mr. B also die?\nAccording to How to Use: XXVI, item 2:\n\nEven though only one name is written in the Death Note, if it influences and causes other humans that are not written in it to die, the victim's cause of death will be a heart attack.\n\nHowever, a heart attack will also kill Mr. B.\nAdditionally, How to Use: X, item 2 stated:\n\nWhether the cause of the individual's death is either a suicide or accident, if the death leads to the death of more than the intended, the person will simply die of a heart attack. This is to ensure that other lives are not influenced.\n\n\nThis question is a bit different than the one proposed as possible duplicate. In the proposed question, the death of the pilot or the surgeon doesn't necessarily means that the people in the plane or the one in the surgery will 100% die. There is a delay before they actually die. Surgery is rarely done by only one doctor. It usually is done by a team of doctors, so the other doctors can still save the patient. Flying a plane is also the same. There is also the co-pilot. In the case of my question, killing Mr. A is the same as killing Mr. B since they share the same heart with no delay whatsoever to save Mr. B.\n"}
{"post_id": "18481", "novelty": true, "cluster_id": 166, "order": 17, "body_text": "How can a death note shorten the lifespan of others? The use of the Death Note in the human world sometimes affects other humans' lives or shortens their original life span, even though their names are not actually written in the Death Note itself. In these cases, no matter the cause, the god of death sees only the original lifespan and not the shortened lifespan.\nWe saw, that Misas lifespan was shortened because Light was killed by Ryuk. So this means, that you can shorten a persons lifespan with the death note. So let's say, A has a death note and knows that C wants to kill B with a death note. He writes B's name in his death note, thus preventing him from being killed by a death note. So C, can't kill B with a death note anymore. But since the death note can shorten the lifespan of those, whos name isn't written in the death note, C decides to use Y, to set up a trap. C writes:\nY, Car accident. Dies at 12:30, after he produces a deadly poison, which he injects into the food the person he knows as ''B'' eats. After he did this, he will die 9 days later in a car accident.\nSo, could C shorten B's lifespan in this way, so that he is able to indirectly kill him? \n"}
{"post_id": "20221", "novelty": true, "cluster_id": 166, "order": 18, "body_text": "Can a person do the shinigami eye deal without losing half of his lifespan? Let's say, Bob has a death note. He gives up ownership, so that another one with shinigami eyes can tell him his lifespan. Bob is a genius, so he can calculate his death date. He writes his own name in it. \nBob Hyrule, Bradykardie, 2.3.2034. \nHe set his death date, by killing himself with a disease. Now he makes the shinigami eye deal. Will he die earlier? \n"}
{"post_id": "907", "novelty": true, "cluster_id": 166, "order": 19, "body_text": "Can I increase my lifespan by killing myself using the Death Note? Suppose I wrote that I will be killed by a UFO falling from space in the year 2315 while I am lifting.\nWill the Note increase my lifespan? In other words, will I still be alive by then? \n"}
{"post_id": "21874", "novelty": true, "cluster_id": 166, "order": 20, "body_text": "Killing Conjoined Twins using Death Note There are Mr. A and Mr. B. They are conjoined twins who each has their own set of organs except for the heart. I write the name of Mr. A while imagining his face, with the cause of death being falling from the top of Tokyo Tower head first. Let's say the difference in height between the two is less than 1 cm. Will Mr. B also die?\nAccording to How to Use: XXVI, item 2:\n\nEven though only one name is written in the Death Note, if it influences and causes other humans that are not written in it to die, the victim's cause of death will be a heart attack.\n\nHowever, a heart attack will also kill Mr. B.\nAdditionally, How to Use: X, item 2 stated:\n\nWhether the cause of the individual's death is either a suicide or accident, if the death leads to the death of more than the intended, the person will simply die of a heart attack. This is to ensure that other lives are not influenced.\n\n\nThis question is a bit different than the one proposed as possible duplicate. In the proposed question, the death of the pilot or the surgeon doesn't necessarily means that the people in the plane or the one in the surgery will 100% die. There is a delay before they actually die. Surgery is rarely done by only one doctor. It usually is done by a team of doctors, so the other doctors can still save the patient. Flying a plane is also the same. There is also the co-pilot. In the case of my question, killing Mr. A is the same as killing Mr. B since they share the same heart with no delay whatsoever to save Mr. B.\n"}
{"post_id": "11515", "novelty": true, "cluster_id": 166, "order": 21, "body_text": "Death Note: Old age as cause of death? If you would write something like: \"Bob Hyrule dies of old age\", would this work? \n"}
{"post_id": "13447", "novelty": true, "cluster_id": 166, "order": 22, "body_text": "What does the Death Note consider as \"original lifespan\"? I was reading this question and it got me thinking about what a person's \"original lifespan\" really was.\nDoes the original lifespan mean the amount of time a person has from birth to death, ultimately caused by old age (e.g. the longest a person could live barring abnormal health problems or unusual circumstances (e.g. murders, accidents))? \nWhat if the person contracts a lethal disease? Surely it would shorten their lifespan, but would it affect their original lifespan?\nSo, take for example:\nJohn has a lifespan of 93 years (as seen through Shinigami eyes). He works for the CIA, though, and at one point comes into contact with a high dose of radiation from a nuclear device. Doctors tell him he only has a couple days to live.\nIn this case, John's lifespan has been shortened from 93 years to 2 days. If he writes his own name in the Death Note, set to die from a different disease that takes years and years to develop, would he have effectively beaten radiation poisoning? \nNote that the 23-day rule (XVII) would not apply here thanks to rule XVIII.\n"}
{"post_id": "21883", "novelty": true, "cluster_id": 166, "order": 23, "body_text": "Can Death Note be used to indirectly kill more than one person by killing the driver of a train/bus/plane? If you state \"Jack Hare\" will die at precisely 15:00 12/03/14 without stating the location, and you write this without knowing where they will be at the time, and the person goes to work as per normal, can this be used to kill more than one person?\n"}
{"post_id": "15364", "novelty": true, "cluster_id": 166, "order": 24, "body_text": "When was the 23 day rule in Death Note revealed? In episode 34 Near asks Mogi how long you can manipulate a victim before their death. He replies 23 days because the Yotsuba incident proved this? When in the data from the Yotsuba incident was this proved?\n"}
{"post_id": "12798", "novelty": true, "cluster_id": 166, "order": 25, "body_text": "Death Note 23 Day rule? Okay, first read this rule:\n\nIn the Death Note, you cannot set the death date longer than the victim’s original life span. Even if the victim’s death is set in the Death Note beyond his/her original life span, the victim will die before the set time.\n\nSo that means if you wrote something like John zeurtö dies peacefully in the year 2315, that wouldn't work because this date is beyond his lifespan. But that would mean, if you wrote a date thats within his actual lifespan, that would work.\nBut now, there's this 23 day rule.\n\nThe Death Note can only operate within 23 days (in the human calendar). This is called the 23 day rule.\n\nSo, could the first example work? \n"}
{"post_id": "17280", "novelty": true, "cluster_id": 166, "order": 26, "body_text": "How long can you manipulate a person with a Death Note? \nIf you write die of disease with a specific disease's name and the person's time of death, there must be a sufficient amount of time for the disease to progress. If the set time is too tight, the victim will die of a heart attack after 6 minutes and 40 seconds after completing the Death Note.\n\nLet's say Y has a Death Note. He also has Shinigami Eyes, and because he's a genius he can read in Shinigami time. So he wants to kill Z.\nHe writes:\n\nZ, bradykardie, dies of bradykardie at 11:59 on this date: 25.07.2062. Till he dies, he will always do whatever the person he knows as A tells him to do. \n\n(Yes, Z is destined to die at the mentioned date.)\n(A won't die, since he already wrote his own name in his Death Note.)\nWould this work?\n"}
{"post_id": "23596", "novelty": true, "cluster_id": 166, "order": 27, "body_text": "Is the death note 23 days rule inconsistent? We all know about the 23 day rule. Well. I've been rewatching the series, and I've found something strange in episode 8...\nAt 4:10 (youtube) Light asks Ryuk if you can use any date, as long it's before the victims lifespan, to which Ryuk replies; yes\n"}
{"post_id": "7415", "novelty": true, "cluster_id": 166, "order": 28, "body_text": "Is it possible to kill people indirectly with the Death Note? Rule X in the Death Note states:\n\n\nWhether the cause of the individual's death is either a suicide or accident, if the death leads to the death of more than the intended, the person will simply die of a heart attack. This is to ensure that other lives are not influenced.\n\n\nHowever, Rule XXVI states:\n\n\nEven though only one name is written in the Death Note, if it influences and causes other humans that are not written in it to die, the victim’s cause of death will be a heart attack\n\n\nBesides the fact that I find these 2 rules to be contradicting (correct me if I'm wrong), it still made me curious: Is it possible to kill people indirectly with the Death Note?\nFor example, writing a heart surgeon's name during a operation, or a pilot's name while mid-flight.\n"}
{"post_id": "11296", "novelty": true, "cluster_id": 166, "order": 29, "body_text": "Is Misa Amane's early death a plothole in Death Note? According to the wiki, when a Shinigami dies, their remaining lifespan is given to the human they saved.\n\nShinigami who die are reduced to dust, and their remaining lifespan is given to the human they saved.\n\nSince Rem killed L and Watari, she gained their remaining lifespans. Additionally she probably still had some lifespan left. On top of that Misa was already given a lot of lifespan from Gelus (from which she lost 75% again). So does this mean all of this lifespan is transferred to Misa Amane?!\nYet according to her wiki page, she dies in 2011 at the age of 26, only seven years after Rem died.\nDoes this mean that humans are also capable of reducing their own lifespans? Or would the author have made a mistake by letting Misa die as early as she has? I know she lost 75% of her remaining lifespan through the two eye deals, but you'd think that the cumulation of L, Watari and Rem's remaining lifespans would be greater than just one year, wouldn't you?\n"}
{"post_id": "13551", "novelty": true, "cluster_id": 166, "order": 30, "body_text": "Another question about the 23 day rule Let's say there are two people with Death Notes, John Zeürtö and Bob Schnittlauchkäsebrot.\nJohn Zeürtö writes:\n\nBob Schnittlauchkäsebrot dies 23 days after the latter willingly forfeits ownership of the death note.\n\nWhat would happen? Some guesses:\n\nBob dies only after 23 days after he gives up the ownership of the death note, if he does or until his lifespan runs out.\nBob gets killed in 23 days.\nBob gives up ownership of his death note and then gets killed in 23 days.\nBob dies of a heart attack.\n\n"}
{"post_id": "17169", "novelty": true, "cluster_id": 166, "order": 31, "body_text": "Can a person who influences others lives be killed by a Death Note? There's a rule, that a death note entry can't lead to another's dead. So here is a bad example:\nA has a bomb, which will explode, if his heart stops, (this bomb is extremely accurate, so if his heart even stops for one second, the bomb will explode.) \nB has a death note, and wants to kill A. \nA, has a hostage, who is close to him, and if the bomb will explode, the hostage will also die. \nB writes A's name in its death note. Will A die, or will he survive, because if he dies, the hostage will also die? \n"}
