{"post_id": "11636", "novelty": true, "cluster_id": 170, "order": 0, "body_text": "How does the state know when people transmute something into gold? In FMA, transmuting gold is against the law. However, I don't get this - How does the state know when people transmute something (e.g. bread into gold)?. \nThere's nothing to stop someone from transmuting bread into a gold coin, walking into a store and then going on their merry way out as if nothing happened, because there's absolutely no way to know that it was bread to start off with. (Please correct me if I'm wrong. I haven't been watching the anime in a while and have only started re-watching again).\nSo, how will/how does the state know when someone has transmuted something into gold? How do they deal with this? e.g. imprisonment, fines etc.\n"}
{"post_id": "8075", "novelty": true, "cluster_id": 170, "order": 1, "body_text": "Can gold be transmuted in the Fullmetal Alchemist continuity? In the Fullmetal Alchemist manga/2009 anime, we learn that alchemists must obey three rules:\n\nDo not oppose the military\nDo the transmute gold\nDo not do human transmutation\n\nMoreover, at one point in the early manga (probably chapter 3, according to Wikipedia), we see Ed transmute what appears to be gold from rocks, when he is duping Yoki into selling him rights to Youswell. (However, in the context of my question below, this might also be attributed to early-installment weirdness, since in the corresponding episode in the 2003 anime - episode 9 - I think we see Ed giving Yoki rocks that have been coated with gold from coins Ed got from Yoki.)\nBoth of the above seem to imply that transmuting gold is possible in the FMA universe, yet this seems to be contradictory given some other manga details. In the first chapter, we learn from Al that with alchemy, one can only transmute like from like. Being me, I read this to imply that the sort of conservation of mass alluded to when chemical equations are balanced generally applies in terms of what alchemy can do the FMA universe (at least in the more practical, mundane examples we see in the manga). (On a second read, I'm really not sure if that's a \"correct\" interpretation.)\nThus: is transmuting gold actually taken to be something possible in the FMA universe (or is it even possible to come to a conclusion about this)?\n"}
