{"post_id": "20916", "novelty": true, "cluster_id": 201, "order": 0, "body_text": "What anime is this silver haired girl from? I've seen the anime before, but I forgot the name.\n\n"}
{"post_id": "21646", "novelty": false, "cluster_id": 201, "order": 1, "body_text": "Which manga or manhwa is this boy from? Which manga or manhwa is this boy from?\n\n"}
{"post_id": "29367", "novelty": false, "cluster_id": 201, "order": 2, "body_text": "What is this manga? (With a photo link) I tried to make a reversed photo search but found nothing. I originally saw this photo on twitter. I asked the person who posted it but got no reply.\n\n"}
{"post_id": "27889", "novelty": false, "cluster_id": 201, "order": 3, "body_text": "Ever read a manga with teddy bears in it? I found this page from a manga online a long time ago but have no idea what the source is. \n\nIt looks so cute. Anyone know the source?\n"}
{"post_id": "22467", "novelty": false, "cluster_id": 201, "order": 4, "body_text": "What manga is this of a black guy and blonde girl? \nIt has a chinese name this manga but i cant remember what!\n"}
{"post_id": "9673", "novelty": false, "cluster_id": 201, "order": 5, "body_text": "Picture of a male character with gauntlet and sword and a female with red hair \nAnyone knows what anime is this picture from?\n"}
{"post_id": "21163", "novelty": false, "cluster_id": 201, "order": 6, "body_text": "Where are the characters in this picture that was on an anime wallpaper app from? This is a picture that was on an anime wallpaper app under the recently updated section, with no anime title. The only other person that watches anime has seen of it, but does not know the name. Can someone tell me the name?\n\n"}
{"post_id": "11269", "novelty": false, "cluster_id": 201, "order": 7, "body_text": "What anime does this pic come from? I just wanted to know the name of this anime:\n\n"}
{"post_id": "24390", "novelty": false, "cluster_id": 201, "order": 8, "body_text": "What manga is this image of a couple from? What manga is this image from? It look so cute and I just wanna read it!\n\n"}
{"post_id": "28106", "novelty": false, "cluster_id": 201, "order": 9, "body_text": "Who is this brown haired girl with a red flower umbrella? She is wearing a red and pink themed style of clothing, accessory. She is also holding an red umbrella with flowers. At her back there are pinkish flowers and hearts flying around.\n\n"}
{"post_id": "28104", "novelty": false, "cluster_id": 201, "order": 10, "body_text": "What's this Purple Haired Character? She is holding a weapon which looks like a blade of some kind...\nShe have lightly purplish hair, I do not know what her character class is in the scene. Can somebody me tell who she is? Where do you think she is at?\n\n"}
{"post_id": "28581", "novelty": false, "cluster_id": 201, "order": 11, "body_text": "Which manga is this cute scene from? \nDoes anybody know which manga this is from ?\n"}
{"post_id": "8431", "novelty": false, "cluster_id": 201, "order": 12, "body_text": "Can you tell me the name of this anime girl? \nSo, thank you in advance. ~ <3\n"}
{"post_id": "9824", "novelty": false, "cluster_id": 201, "order": 13, "body_text": "Male protagonist with a skateboard? I am assuming that this is the main male protagonist from an anime that I am yet to find. Does anyone know from which anime this comes from?\n\nIt looks similar to Hamatora, but not quite. From a Google Image search I found that it may be from Bakuman, but couldnt quite find anyone who looks like this from the picture above.\nIs it Bakuman? If not what anime is it from and who is this that is featured in the picture?\n"}
{"post_id": "24301", "novelty": false, "cluster_id": 201, "order": 14, "body_text": "Does anyone here know what anime this guy belong? \nDoes anyone here know what anime this guy belong? \n"}
{"post_id": "25697", "novelty": false, "cluster_id": 201, "order": 15, "body_text": "What kind of anime is this? Found it on google \nI found this while browsing google and was interested in watching it, but it gave no description as to what anime it was. Does anyone have an idea of which anime this is? I like the way it looks!\n"}
{"post_id": "5308", "novelty": false, "cluster_id": 201, "order": 16, "body_text": "Who is this blue-haired male character? I stumbled across this image today on facebook. What is this character's name and consequently of course, which anime is he from? \n\n"}
{"post_id": "28636", "novelty": false, "cluster_id": 201, "order": 17, "body_text": "Which anime is this picture of a girl whipping a man from? This is the picture, \n\nIf anyone can tell me where this is from, I'll appreciate it!\n"}
{"post_id": "26476", "novelty": false, "cluster_id": 201, "order": 18, "body_text": "Can someone tell me from what Anime is this character? I found her on a Facebook post, but I could not identify the anime. \nIf anyone knows It would be much appreciated.\n\n"}
{"post_id": "29281", "novelty": false, "cluster_id": 201, "order": 19, "body_text": "What anime is this gif of a girl with sword being splattered with blood from? \nWhich anime is this gif of a girl with sword being splattered with blood from?\n"}
{"post_id": "28227", "novelty": false, "cluster_id": 201, "order": 20, "body_text": "What manga is this image of two couples constantly cuddling, looking each other in the eye from?  \nGirl seems to be shy and seems to be a slow moving couple\n"}
{"post_id": "27178", "novelty": false, "cluster_id": 201, "order": 21, "body_text": "Can someone tell me the name of this anime? \nplease someone, tell me what this anime :D, thanks\n"}
{"post_id": "28224", "novelty": false, "cluster_id": 201, "order": 22, "body_text": "what yaoi manga is this image from? two little boys who grow up and fall in love need to find again. read it a long time ago and found this pic and remembered how great it was but forgot the name.\n\n"}
{"post_id": "4321", "novelty": false, "cluster_id": 201, "order": 23, "body_text": "What anime is this image of a girl caressing a skeleton from? I found this picture on a fansub website, and it did not have any reference to the name of the anime to which it belongs.\n \nDoes anyone know where it is from?\n"}
{"post_id": "26680", "novelty": false, "cluster_id": 201, "order": 24, "body_text": "Ask anime title Anyone, can you tell me what is this anime title?thanks\n\n"}
{"post_id": "14329", "novelty": false, "cluster_id": 201, "order": 25, "body_text": "What anime is this from? I found this image from the internet and am wondering, which anime does it originate from?\n\n"}
{"post_id": "29230", "novelty": false, "cluster_id": 201, "order": 26, "body_text": "what anime is she from?? \nI really need to know what anime she is from!!!!!\n"}
{"post_id": "4282", "novelty": false, "cluster_id": 201, "order": 27, "body_text": "What anime is this winking girl from? \nI've been searching for quite a long time...I'm guessing it's from an Anime.\n"}
{"post_id": "20699", "novelty": false, "cluster_id": 201, "order": 28, "body_text": "What anime is this flash loop about the eating order of different kinds of meat from? I found this flash loop on Dagobah. Which anime is it from?\n\n"}
{"post_id": "26398", "novelty": false, "cluster_id": 201, "order": 29, "body_text": "What anime is this scene of a child holding a swimming ring from? What anime is this image from?\n\nOriginally from: http://inflatableanime.ning.com/photo/blow-1\n"}
{"post_id": "29036", "novelty": false, "cluster_id": 201, "order": 30, "body_text": "Manga identification request An Image is worth more than a thousand words, so I leave you this image about a scanlation group's request personnel, I'd like to know which manga is this one (thank you in advance):\n\n"}
{"post_id": "13867", "novelty": false, "cluster_id": 201, "order": 31, "body_text": "Who is this girl with red hair in a sheep outfit? \nJust wondering because oppai....anyone know who this character is? Thanks for answering!\n"}
{"post_id": "9525", "novelty": false, "cluster_id": 201, "order": 32, "body_text": "Does anyone know what this manga with a purple-haired guy is? \nSo I looked at the picture and I wanted to know what manga this was. Does anyone know?\n"}
{"post_id": "6676", "novelty": false, "cluster_id": 201, "order": 33, "body_text": "Where does this picture come from? \nI think this is fan art of an anime, but I am not sure which. Can someone help me find where this comes from?\n"}
{"post_id": "21618", "novelty": false, "cluster_id": 201, "order": 34, "body_text": "Where is this picture from? How do I use Reverse Image Search to find the source of an anime/manga image? So I see an image from what I believe is from either an anime or manga. What are some ways that I can go about finding what series it's from?\nTry these options:\n\nGoogle reverse image search (browser built-in support and plugins)\nOther reverse image search engines: TinEye, SauceNao, iqdb\nTechnique: Cropping the image\nAnimated GIF: Picking the right frame\n\n\nNote: If you followed these methods and could not identify your image, you're welcome to ask a question tagged identification-request. Be sure to mention that you followed these steps and what results (if any) you saw. Reading these guidelines can prevent getting your question closed for lack of details.\n\n\n\nProtip: If you are using Google Image Search in a non-English language, change your language to English for better, more accurate results.\n\n"}
{"post_id": "22906", "novelty": false, "cluster_id": 201, "order": 35, "body_text": "What anime is this from guy and girl in kimono? \nI am interested as to what anime this couple is from. Would anyone know of the source for this?\n"}
{"post_id": "14521", "novelty": false, "cluster_id": 201, "order": 36, "body_text": "What manga is this cat girl from? Please tell me what this is from\n\nMy Thanks\n"}
{"post_id": "29303", "novelty": false, "cluster_id": 201, "order": 37, "body_text": "Does somebody know which manga this couple is from? \nI would like to know the answer as soon as possible \n"}
{"post_id": "6502", "novelty": false, "cluster_id": 201, "order": 38, "body_text": "Can anyone tell me what anime this nekomimi girl is from? \nDoes anyone know who the girl with the cat ears is or what anime she is from?\nThe one between Shana and Naruto.\nThanks\n"}
{"post_id": "29304", "novelty": false, "cluster_id": 201, "order": 39, "body_text": "Which manga is this manga scene from? \nFrom which manga is the above scene from? Thank you for your answer in advance! \n"}
{"post_id": "13135", "novelty": false, "cluster_id": 201, "order": 40, "body_text": "What anime series is this? I was on a forum and one profile picture attracted me which is following. \n\n\nI want to know about this anime series or movie or manga?\n"}
{"post_id": "25875", "novelty": false, "cluster_id": 201, "order": 41, "body_text": "Does anyone know this anime? I received a free badge and I don't know which anime it is from. Help would be appreciated..\n"}
{"post_id": "29497", "novelty": false, "cluster_id": 201, "order": 42, "body_text": "what manga is this from ? :) \nCan someone help me? What manga is this?\n"}
{"post_id": "3617", "novelty": false, "cluster_id": 201, "order": 43, "body_text": "From what series is this odd lolicon poster? I recently saw this image of an approximately high-school-aged boy with a young girl under his arm, pointing up at the stars with the text \"lolicons are diseased!\"\n\n(Note: No offense intended from the image.)\nAre the characters found in this image from an actual anime or manga, or are they just made up for this bit of art? If it's the former, what series are they from?\n"}
{"post_id": "21822", "novelty": false, "cluster_id": 201, "order": 44, "body_text": "Is this image of a girl with a beanie hat from any anime or manga? I would like to know the source for this image. If someone knows please tell me :)\n\n"}
{"post_id": "21445", "novelty": false, "cluster_id": 201, "order": 45, "body_text": "What anime is this gif of a blonde haired girl whose breast is expanding from? I'm trying to find out which anime this gif is from.\nPotentially NSFW:\n\n  \n\n"}
{"post_id": "5139", "novelty": false, "cluster_id": 201, "order": 46, "body_text": "Which anime is this girl from? \nAny ideas? Is this even in an anime? - All I know is that I keep seeing this chick posted all over the place.\n"}
{"post_id": "22974", "novelty": false, "cluster_id": 201, "order": 47, "body_text": "Anime with dark-haired guy embracing a brunette? Sorry for the poor quality of the image, but does anyone know this anime? Can't remember it, but I guess the anime was released along with Cardcaptor Sakura and Fushigi Yuugi that year.\n\n"}
{"post_id": "28540", "novelty": false, "cluster_id": 201, "order": 48, "body_text": "From what manga does this couple hugging comes from? From what anime is this picture from?\n\n"}
{"post_id": "28573", "novelty": false, "cluster_id": 201, "order": 49, "body_text": "What is the anime from this picture? what anime is this from? Would really apreciate it\n"}
{"post_id": "22308", "novelty": false, "cluster_id": 201, "order": 50, "body_text": "Who is this couple in the picture below and which anime are they from? Who is this couple in the picture below and which anime are they from? \n\n"}
{"post_id": "20892", "novelty": false, "cluster_id": 201, "order": 51, "body_text": "What manga is this picture of a girl and a boy talking at the river banks from? It's from one of those scanlation ads, but I don't know which manga it's from! I wish they'd credit them... If you know which manga it is, thanks in advance!\n\n\n"}
{"post_id": "21953", "novelty": false, "cluster_id": 201, "order": 52, "body_text": "What manga is this from? \nI have been looking all over my reading list, and my little manga link folder, and nothing! I don't even remember reading it actually..but it seems very interesting, and the drawing is familiar.. someone? please help!\n"}
{"post_id": "5020", "novelty": false, "cluster_id": 201, "order": 53, "body_text": "What is the name of this anime with nekomimi? \nI have been wondering for a long time which anime this is from. \n"}
{"post_id": "21384", "novelty": false, "cluster_id": 201, "order": 54, "body_text": "What anime is this picture of a guy and an elf-like girl from? \nCan anyone help me find out what anime this picture is from? Thank you.\n"}
{"post_id": "29362", "novelty": false, "cluster_id": 201, "order": 55, "body_text": "What anime/manga is this picture of a girl lying in water from? I came across this pic and for certain reasons I want to find from what anime this pic is from. I have used Google Reverse Image Search and other Reverse Image Search platforms but with no result.\nHere is the pic non-cropped (Possible NSFW): \n\n \n\nand cropped:\n\n"}
{"post_id": "9867", "novelty": false, "cluster_id": 201, "order": 56, "body_text": "What anime is this girl with light hair and glasses from? Can anyone help me? I've already tried google image search and tineye with no results.\n\n"}
{"post_id": "26771", "novelty": false, "cluster_id": 201, "order": 57, "body_text": "What's the name of this anime girl in bed with blank/pink underwear? I recently found this certain .gif on Facebook and I was really curious of where this mostly nude anime girl came from. She also seems to have a brownish hair ribbon.\nCareful, NSFW!\n\n \n\nFrom: http://i.giphy.com/3oEdv4ifZXDK6NFLC8.gif\n"}
{"post_id": "13594", "novelty": false, "cluster_id": 201, "order": 58, "body_text": "Where is this image with a blue-eyed girl with dark hair and text about love from? Image here also:\n\nI've seen a couple images around this character on social networking sites such as Facebook and I have no idea where it is from.\n"}
{"post_id": "13592", "novelty": false, "cluster_id": 201, "order": 59, "body_text": "Which anime is this girl with long blue hair from? \nI've seen this character in multiple instances. I am just wondering who she is. I've also seen her in a split picture with Black Rock Shooter.\n"}
{"post_id": "25851", "novelty": false, "cluster_id": 201, "order": 60, "body_text": "Which anime is this photo of a girl crying while hugging a guy from? \nSaw this while browsing the web and really wanted to know which anime is this photo from\n"}
{"post_id": "18511", "novelty": false, "cluster_id": 201, "order": 61, "body_text": "Which manga is this kissing scene from? Which manga is the scene pictured below from?\n\n"}
{"post_id": "19458", "novelty": false, "cluster_id": 201, "order": 62, "body_text": "Looking for the title of the anime whose anime characters are featured in a Tumblr gif Does anyone know what anime this gif is from? \n\n"}
{"post_id": "21318", "novelty": false, "cluster_id": 201, "order": 63, "body_text": "Which anime is this meme with a guy hitting the glass window from? Which anime is this picture with a guy hitting the glass window from?\n\n"}
{"post_id": "23638", "novelty": false, "cluster_id": 201, "order": 64, "body_text": "What anime is this girl with long blond hair tied up into a side ponytail from? Could someone tell me what anime this girl is from? I'm dying to find out.\n\n"}
{"post_id": "22751", "novelty": false, "cluster_id": 201, "order": 65, "body_text": "What manga is this image from? \nIt has been edited for a website, so it is not the original image straight from the manga. Really, I'm not even sure if it is from a manga, someone might have just drawn it. But! If it is from a manga, I would love to know which one. Any ideas? \n"}
{"post_id": "27478", "novelty": false, "cluster_id": 201, "order": 66, "body_text": "Where is this long-haired girl holding a headset from? I've been wandering through AnimeBox Website, and I came across this image. I can't identify the character or manga she is from.\nHere is the image\n"}
{"post_id": "29562", "novelty": false, "cluster_id": 201, "order": 67, "body_text": "Which anime/manga does this come from if there's any at all? Plz help me if u do happen to know!!! Thx soooo much!!\n\n"}
{"post_id": "12751", "novelty": false, "cluster_id": 201, "order": 68, "body_text": "What anime is this blue haired, purple eyed character from? I found this picture online,does anyone know where she from? \n"}
{"post_id": "28946", "novelty": false, "cluster_id": 201, "order": 69, "body_text": "What anime is this GIF from? \nWhat anime is this?\nLooks really cool visually and I like the art style.\n"}
{"post_id": "27344", "novelty": false, "cluster_id": 201, "order": 70, "body_text": "What anime is this long-haired girl in a T-shirt from? I want to know what anime this character is from:\n\nI have used Google's search by image and I couldn't find anything, probably because of the Bad image quality.\nthis answer from This question dose not help me i have all ready tried the steps.\n"}
{"post_id": "19678", "novelty": false, "cluster_id": 201, "order": 71, "body_text": "What is the identity of this white haired anime guy with the sword? \nI would like to identify the person on the right in this picture. He has a white and red sword with writing on it, and wears a black tux. His hair appears to be either white or purple, as the lighting of the picture makes it hard to tell for sure.\nWho is this?\n"}
{"post_id": "26950", "novelty": false, "cluster_id": 201, "order": 72, "body_text": "Who's the blue haired character in this image? \nI always see this in forums and I asked many times but no one never knew if she's from an anime or something.\nI tried to search the image on google using the reverse image search, I also tried many anime pics websites but couldn't find any information about it.\nIf I had to guess I would say this is a fanart of Tsugumi Seishirou from Nisekoi, but I'm not sure\n"}
{"post_id": "23355", "novelty": false, "cluster_id": 201, "order": 73, "body_text": "What manga is this image of a girl kissing a boy from? i saved this manga picture in my ipad about 2 years ago and i really wanted to re-read it but i totally forgot the name of the manga. help pls?\n\n"}
{"post_id": "24523", "novelty": false, "cluster_id": 201, "order": 74, "body_text": "Does anyone know what show this is?  \nMay not be much help sorry and thanks\n"}
{"post_id": "23983", "novelty": false, "cluster_id": 201, "order": 75, "body_text": "What anime is this character with a jewel on their forehead from? \nWhich anime is this picture from? It used to be an anime from the anime network.\n"}
{"post_id": "29155", "novelty": false, "cluster_id": 201, "order": 76, "body_text": "Can someone tell me the title of this anime \nCan someone tell me what anime this is and what link i can watch it from. Thanks :D\n"}
{"post_id": "21153", "novelty": false, "cluster_id": 201, "order": 77, "body_text": "Which episodes of \"GITS: Arise − Alternative Architecture\" are covered by \"GITS: Arise − Border\" movies? I recently watched Ghost in the Shell: Arise − Alternative Architecture episode 3 and was dismayed to find that the episode was pretty much a repeat of part of the Ghost in the Shell: Arise − Border 1 movie. I’d rather not re-watch the same content, so I was wondering \n\nWhich episodes of the TV series GITS − AA are covered by the GITS − Border movies?\nAre there any differences between the repeated stories (IE. extra\nscenes/new content/changed plot)?\n\n"}
{"post_id": "11162", "novelty": false, "cluster_id": 201, "order": 78, "body_text": "What anime is this image of a girl fighting a dragon from? \nI found this image online, and thought \"Wow, badassery right here.\" and I want to watch whatever anime they are from. thanks\n"}
{"post_id": "7506", "novelty": false, "cluster_id": 201, "order": 79, "body_text": "Who is this girl character, she seems so familiar \nI am really interested in knowing who is this girl, it is driving me crazy because I feel like I know her, but can't just get the name or anime to my head ;__;\n"}
{"post_id": "21804", "novelty": false, "cluster_id": 201, "order": 80, "body_text": "What anime is this picture of someone shirtless and with short hair from? \nIt's from an old cartoon but I don't know its name...\n"}
{"post_id": "23026", "novelty": false, "cluster_id": 201, "order": 81, "body_text": "Ghost In The Shell : Order? Just picked up 'GITS - Stand Alone Complex' Vol 1 & 2 when I was looking around a shop.\nGot home and checked online and noticed there are a lot of seasons/movies/( 9 different ones in total.) \nI would like to watch them in order of release.\nThanks in advance.\n"}
{"post_id": "9927", "novelty": false, "cluster_id": 201, "order": 82, "body_text": "What is the name of the anime this pink-haired girl is from? I saw this picture on facebook and I would like to know what anime she is from\n\n"}
{"post_id": "12755", "novelty": false, "cluster_id": 201, "order": 83, "body_text": "Who is this Dude? \nI found this on my tumblr dash. Does anyone know where it is from?\n"}
{"post_id": "11195", "novelty": false, "cluster_id": 201, "order": 84, "body_text": "What is this anime where a girl happily says that she's done her homework? \ncan someone please help me out and tell me what anime is this? \nThanks \n"}
{"post_id": "27951", "novelty": false, "cluster_id": 201, "order": 85, "body_text": "What is the name of the anime from which this girl having blue eye flame and black hair is from? \nAt first, I thought it was only some fanart, but then I saw the second picture, so it must definitely be from an anime/manga, or maybe some game... So, please tell me, from which title is this girl?\nThank you very much in advance!\n"}
{"post_id": "21004", "novelty": false, "cluster_id": 201, "order": 86, "body_text": "Which anime is this gif of a green haired girl trying to embrace the guy who saved her? \nFrom http://vk.com/doc27061204_322688326?hash=e4a396c34816224358&dl=43a4bc53ef91ce126\nWell, that's what I've got. Please tell me if you know.\n"}
{"post_id": "17161", "novelty": false, "cluster_id": 201, "order": 87, "body_text": "Where is this image with three girls from? I don't have any info besides this picture.\n\n"}
{"post_id": "5275", "novelty": false, "cluster_id": 201, "order": 88, "body_text": "Who is this grey-haired girl with a blue gem necklace and white flower? She looks like she wears blue flowery hair bow and dress. She is also carrying a lily of somewhat. Who is she? In this picture, she has her eyes closed while holding the lily in front of her feathery winged dress. She is a white flower lady and cartoon character.\n\n"}
{"post_id": "27416", "novelty": false, "cluster_id": 201, "order": 89, "body_text": "What anime are these guys fighting with blades from? \nI saw this post on Tumblr and this show looks pretty trill. Someone please tell me what this is from.\n"}
{"post_id": "6323", "novelty": false, "cluster_id": 201, "order": 90, "body_text": "What is this manga about a student who doesn't want his diploma? Does anyone know of this manga? I also tried to search with Google Image Search but nothing of relevance was found.\n \n"}
{"post_id": "27169", "novelty": false, "cluster_id": 201, "order": 91, "body_text": "What anime is this picture of a red haired girl from? \nI came across the picture here\n"}
{"post_id": "28965", "novelty": false, "cluster_id": 201, "order": 92, "body_text": "What anime is this from?!?! Pls help! https://instagram.com/p/BAgpWBWmy4M/\nPlease help! I swear I recognize it and been searching EVERYWHERE FOR IT 3: please help!\n"}
{"post_id": "27483", "novelty": false, "cluster_id": 201, "order": 93, "body_text": "Anime identification request - slice of life show I don't have much to go on for this identifications, when I was browsing my background folder I came across the following picture: \nAnd I litteraly have no idea where it came from, I think it is a slice of life show, but apart from that I have nothing to go on. I hope the picture is clear enough and not to broad for question standards\nNote that I did do a google search but thank you for finding it Tyhja\n"}
{"post_id": "20454", "novelty": false, "cluster_id": 201, "order": 94, "body_text": "What anime is this picture of a boy and three onee-san type girls from? \nImage Source: http://postimg.org/image/k0xsl5juf/\nI've been looking for ages but couldn't find what is it.\n"}
{"post_id": "28383", "novelty": false, "cluster_id": 201, "order": 95, "body_text": "What manga is this image of a boy and girl drooling over something's cuteness from? \nI tried reverse image searching this but nothing seemed to pop up. The results are always \"cute anime couples tumblr\" and it makes me unsure if this is just an illustration or a manga but it would be nice to know the name if it was a manga. ^^ thanks in advance!\n"}
{"post_id": "19865", "novelty": false, "cluster_id": 201, "order": 96, "body_text": "What anime is this short clip of two girls jumping over balcony from? I stumbled upon this clip, but I had no idea of how to find what anime it's from\nHere is a screenshot from the clip:\n\n"}
{"post_id": "10113", "novelty": false, "cluster_id": 201, "order": 97, "body_text": "What anime is this guy from? I was wondering if anybody knows what anime this picture is from, if you could tell me I'd highly appreciate it. \n\n"}
{"post_id": "29177", "novelty": false, "cluster_id": 201, "order": 98, "body_text": "From what manga is this woman with a ponytail and a circular mark on her chest? I have already done a reverse image search on multiple engines to no avail. Please help!\n\n"}
{"post_id": "21771", "novelty": false, "cluster_id": 201, "order": 99, "body_text": "Which anime is this girl with orange hair, blue eyes and blue ribbons from? I remember watching this anime. I remember a sad scene where the girl was trying to hug a guy with maroon (?) hair, but he disappeared and she cried.\nThis is her picture:\n\nShe has orange hair, blue eyes, and wears blue hair ribbons.\n"}
{"post_id": "26564", "novelty": false, "cluster_id": 201, "order": 100, "body_text": "What manga is this scanlation from? \nI found this picture scrolling across ifunny and the poster didnt know what it was from so now im here\n"}
{"post_id": "18803", "novelty": false, "cluster_id": 201, "order": 101, "body_text": "Which anime is this girl with long purple hair from? Someone in my contact list has set this girl as their Whatsapp profile picture, and I am interested in knowing which anime she belongs to.\n\n"}
{"post_id": "24265", "novelty": false, "cluster_id": 201, "order": 102, "body_text": "Please identify this show with a man with dark hair usnig ice magic \nCan someone tell me what the name of this anime is?\n"}
{"post_id": "6857", "novelty": false, "cluster_id": 201, "order": 103, "body_text": "Who is this female character? \nCan anyone identify this girl for me? Sorry, these small icons are the only images I can provide. Please and thank!\n"}
{"post_id": "21330", "novelty": false, "cluster_id": 201, "order": 104, "body_text": "What's this manga with a boy and girl together in bed? \nI don't know the plot or anything I just saw this picture and thought it was really cute. Please help!\n"}
{"post_id": "15432", "novelty": false, "cluster_id": 201, "order": 105, "body_text": "What manga is this picture from? \nI took a screenshot and now I can't remember... \n"}
{"post_id": "21477", "novelty": false, "cluster_id": 201, "order": 106, "body_text": "What manga is this picture of a boy and a girl from? \nI don't know which manga this picture is from.\nIn the beginning I thought it was Sakisaka Io's manga, but turns out it isn't. \n"}
{"post_id": "29322", "novelty": false, "cluster_id": 201, "order": 107, "body_text": "What manga is this image from that has two robot maids about to fight each other, and where can I find it? I found these images from fembotwiki.com under the unknown comics/manga section. They are about some robot maids who are called cyber maids and they seem to be about to fight each other and I'm just curious what will happen. I don't know if these pictures are from a manga or manhwa or manhua or an Asian webcomic. Here are the images:\n\nIf anyone knows what manga or manhwa or manhua or Asian webcomic these pictures are from, please tell me.\n\nUPDATE:\nI did some research and found that it is from a web manga called \"Fighting Maidroids\" from CyberManga. Here's a link: konohanasakuya.com/f_english/cybermanga_maid.html.\nI would like to ask what website I can I find it on, because the above website doesn't have a reading section or I'm just looking in the wrong direction. If anyone knows what other website I can read it from, please tell me. English or Japanese or any other language is fine by me, but I mostly prefer English. Also, I don't know if it's only a webcomic because there seems to be hard copies to buy on Japanese websites that requires yen.\n"}
{"post_id": "22016", "novelty": false, "cluster_id": 201, "order": 108, "body_text": "Which anime is this girl holding a gun sword from? \nThis is a anime girl wearing a black dress and holding a gun sword. She has long black hair and there is a red ribbon around the sword's blade.\n"}
{"post_id": "7972", "novelty": false, "cluster_id": 201, "order": 109, "body_text": "What anime/manga/VN do this picture and character come from? \nWhere do this picture and character come from? I have searched a lot but can't seem to find the source.\n"}
{"post_id": "16785", "novelty": false, "cluster_id": 201, "order": 110, "body_text": "Who is this Male Character? I think this guy looks bad ass sadly I have no idea who he is. Is anyone able to help me out? Please and Thank-you kindly.\n\n"}
{"post_id": "14192", "novelty": false, "cluster_id": 201, "order": 111, "body_text": "What anime is this character from? I was wondering which character this person is from. Anyone know?\n\n"}
{"post_id": "6511", "novelty": false, "cluster_id": 201, "order": 112, "body_text": "Can anyone tell me the name of this manga? \nThink it's a manhwa but don't know which one so I was wondering if anyone could please tell me where it's from\n"}
{"post_id": "25673", "novelty": false, "cluster_id": 201, "order": 113, "body_text": "what is this anime? ive been searching forever Sorry all I have is a link. I had no idea how to get an image up here. I asked tumblr, twitter, everything. No one seems to know. Please help me out :( The title seems to have a musical note in the front of it. \n\n"}
{"post_id": "19707", "novelty": false, "cluster_id": 201, "order": 114, "body_text": "What anime is this animated gif of four guys going crazy at karaoke? I was recently on Tumblr and this post came up on my dash. After laughing a little a lot at the post itself, I wondered which anime it was from because it actually looked pretty cool.\nHere are two of the images from the post:\n\n\nThanks for the help!\n"}
{"post_id": "21831", "novelty": false, "cluster_id": 201, "order": 115, "body_text": "What manga is this image of a boy tickling a girl from behind from? Can you please tell me the name of this manga? \n\nSource: http://www.foxpic.com/VTK4QjMl.jpg\n"}
{"post_id": "17235", "novelty": false, "cluster_id": 201, "order": 116, "body_text": "What shoujo manga are these images from? What shoujo manga are these images from?\n\n\n\n\n\n"}
{"post_id": "20921", "novelty": false, "cluster_id": 201, "order": 117, "body_text": "What anime is this picture of two girls bickering on a roller coaster from? \nI want to know where this image is from. I think I know it, but can't remember because of all the other animes I've watched >.<\n"}
{"post_id": "21453", "novelty": false, "cluster_id": 201, "order": 118, "body_text": "What manga is this picture of (self-harm) cuts on both arms from? \nThe manga's name wasn't specified in the picture's tags on Tumblr.\n"}
{"post_id": "21599", "novelty": false, "cluster_id": 201, "order": 119, "body_text": "What is this manga where a girl is told that she's never been seen only as a friend? \nThis picture is really cute so I want to know what manga this is so please help me thank you for your consideration.\n"}
{"post_id": "26424", "novelty": false, "cluster_id": 201, "order": 120, "body_text": "This manga looks awesome but I have no idea what it is called can you please help he has an eye in his chest \nNot the top one I know that it's called \"till death do us part\" I'm talking about the bottom two pictures.\n"}
{"post_id": "28656", "novelty": false, "cluster_id": 201, "order": 121, "body_text": "What manga is this? \nso i found this pic on google images when i was searching for manga couples but the site where this manga leads to doesn't show the name or title of this manga. Please help me if you know the name of this manga.\n"}
{"post_id": "27798", "novelty": false, "cluster_id": 201, "order": 122, "body_text": "From what work are these pixiv images from? I don't exactly know what anime or manga it is or if it actually is an anime but im pretty sure it is. I have a few fan drawn images to identify them. \n\nsource: http://www.pixiv.net/member_illust.php?mode=medium&illust_id=46619500\n\nsource: http://www.pixiv.net/member_illust.php?mode=medium&illust_id=46113792\n"}
{"post_id": "19564", "novelty": false, "cluster_id": 201, "order": 123, "body_text": "Which anime is this cute girl from? Today I found this picture of a cute girl and I really want to know from which anime she is from.\n\nCould someone help me with this image?\n"}
{"post_id": "22251", "novelty": false, "cluster_id": 201, "order": 124, "body_text": "Who are the girls in this image? From Punch Line ep.7 6:35:\n\nThere are five girls here. Who are they?\n\nBlonde with the green dress.  \nBrunette with the blue dress. Meika?  \nRedhead with the purple dress. Mikatan, probably.  \nSlender brunette with the brown dress.  \nGreen haired in the lower right.  \n\n\nEDIT: The image is from Punch Line. Episode 7 at 6 minutes and 35 seconds. So remove the duplicate tagging. It is the characters depicted that need identification.\n"}
{"post_id": "7727", "novelty": false, "cluster_id": 201, "order": 125, "body_text": "what is this anime with gundam freak? I got this picture\n\nUsing Google reverse image I only got 18 result and all in Japanese. I don't understand anything\n"}
{"post_id": "14225", "novelty": false, "cluster_id": 201, "order": 126, "body_text": "what anime is this? a girl with black hair and black eyes and a pc \ni'd like to ask what anime is this?\n"}
{"post_id": "20881", "novelty": false, "cluster_id": 201, "order": 127, "body_text": "I have no idea if this picture with the word \"Lilito\" is a manga or anime or both \n\nCan someone help? I'm in love with this picture and wanna see if it's something I can watch or read.\n"}
{"post_id": "9240", "novelty": false, "cluster_id": 201, "order": 128, "body_text": "Where does this picture of a magical girl style series come from? Long story short, my friend linked me this picture so I could tell him what it is, but frankly I have no idea. I cant even tell him if its manga/anime or just random fan-art.\nSo if someone knows the name or anything, I would appreciate it.\n\n"}
{"post_id": "2922", "novelty": false, "cluster_id": 201, "order": 129, "body_text": "In what order should I watch the Ghost in the Shell series? The Ghost in the Shell series is comprised of several movies and animated TV series.\nTV series:\n\nGhost in the Shell: Stand Alone Complex\nGhost in the Shell: S.A.C. 2nd GIG\nGhost in the Shell: Arise\n\nMovies:\n\nGhost in the Shell\nGhost in the Shell 2: Innocence\nGhost in the Shell: S.A.C. 2nd GIG – The Laughing Man\nGhost in the Shell: S.A.C. 2nd GIG – Individual Eleven\nGhost in the Shell: Stand Alone Complex − Solid State Society\nGhost in the Shell: The New Movie \n\nFor someone completely new to the series, what order should these be watched in? (Are the movies even important to the animated series?)\n"}
{"post_id": "12879", "novelty": false, "cluster_id": 201, "order": 130, "body_text": "What anime is this gif of a sword-wielding girl from? I just found this gif and I wanted to know the anime from which it is from\n\nThank you in advance :)\n"}
{"post_id": "23951", "novelty": false, "cluster_id": 201, "order": 131, "body_text": "Identification Request does anyone know what anime this picture is from? \n\n"}
{"post_id": "6530", "novelty": false, "cluster_id": 201, "order": 132, "body_text": "What anime are these girls in winter-styled bikinis from? \nMy friend sent me this image and asked me what anime it was. I didn't know after hours of searching. I found this site so I was hoping someone could identify for me and her. \n"}
{"post_id": "18594", "novelty": false, "cluster_id": 201, "order": 133, "body_text": "What anime is this scene with the subtitle \"I don't want a threesome! We don't have time.\" from? \nHi. I was just passing by and I wanna ask, what anime is this from? D:\n"}
{"post_id": "26662", "novelty": false, "cluster_id": 201, "order": 134, "body_text": "Plz tell me which anime is this from Plz tell me which anime is this from the picture in the link\n\n"}
{"post_id": "14531", "novelty": false, "cluster_id": 201, "order": 135, "body_text": "What is the name of this manga with a beautiful girl? Today I found this little image on a community page! I'd like to read this manga but could not find it with reverse image search.\n\nHave somebody already read this manga?\n"}
{"post_id": "29157", "novelty": false, "cluster_id": 201, "order": 136, "body_text": "Title of the anime \nCan someone tell me what anime this is and what link i can watch it from. Thanks :D                                                      \n"}
{"post_id": "20587", "novelty": false, "cluster_id": 201, "order": 137, "body_text": "Which anime is this image of a woman tempting a man with her bosom from? I have an image, but I for the life of me cannot figure out the anime it's from. (It was from an old page on Facebook which I can no longer find, and none of my friends knows either)\n\n"}
{"post_id": "4236", "novelty": false, "cluster_id": 201, "order": 138, "body_text": "Which anime is this woobie taken from? I saw this image on TV tropes:\n\nWhich anime is it taken from?\n"}
{"post_id": "18504", "novelty": false, "cluster_id": 201, "order": 139, "body_text": "What Manga/Anime is this character with a tattoo on his chest from? \nThis photo was sent to me asking what Anime this is from, but I don't know. \nHonestly looks extremely familiar and maybe I'm just going braindead?\n"}
{"post_id": "28096", "novelty": false, "cluster_id": 201, "order": 140, "body_text": "What anime is this picture of girl on her bed from? I found this picture on a mix tape website, but I want to know what anime it is from so i can start watching it! It is a picture of a girl laying face down on her bed, and she looks like she might be sad. I thought that the poster could help me figure out what show it is from, but I don't recognize it. I tried to use reverse image searching sites, but had no luck.\n\n"}
{"post_id": "27124", "novelty": false, "cluster_id": 201, "order": 141, "body_text": "Can anyone identify the source manga? Can anyone identify the source manga?\n\n"}
{"post_id": "27127", "novelty": false, "cluster_id": 201, "order": 142, "body_text": "What is the name of the manga this picture is from? \nIt seems to be some sort of a fight scene. The girl seems to have the ability to control plants. I found it on an old forum but it didn't mention the name of the manga. I couldn't find the name of the manga by reverse image searching so any help will be appreciated.\n"}
{"post_id": "27126", "novelty": false, "cluster_id": 201, "order": 143, "body_text": "Do you know what manga this picture is from? \nFound this on a forum a while ago but it didn't have a name with it. I tried all the reverse image search engines but got no returns. Any help would be appreciated. \n"}
{"post_id": "24096", "novelty": false, "cluster_id": 201, "order": 144, "body_text": "what anime is this??? Thanks :) \nWhat anime is this picture? Please comment if you know.. Thank you ^_^\n"}
{"post_id": "19764", "novelty": false, "cluster_id": 201, "order": 145, "body_text": "What is the name of the manga in this picture of a white-haired boy wearing a mask showing his teeth? I found this picture and it looks really cool, but I couldn't figure out what manga it is... Hoping someone can help.\n\n"}
{"post_id": "22202", "novelty": false, "cluster_id": 201, "order": 146, "body_text": "What anime is this picture of a boy and his pet cat which turns into a catgirl? \nWhat anime is this picture from?\n"}
{"post_id": "28322", "novelty": false, "cluster_id": 201, "order": 147, "body_text": "What manga is this half picture from ? \nDue to some reasons I can't use   reverse image search \n"}
{"post_id": "7358", "novelty": false, "cluster_id": 201, "order": 148, "body_text": "Which visual novel is this nekomimi girl from? I have been scouring every nekomimi tag on vndb, but to no avail. Can anyone tell me which game this is?\n\n"}
{"post_id": "29552", "novelty": false, "cluster_id": 201, "order": 149, "body_text": "What anime is this from? I found it interesting \n\nI watch it from a compilation video but no one know what anime is this\n"}
{"post_id": "28175", "novelty": false, "cluster_id": 201, "order": 150, "body_text": "Hi, what picture is this manga from? Thanks what picture is this manga from? Thanks.\n\n"}
{"post_id": "29003", "novelty": false, "cluster_id": 201, "order": 151, "body_text": "From what anime does this girl jumping on someone comes from? \nI am curious to know the anime from which this gif is extracted.\n"}
{"post_id": "29556", "novelty": false, "cluster_id": 201, "order": 152, "body_text": "Can someone tell me the name of this anime? I tried and tried to find it out but I just couldn't ,if someone knows it please tell me\n\n"}
{"post_id": "29554", "novelty": false, "cluster_id": 201, "order": 153, "body_text": "What manga is this student saying she wants to leave from? \nCan   someone find out where she is from ?\n"}
{"post_id": "28572", "novelty": false, "cluster_id": 201, "order": 154, "body_text": "Who is this couple from the picture and which manga from? I did the Google reverse image but couldnt find it.\n"}
{"post_id": "27336", "novelty": false, "cluster_id": 201, "order": 155, "body_text": "What anime is this girl kneeling over someone from? I've done the reverse image search, and the name of the anime doesn't come up.\n\n"}
{"post_id": "29410", "novelty": false, "cluster_id": 201, "order": 156, "body_text": "What is the title of this anime \nCan someone tell me the title of this anime and maybe a link where I can watch it\n"}
{"post_id": "24425", "novelty": false, "cluster_id": 201, "order": 157, "body_text": "From which anime is this GIF? GIF\nI would really like to know from which anime is this GIF. I find it really funny and I would like to watch it :)\nThank you in advance! \nXander\n"}
{"post_id": "6493", "novelty": false, "cluster_id": 201, "order": 158, "body_text": "Black haired girl transforming to red haired girl with a teddy bear I am looking for an identification of a black haired girl transforming to red haired girl with a teddy bear.\n\nSeen in:\nhttps://www.youtube.com/watch?v=RXrYx83bqh4&t=32s\n"}
{"post_id": "20713", "novelty": false, "cluster_id": 201, "order": 159, "body_text": "What anime is this picture of eight guys from? \nI'm wondering if this is an anime or not. If it is an anime, would you please tell me the title?\n"}
{"post_id": "28681", "novelty": false, "cluster_id": 201, "order": 160, "body_text": "From what anime is this girl with eyes of two different colours? \nI found this screenshot on Instagram, and no one could tell me what anime this image comes from.\n"}
{"post_id": "20013", "novelty": false, "cluster_id": 201, "order": 161, "body_text": "Which anime is this gif of an enraged brown-haired boy punching a blonde-haired boy to a pulp from? I was browsing an app called iFunny, and I came across a .GIF that was from an anime. \nIf I remember correctly, it had a brown haired guy in it, standing next to an blonde haired person. The brown haired person then looked up with glowing red eyes with a very angry look on his face, and proceeded to start punching the other person. Some girls tried to stop the brown haired kid from beating the orange haired kid up, but he easily tossed them aside and continued pounding on him. After a couple of seconds, he stopped, and the blonde haired kid slumped down against a wall, covered in blood. The .GIF ended there and repeated back to the beginning of it. \nCan anyone help me identify this? \n\n"}
{"post_id": "29376", "novelty": false, "cluster_id": 201, "order": 162, "body_text": "Which manga is this conversation from? \nCan someone tell me which manga this is from ? \n"}
{"post_id": "26290", "novelty": false, "cluster_id": 201, "order": 163, "body_text": "Searching for anime with boy in half mask (image included) \nI've been searching for this anime for 3 months. Please help.\n"}
{"post_id": "13967", "novelty": false, "cluster_id": 201, "order": 164, "body_text": "Who is this guy with grey hair and white circle eyes? I have been image searching on google but the only thing that comes up is something about Robocraft.\nHere is the picture below:\n\nDoes anyone know what anime this picture is from?\n"}
{"post_id": "14206", "novelty": false, "cluster_id": 201, "order": 165, "body_text": "Anime with a girl in a red-white jacket saying she \"can't take it anymore\"? I saw this random anime somewhere.\n\nHowever, I've tried searching for it with no luck\nI also tried Reverse Image Search.\nCan anyone help me identify this one? Thanks in advance. :) \n"}
{"post_id": "20295", "novelty": false, "cluster_id": 201, "order": 166, "body_text": "Help me find this yaoi pls \nI seriously want to find/read this yaoi.\nClick image for larger image \n"}
{"post_id": "28270", "novelty": false, "cluster_id": 201, "order": 167, "body_text": "From what manga does this guy holding a girl comes from? As I didn't find any source using the reverse image searching, do you know which manga is this image from?\n\n"}
{"post_id": "25849", "novelty": false, "cluster_id": 201, "order": 168, "body_text": "Where is this from? [Gif included] I just stumbled upon this and I'm craving to know where is it from and immediately watch it:\n\nThanks.\n"}
{"post_id": "26112", "novelty": false, "cluster_id": 201, "order": 169, "body_text": "Which anime is this? Which anime is in the below mentioned image ?\n\n"}
{"post_id": "20490", "novelty": false, "cluster_id": 201, "order": 170, "body_text": "What manga is this image from? \nI just want to know what manga this picture is from. I found it on someone's profile picture on Facebook. Just curious. Thanks!\n"}
{"post_id": "28074", "novelty": false, "cluster_id": 201, "order": 171, "body_text": "Where does the character from this poster come from? My fiance picked this poster up today because it looked cute, we aren't sure were this is from and wanted to know if anyone could tell us where this is from.\n\n"}
{"post_id": "29170", "novelty": false, "cluster_id": 201, "order": 172, "body_text": "What is the name of this Manga? \nI don't know the namw of this manga and i have been looking everywhere for it. What is it called and who is the author? Is it still ongoing? \n"}
{"post_id": "20141", "novelty": false, "cluster_id": 201, "order": 173, "body_text": "What manga is this picture of a girl hugging a guy's arm on a stairway from? \nI am looking for a manga I came across on a website. The poster left no tags or clues of where the image came from. I tried typing the words on the picture in the search engine, describing the picture and using the name the picture was saved as, but I still got nothing.\n"}
{"post_id": "14003", "novelty": false, "cluster_id": 201, "order": 174, "body_text": "Who are the sibling groups in this picture? The picture:\n\nIt looks like fanart, but I'm pretty sure the characters are all from something and not original characters, since I recognize Lelouch and Nunnally Lamperouge on the far left, and the Araragi siblings Karen-chan, Koyomi, and Tsukihi-chan at the center. Who are the other characters? Answers identifying any or all are appreciated.\n"}
{"post_id": "18713", "novelty": false, "cluster_id": 201, "order": 175, "body_text": "Does anyone know which manga is this from? Does anyone know which manga is this from?\nPotentially NSFW image:\n\n\n\n"}
{"post_id": "27542", "novelty": false, "cluster_id": 201, "order": 176, "body_text": "Anime of a boy with purple and red hair in this picture https://i.ytimg.com/vi_webp/0iJE2ZaZjtw/mqdefault.webp\nCan anyone identify what is this anime?\n"}
{"post_id": "23580", "novelty": false, "cluster_id": 201, "order": 177, "body_text": "Which series is this girl getting robbed and tied up from? I have seen this picture online quite a lot lately, and I have been wondering which series it comes from. I tried searching but did not find any results.\n\n"}
{"post_id": "28318", "novelty": false, "cluster_id": 201, "order": 178, "body_text": "From which manga is this ghost like girl from ? \nDoes anyone know which manga this ghost girl is from ? Due to some reasons I can't use the reverse google image search so please help\n"}
{"post_id": "22746", "novelty": false, "cluster_id": 201, "order": 179, "body_text": "What anime is this called..? \nFound it on the internet but cant find what anime or manga this is from.\n"}
{"post_id": "18825", "novelty": false, "cluster_id": 201, "order": 180, "body_text": "Anybody that knows this manhwa? today I found this on a tumblr account that I follow and I just wanted to know if anybody knew the name of the manhwa:\n\n\nThanks for the help you always give me :)\n"}
{"post_id": "23908", "novelty": false, "cluster_id": 201, "order": 181, "body_text": "what anime is this picture of them kissing from what anime is this picture of them kissing from\n\n"}
{"post_id": "27463", "novelty": false, "cluster_id": 201, "order": 182, "body_text": "What manga is this guy being embraced by his teacher from? \nI can't identify this manga, or even find out if it really exists.\nI've searched for it on Google and only came up with the name of the Tumblr user who posted it, but still no name. Can someone please help me find out if this manga exists, and if so, what the title is?\n"}
{"post_id": "28206", "novelty": false, "cluster_id": 201, "order": 183, "body_text": "what is this manga from? I cant find where its from? It probably isn't an manga nor an anime but im anxious to find out :3\n"}
{"post_id": "27357", "novelty": false, "cluster_id": 201, "order": 184, "body_text": "Who is this character and which anime is it from? I found a photo and wondering who is this character from anime \n"}
{"post_id": "5275", "novelty": true, "cluster_id": 201, "order": 185, "body_text": "Who is this grey-haired girl with a blue gem necklace and white flower? She looks like she wears blue flowery hair bow and dress. She is also carrying a lily of somewhat. Who is she? In this picture, she has her eyes closed while holding the lily in front of her feathery winged dress. She is a white flower lady and cartoon character.\n\n"}
{"post_id": "6857", "novelty": true, "cluster_id": 201, "order": 186, "body_text": "Who is this female character? \nCan anyone identify this girl for me? Sorry, these small icons are the only images I can provide. Please and thank!\n"}
{"post_id": "6493", "novelty": true, "cluster_id": 201, "order": 187, "body_text": "Black haired girl transforming to red haired girl with a teddy bear I am looking for an identification of a black haired girl transforming to red haired girl with a teddy bear.\n\nSeen in:\nhttps://www.youtube.com/watch?v=RXrYx83bqh4&t=32s\n"}
{"post_id": "3617", "novelty": true, "cluster_id": 201, "order": 188, "body_text": "From what series is this odd lolicon poster? I recently saw this image of an approximately high-school-aged boy with a young girl under his arm, pointing up at the stars with the text \"lolicons are diseased!\"\n\n(Note: No offense intended from the image.)\nAre the characters found in this image from an actual anime or manga, or are they just made up for this bit of art? If it's the former, what series are they from?\n"}
{"post_id": "13867", "novelty": true, "cluster_id": 201, "order": 189, "body_text": "Who is this girl with red hair in a sheep outfit? \nJust wondering because oppai....anyone know who this character is? Thanks for answering!\n"}
{"post_id": "6502", "novelty": true, "cluster_id": 201, "order": 190, "body_text": "Can anyone tell me what anime this nekomimi girl is from? \nDoes anyone know who the girl with the cat ears is or what anime she is from?\nThe one between Shana and Naruto.\nThanks\n"}
{"post_id": "14003", "novelty": true, "cluster_id": 201, "order": 191, "body_text": "Who are the sibling groups in this picture? The picture:\n\nIt looks like fanart, but I'm pretty sure the characters are all from something and not original characters, since I recognize Lelouch and Nunnally Lamperouge on the far left, and the Araragi siblings Karen-chan, Koyomi, and Tsukihi-chan at the center. Who are the other characters? Answers identifying any or all are appreciated.\n"}
{"post_id": "29856", "novelty": true, "cluster_id": 201, "order": 192, "body_text": "What's the name of the manga from the following picture? searched  a lot for the name but can't seem to find it and i only have this picture. Thanks for your help\n\n"}
{"post_id": "11162", "novelty": true, "cluster_id": 201, "order": 193, "body_text": "What anime is this image of a girl fighting a dragon from? \nI found this image online, and thought \"Wow, badassery right here.\" and I want to watch whatever anime they are from. thanks\n"}
{"post_id": "6676", "novelty": true, "cluster_id": 201, "order": 194, "body_text": "Where does this picture come from? \nI think this is fan art of an anime, but I am not sure which. Can someone help me find where this comes from?\n"}
{"post_id": "21618", "novelty": true, "cluster_id": 201, "order": 195, "body_text": "Where is this picture from? How do I use Reverse Image Search to find the source of an anime/manga image? So I see an image from what I believe is from either an anime or manga. What are some ways that I can go about finding what series it's from?\nTry these options:\n\nGoogle reverse image search (browser built-in support and plugins)\nOther reverse image search engines: TinEye, SauceNao, iqdb\nTechnique: Cropping the image\nAnimated GIF: Picking the right frame\n\n\nNote: If you followed these methods and could not identify your image, you're welcome to ask a question tagged identification-request. Be sure to mention that you followed these steps and what results (if any) you saw. Reading these guidelines can prevent getting your question closed for lack of details.\n\n\n\nProtip: If you are using Google Image Search in a non-English language, change your language to English for better, more accurate results.\n\n"}
{"post_id": "19865", "novelty": true, "cluster_id": 201, "order": 196, "body_text": "What anime is this short clip of two girls jumping over balcony from? I stumbled upon this clip, but I had no idea of how to find what anime it's from\nHere is a screenshot from the clip:\n\n"}
