{"post_id": "2815", "novelty": true, "cluster_id": 23, "order": 0, "body_text": "Why does Hashirama Senju possess such huge and terrifying chakra? In the past three Naruto manga chapters (chapters 621~623), the story goes like this: child days of both Hashirama and Madara, and he (Hashirama) is just like every others in Naruto: a normal human being. But when Orochimaru revived all four Hokage in front of Sasuke, Hashirama raises his chakra level to threaten Tobirama, as it would crack all the walls nearby or maybe the entire basement (chapter 620). How could have Hashirama acquired this kind of power (chakra)?\n"}
{"post_id": "2088", "novelty": true, "cluster_id": 23, "order": 1, "body_text": "What does it mean to have \"powerful\" chakra? Tobi once stated that he (referring to Madara) was born with an especially strong chakra.\nThat is the only time we ever hear about the \"power\" of chakra! We know that one can have a lot of chakra, and we know he can learn to utilize his chakra efficiently. But what does \"strong\" chakra mean?\nDoes it make his techniques more powerful than other, less power chakra users? Does it mean that his YinYang balance is naturally stronger? Does it make him live longer?\n"}
{"post_id": "4446", "novelty": true, "cluster_id": 23, "order": 2, "body_text": "How can Obito combine 4 different nature transformations? How can Obito combine 4 different nature transformations, if he barely managed to control the Juubi inside him?\nUsing advanced techniques and nature transformations needs some focus on chakra manipulation, so how is he able to do this?\n\nObito using the 4 different nature transformations\n\nObito barely managing to control the Juubi\n"}
{"post_id": "2040", "novelty": true, "cluster_id": 23, "order": 3, "body_text": "How can one achieve incredible chakra such as that of the Third Raikage or Kisame? Kisame was known as tailed beast without tails. This is because he had an incredible amount of chakra, so much that Samehada had an affection toward him.\nA's father, the Third Raikage, could even combat the Hachibi all alone!\nWhat is the source of such an amount of chakra? Is it hereditary? Or won by practice? Or just by birth?\nMight Guy, the Green Beast of Konoha, opened the 8 Gates to surpass Kisame, but doing this takes a risk on his life. So it is certainly not the manipulation of chakra points, since neither the Third Raikage nor Kisame seem to be risking their lives to get such an amount of chakra.\n"}
{"post_id": "2771", "novelty": true, "cluster_id": 23, "order": 4, "body_text": "Is the nature of chakra hereditary? It's been observed that the nature of the chakra a person possesses is determined by the village they are from.\nFor example, people from Iwagakure (Village Hidden in the Rocks) use earth release techniques, while people from Kirigakure (Village Hidden in the Mist) possess water-type chakra.\nThere seem to be exceptions, though.\nFor example, let's consider Konoha : Naruto possesses wind-type chakra while Kakashi and Sasuke possess lightning. Sasuke also possesses fire.\nIs it hereditary, or is there something else that determines it? Or is it random?\nThe 5th Mizukage possesses 3 types of chakra elements: Earth, Fire and Water. If my supposition is correct, how she could achieve this?\n"}
{"post_id": "304", "novelty": true, "cluster_id": 23, "order": 5, "body_text": "Is it possible to combine all five chakra elements? The title says it all... but I'll elaborate:\n\nInitially we see techniques derived from a single chakra element (Katon, Doton, Suiton, Fuuton and Raiton). These are the most common, since usually a ninja can master only one chakra nature (since normally ninjas tend to have an affiliation with only one chakra nature)  \nLater we discover these can be combined in a number of ways, creating new elements (Mokuton=Doton+Suiton, Ranton=Raiton+Suiton, Youton=Katon+Doton, among several others). From what I understand, these are usually transmitted as a Kekkei Genkai. But I believe they can also be created by the combinations of the elements, by ninja who didn't inherit it from other generations (correct me if I'm wrong). These are not uncommon, but less frequent than the ones above (there are ninja who can master and possess affiliation to more than one chakra nature: Sasuke comes to mind, since he can master both Katon and Raiton. Katon is his clan's natural affiliation, and he mastered Raiton too. However, I don't remember if he has ever combined the both of them)  \nEven later, we find about combinations of even more elements by ninja who can master several elements, such as Muu (Nidaime Tsuchikage) and Oonoki (Sandaime Tsuchikage), who can combine Katon, Doton and Fuuton, to create Jinton. These are called Kekkei Touta. I don't know if they can also be transmitted through Kekkei Genkai, or if they can only be taught. They are even rarer than the ones above, since ninja can rarely master or be naturally affiliated to more than two chakra natures (Terumii Mei the Godaime Mizukage, can also master Doton, Katon and Suiton, but I don't think she ever combines more than two at each time). \n\nMy questions are:\n\nAre combinations of chakra natures taught or only transmitted by Kekkei Genkai (or both)? \nAre combinations of more than three chakra natures possible? \nAnd the above question created a new one for me: Can a ninja master more than three chakra natures? (I think Kakashi does, but I am not quite sure about this)\n\n"}
{"post_id": "222", "novelty": true, "cluster_id": 23, "order": 6, "body_text": "What was Kakuzu's original chakra nature element? Kakuzu, an Akatsuki member who works with Hidan as a pair, has a unique ability. His body is full of black strings that he can use to steal the organs of his opponents.\nHe uses this ability in order to\n\nsteal his enemies' hearts, which gives him two important advantages: \n1) Provides a type of \"immortality\". He can have a maximum of 4 hearts but this means he needs to be killed 4 times without him replacing the lost hearts in the mean time.  \n2) Allows him to use the chakra nature elements of the stolen hearts. For example, if he steals a heart from someone who possessed the wind chakra nature element, he'd be able to use that. \n\nIs it known what Kakuzu's own original chakra nature element was? \n"}
