{"post_id": "15335", "novelty": true, "cluster_id": 235, "order": 0, "body_text": "How long was Saber waiting for Shirou after she died? Regarding the question that was asked before:\nDo Emiya Shirou and Arturia ever meet again after Fate/stay night? \n\nIn the Visual Novel of Fate Stay/Night Realta Nua once you have seen all 5 endings a new ending appears accessible from the title screen call -Last Episode-, this is in 2 parts, a Monologue of the Fate Route and a second part where Arturia is hearing from Merlin about a miracle achievable by 2 people, one who \"wait endlessly\" and one who \"pursue endlessly\", eventfully the pursuer will stop when they reach the waiter.\nWhat Merlin is referring to is Arturia waiting and Shirou pursueing, eventually Shirou reaches Avalon where Arturia is sleeping and the 2 finally reunite, it's not entirely sure how long it took Shirou to reach Avalon however considering that Avalon transcends all magic including the 5 Magics it must have taken an eternity for Shirou to reach.\n\nObviously if it took them an eternity to meet, it's common sense that it never happened.  \nSo my theory is that there are two options for this occasion:  \n\nThe author's definition of eternity is something different from what is known to the public.\nThat it was some sort of an inside joke to troll the audience who desperately want to see them reunite.\n\nIs there any official statement about how long eternity is according to the Fate Stay/Night series?\nAre there even any clues on which to base some sort of speculation on the matter?\nOr maybe the light novel perhaps mentions something about it.  \nI really want to know how much Saber had to suffer in order to finally meet with Shirou.\n(IMO after all she's been through, she has suffered quite enough already). \n"}
{"post_id": "7297", "novelty": true, "cluster_id": 235, "order": 1, "body_text": "Do Emiya Shirou and Arturia ever meet again after Fate/stay night? Do Emiya Shirou and Arturia ever meet again after Fate/stay night, \nspoiler next\n\n I'd like to know because it's pretty sad that she says that she loves him then dies.\n\nThanks!\n"}
