{"post_id": "8123", "novelty": true, "cluster_id": 251, "order": 0, "body_text": "How do they imbue their weapons with Haki? In the One Piece world, you can give a devil fruit power to weapons (things) by destroying it with that weapon. It seems one can also give haki to weapon, how can they do that? Kuja tribe member Marguerite is the first to be seen doing that. (Chapter 516)\n\n"}
{"post_id": "9801", "novelty": true, "cluster_id": 251, "order": 1, "body_text": "Is Shanks Haki different from other users? What is Shanks' power? If \"Haoshoku Haki\" then is it different from other users? \nThis question came to my mind after rewatching all episodes of One Piece. \nShank's Haki seemed to be different from that of others. When Shanks was going to meet White Beard before the Ace's death, he cracked the wood even though he wasn't using Haki. \nLike Luffy, he too needs to use his Haki to effect someone but Shanks didn't use it and  yet everybody on board the ship was affected.\n"}
{"post_id": "8123", "novelty": true, "cluster_id": 251, "order": 2, "body_text": "How do they imbue their weapons with Haki? In the One Piece world, you can give a devil fruit power to weapons (things) by destroying it with that weapon. It seems one can also give haki to weapon, how can they do that? Kuja tribe member Marguerite is the first to be seen doing that. (Chapter 516)\n\n"}
{"post_id": "6394", "novelty": true, "cluster_id": 251, "order": 3, "body_text": "Are the clothes of Devil Fruit users made of a special material? We have Akainu, who is a Logia user with magma capabilities, and Luffy, who can stretch with the Gomu Gomu no Mi. Are their clothes made up of some special material that doesn't burn or tear apart? \n"}
{"post_id": "18976", "novelty": true, "cluster_id": 251, "order": 4, "body_text": "How does Haki work? Haki seems to not only affect the Devil Fruit user, but also all the other weak enemies. What is the mystery behind it? It seems like willpower but there are so many different types. I have read through One Piece Wiki but I still haven't got a clear picture. \n\nHaki is a power that lies dormant in all the world's creatures... \"Presence\", \"fighting spirit\" and \"intimidation\"... It is not different from the things that humans can naturally sense such as these... 'The act of not doubting'. That is strength!\n— Silvers Rayleigh explaining Haki to Luffy at the start of his training\n\n"}
