{"post_id": "5003", "novelty": true, "cluster_id": 253, "order": 0, "body_text": "Is the age restriction lower in japan than in western countries? For instance, Darker than Black is R - 17+ (violence & profanity) in the West, but is it higher or lower in Japan?\n"}
{"post_id": "4175", "novelty": true, "cluster_id": 253, "order": 1, "body_text": "How much does a typical anime episode or series cost to make? While it's pretty easy to find what is the budget for most anime feature films like those from Studio Ghibli, the average cost for making an anime series, much less an episode, is not readily available.\nHow much does an anime episode or series cost to make these days? Where does the money come from?\nWhat is the breakdown of all the cost (to what part [e.g., script, sounds, edition, etc.] go how much of the budget)?\n"}
{"post_id": "15452", "novelty": true, "cluster_id": 253, "order": 2, "body_text": "Why is the childhood friend trope commonly seen in anime? I've noticed that most anime, especially in genres like slice of life and romantic comedies,  there is at least one character that plays  the role of the childhood friend (osananajimi). This is often coupled with the unrequited love, girl next door, or other related tropes.\nOf course, childhood friends are in every culture out there, but I'm curious if Japan has a special reason for this particular occurrence in anime shows. Also, aside from gender inclination towards the shounen genre, why is it that most osananajimi are girls whereas in real life, our childhood friends are typically of the same sex? Is this occurence more prevalent in Japan than in other cultures?\nAnd feel free to edit (especially the title) and/or comment if this question is off-topic.\n"}
{"post_id": "20185", "novelty": true, "cluster_id": 253, "order": 3, "body_text": "What are the anime censorship laws in the United States? I have a similar question to ask. What are the anime censorship laws in the United States? There appears to be major culture difference between United States and Japan and I am not sure if that implies a difference between their respective anime censorship laws.\n"}
{"post_id": "4940", "novelty": true, "cluster_id": 253, "order": 4, "body_text": "What are the anime censorship laws in Japan? I know that there are censorship laws in Japan (which is why you end up with things like tentacles instead of genitalia). What are the laws, and are they the same as the laws for live-action television programming? \n"}
{"post_id": "16885", "novelty": true, "cluster_id": 253, "order": 5, "body_text": "Who applies censorship on an ecchi anime? In my few years of watching anime, I have noticed varied amounts of ecchi-ness portrayed and the corresponding censorship it generates. I mentioned \"varied\" because I have noted differences in censorship techniques (black/white bars, excessive lighting) and the amount dealt to the scene. For instance most non-ecchi anime have the breasts censored, some only have the nipples removed, and a quite a few bare them completely. The quite few who go the extremes may even be classified as hentai already.\nPoints in case (I wanted to include pics but then decided against it):\n\nPartial covers: Gokukoku no Brynhildr, Infinite Stratos, Trinity Seven\nBared completely: HighSchool DxD, Yosuga no Sora, Elfen Lied\n\nMy question: How does Japan implement various levels of content ratings (G, PG, R18+)?  Is it the production studio who applies these varying amount of censorship or is there a committee assigned that does it? Does the same apply for violence/gore censorship?\n"}
{"post_id": "4013", "novelty": true, "cluster_id": 253, "order": 6, "body_text": "Why does anime usually air at night in Japan? Many anime available are broadcasted very late in Japan. Few examples:\n\nPhotokano, 1:58 AM\nHayate no Gotoku! Cuties, 1:35 AM\nChihayafuru 2, 1:53 AM\n\nWhy are anime often aired at night in Japan even though they get better timeslots when exported to other countries? When did TV stations start to broadcast anime late at night, and is there a specific reason behind this?\n"}
{"post_id": "29441", "novelty": true, "cluster_id": 253, "order": 7, "body_text": "Does making a TV anime series cost less than making a typical TV series? According to this post, 10 million yen per episode is the minimum price for making an anime. I am wondering how this price compares to making a typical TV series that film human actor?\nI guess if the story includes lots of special effects (story like Harry Potter which needs special effect for magic, or story like Star Wars where most background needs CG), it doesn't cost much when making anime as those are still drawings after all. It may cost a bit more if there are battle scenes, but compared to filming using human actor, anime should be a lot cheaper to make?\n"}
{"post_id": "5092", "novelty": true, "cluster_id": 253, "order": 8, "body_text": "Why are there sometimes darkened scenes in new anime? In the first Shingeki no Kyojin opening, I've seen some scenes with lower contrast or brightness, something like this:\n\nAnd later, in the same sequence, a scene appears without that contrast change:\n\nI've seen this kind of contrast change in the HxH remake as well, and the first thing that comes to my mind is that legendary Pokemon episode where a lot of kids suffered of photosensitive epilepsy attacks in Japan thanks to Pikachu and Co.\nDoes it has some relationship with that or there is another reason? Maybe a new law in Japan related to these flashy images on TV?\nIt seems this change appears only in new anime (I don't remember seeing something like this before last year). Any clue around that time?\n===UPDATED===\nIt's not just in the opening; here are more examples:\nOne of many scenes where the image is normal:\n\nThen comes the darker scenes. Maybe it cannot be appreciated in the snapshots, but all are a full sequence of images appearing quickly with a bright background:\n\n\n\nAnd then it returns to normal:\n\nThis is from the last HxH episode. At first, the image looks fine:\n\nThen comes an attack and the image looks darker. Maybe the effect is not so intense as in Shingeki no Kyojin, but it is still there. Look, all these bright flashes coming from the hits seem not as bright as they should be:\n\n\n\nAnd then the image looks normal again - compare the smoke color before and after:\n\nAs @JonLin notes, maybe it could be some kind of TV censorship, despite that there's nothing to censor besides all these flashy lights. Is it just me being paranoid or is there something more behind all this?\n==UPDATE 2==\nI've found a Blu-ray rip of the Shingeki no Kyojin opening (no subtitles, no credits) and I took some shots of the same frames that I already put. To the left, the TV version and to the right, the BDRip version (click for more detail):\n\n\n\n\nSo it is not an effect to make things more dramatic, but rather an effect included only on TV. I suppose the same applies to the other shots (at least in SnK).  \nSo my question comes again, why, lately, are there some anime with darkened scenes? My conspiracy theory is that it is related to those bright changes and possible photosensitive attacks. If that's true, why is this being applied lately? And why doesn't it appear on DVD/BD?\nIf not, what else it could be?\n"}
{"post_id": "28259", "novelty": true, "cluster_id": 253, "order": 9, "body_text": "Why are anime girls drawn without pubic hair? Why don't they draw hair down there or anywhere apart from FEMALE character's heads in anime? \nI heard it was illegal from my friend. Were they making it up?\n"}
