{"post_id": "20600", "novelty": true, "cluster_id": 309, "order": 0, "body_text": "Which manga is it where a boy turns into a dragon-like creature? It's a Shounen-ai/yaoi manga where a scientist with her daughter found a boy on an island who can turn into a dragon-like creature. There is an evil scientist group who then exploide the whole island and captures the boy. Then they try to make him fight against their kind and he also meets a man who is an assassin or soldier. This man is the only one who treats the boy as a person and so he gains his trust. In the end they fight together against the monsters...\nSo which manga is it, any idea?\n"}
{"post_id": "24379", "novelty": true, "cluster_id": 309, "order": 1, "body_text": "Help me find manga about boy who can transform into a dragon-like creature Manga is  about boy who lived his life on an island with his father and sister. He can change to creature smillar to dragon ( archa type or smomething like that). When he was a kid he was at a laboratory but than his father ran away with him. His father was also a scientist. \nThe main character is a child who was born as laboratory experiment(I think). His father wanted him to live his all his life on the island but his sister wanted to run away with him. \nIn the manga there are monsters and people who kill them. One of the men who kills the monsters loses his leg in some incident and he isn't cable of doing his job alone. He stil wants to kill monster alone but his boss doesn't let him. At the same time they discover where is our main character is living. They were searching for him because he is dangerous.\nThe man that lost his leg was told to take the main character and make him his partner in his job.(main character is a child though)The man comes to the island and he destroys the house where the main character lives and kills the boys father and sister(main character was not present at the time) and then he takes the main character with him. As time goes along they start to like each other and fighting and thing like that.\nI like this manga but don't remember it's name. If anyone knows I would be very happy. And sorry if there are any flaws or things that I wrote wrong because I am currently learning english right now. \n"}
{"post_id": "7837", "novelty": true, "cluster_id": 309, "order": 2, "body_text": "Is the story of Momonosuke, the boy who transformed into a dragon, based on any folklore in real life? During the Punk Hazard arc, the boy Momonosuke transformed into a dragon. The story of a boy who turned into a dragon sounds really familiar to me for some reason. I believe I might have heard it somewhere before as some sort of tale, or maybe even as a part of some myth. I have been searching quite a bit to find something similar, but I couldn't find anything. \nSo is the story of Momonosuke, the boy who transformed into a dragon, based on anything?\n"}
