{"post_id": "21687", "novelty": true, "cluster_id": 327, "order": 0, "body_text": "Will a person die when their name is written in the situation of death? The answer by Imprfectluck at this question made me wonder what would happen to people whose name was written down in the details of another persons death. For example: John Doe dies after his date with Jane Doe. The foremost basic rule of the Death Note states that The human whose name is written in this note shall die. So will Jane Doe die?\nWe additionally have rule LIV that states that if you write the cause and details of death on a different page, you need to be thinking of the original victim and would not be able to think both of John and Jane at the same time. This would indicate that you have to choose what will happen. Either you think of John and the details happen, either you think of Jane and she dies. Does a similar rule exist when writing on the same page? Or is writing someone's name in the details of another's death just an exception to that first rule?\n\nIn order to make the Death Note take effect, the victim's name must be written on the same page, but the cause of death and situation around the death can be described in other pages of Death Note. This will work as long as the person that writes in the Death Note keeps the specific victims name in mind when writing the cause and situation of death. \n\n"}
{"post_id": "21659", "novelty": true, "cluster_id": 327, "order": 1, "body_text": "How far can you manipulate someone with a Death Note? We know that if you kill a person via a disease, the Death Note isn't limited to the 23 day rule. Now those who have watched death note know, you can manipulate a person to an extent. So my question is, could I write something like this?\n\nJohn Doe, Diabetes. Obeys every command from the person he knows as J, till he dies. \n\nCould this work?\n"}
{"post_id": "23278", "novelty": true, "cluster_id": 327, "order": 2, "body_text": "Can you manipulate a person using an alias with the death note? So. Let's say John has a death note. Now there's a killer on the run, and John doesn't know his name and face. Now he writes the name of a criminal in his death note, to indirectly catch the killer. He writes: \nBob Zorto gets stabbed to death, at 12:30, by the serial killer, who uses the alias ''Shadow Killer''. \nCould that actually work?\n"}
{"post_id": "22222", "novelty": true, "cluster_id": 327, "order": 3, "body_text": "If a Death Note user specifies, along with the actual target, the name of a person whose face the user doesn't know, will that person live? It has been confirmed by L that if a person's name is written in the Death Note, and they are written to die in a form that specifies another person's name, (like \"L Lawliet will die after he deletes all his evidence on Light Yagi and goes to Misa Amani's apartment\") then all of them would die of a heart attack.\nThis is due to Rule XI\n\n\n[...] once the victim's name has been written, the individual's death can never be avoided.\n\n\nThe rule above may appear to trump Rule X\n\n\nWhether the cause of the individual's death is either a suicide or accident, if the death leads to the death of more than the intended, the person will simply die of a heart attack. [...]\n\n\nHowever, it does not. \"The victim\" is automatically anyone whose name is written in the Death Note.\nSuppose somebody uses a Death Note to kill someone and specifies another person's name in the description. Will that person — who is specified, but not intended to be killed — live, if the Death Note user does not know their face?\n"}
