{"post_id": "541", "novelty": true, "cluster_id": 35, "order": 0, "body_text": "Who is Kenshin based on? I've been told that Kenshin, at least partially, is based on a real life assassin. Who was he based on, and what pieces of his story are inspired by this person?\n"}
{"post_id": "3470", "novelty": true, "cluster_id": 35, "order": 1, "body_text": "Is Roronoa Zoro based on Rurouni Kenshin? There are several similarities between the two characters and also the characters they interact with.\n\nThey are both extremely skilled swordsmen.\nTheir names/titles are slightly similar and hint at being swordsmen. I'm not entirely sure about Roronoa but Kenshin's name was derived from some samurai novel. Also, vaguely note how execution is a main topic in and is constantly mentioned in One Piece and the character Kenshin was based on a samurai who was executed.\nKenshin was released in 1996 and One Piece came later in 1999.\n\nFrom ANN's plot summary of Rurouni Kenshin\n\nHimura Kenshin is a vagabond with a dark past and sunny disposition.\n  Not a ronin but a rurouni, he was never a samurai, but an assassin\n  of utmost skill in the Meiji restoration, who in the turning point\n  of the war simply walked away. His travels lead him to Tokyo in the\n  11th year of the Meiji era, where he befriends a female Kendo master,\n  a former thief, a brawler and a doctor all with their own\n  secrets. Together they fight off the enemies surfacing from the dark\n  past that Kenshin cannot escape. (Seems familiar with a certain\n  character's merry band of men?)\n\nFrom One Piece plot summary:\n\n... Along his ways, with luck and determination, he finds himself many\n  members who are devoted but to different causes. (Sounds familiar with a certain wanderer?)\n\nSo I would like to ask, is there any source that confirms whether the character Roronoa Zoro from One Piece is related in any way to Kenshin, or whether One Piece is somewhat influenced by Kenshin?\n"}
{"post_id": "19525", "novelty": true, "cluster_id": 35, "order": 2, "body_text": "Are guns in Kenshin historically accurate? I noticed:\n\nPrivate citizens with small pistols\nPrivate citizens with hand-cranked machine guns\nSoldiers of the old order with guns killing Sano's friends\nSoldiers of the new order storming Yutaro's mansion after the rebels camped in it\nRevolutionary soldiers practising stabbing motions with special sticks, while the teenage Kenshin practises swordsmanship in Trust and Betrayal\n\nSeems like the opposing factions could acquire guns in the Kenshin universe; it seemed to come from totally unregulated trade with foreigners, or the same army which is in #2, #3 and maybe #4. Is this historically accurate? Where did they all get their guns from?\n"}
{"post_id": "18547", "novelty": true, "cluster_id": 35, "order": 3, "body_text": "Why does Okita Souji did not appear? When Kenshin Himura arrives ten years ago after the Revolution, Basically, Okita Sōji  suffered from tuberculosis, as seen when he fought Kenshin in a flashback as well as in Trust and Betrayal, though he was still able to hold his own with the Battōsai. After that, Okita Sōji didn't appeared his character both Manga and Anime, is he already died before kenshin arrives in tokyo 10 years ago?\n\n"}
{"post_id": "22182", "novelty": true, "cluster_id": 35, "order": 4, "body_text": "Why isnt Mashima of Fairy Tail getting sued for plagarism? \n\nAs you see here he may plagiarized\n"}
{"post_id": "3656", "novelty": true, "cluster_id": 35, "order": 5, "body_text": "Are these One Piece characters based on western children's story characters? Some characters oddly remind me of certain stories I remember reading as a child. While the similarities can be considered purely coincidental, three times in one group raises some suspicion. So I ask, Is there any credible source that can state if any One Piece characters are derived or based on western ones?\nHere are some of the more closely related ones, the Straw Hat Pirates. \n\nChopper - Rudolph\nSimilarities: Reindeer, odd colored noses, shunned by their pack etc\n\n\nUsopp - Pinocchio\nSimilarities: Liars, Long noses\n\n\nFranky - Popeye\nSimilarities: Large forearms, relies on food for energy\n"}
{"post_id": "5237", "novelty": true, "cluster_id": 35, "order": 6, "body_text": "How closely does Rurouni Kenshin resemble real life? Rurouni Kenshin is an anime based on several historical facts. How accurately are the events in the series portrayed?\nI don't mean just historical events used in the series, such as the Shinsengumi, but how accurate is their real life portrayal of the art of swordsmanship. Is it really possible to obtain such power with dedication to daily training portrayed in the series?\n"}
