{"post_id": "22331", "novelty": true, "cluster_id": 350, "order": 0, "body_text": "Manga about boy who befriends a bunch of spirits and lives with them I read this manga when I was younger probably around age 11 so it's from around 2006-2007.  \nIt's about this young boy who becomes friends with a fox girl who cooks and cleans for him while living with him and he is human. She is supposed to be head of her clan but ran away to be with him even though he doesn't remember her. Eventually her friend a fellow fox spirit comes to take her back and challenges him which he accepts and then she moves in at the end.  \nThen he finds a mermaid who is also a spirit and moves in with all of them. \nIt's all I really remember but they are all chibi-like, because they are young.\nI remember buying this so I know the first novel is all white with the fox girl on the cover. The manga starts with an O I believe. \n"}
{"post_id": "22330", "novelty": true, "cluster_id": 350, "order": 1, "body_text": "Manga about a girl who goes to high school academy where wealth determines rank This is an older manga probably from around 07 or so.\nSo the plot is a girl who goes to a rich academy where your wealth determines your class like bronze or silver for example because you pay the tuition.\nThe girl, whose name escapes me, is in an adopted family who used to be rich but her original family sold her as she couldn't be a heir to the family. And her adopted family became more of a middle class family.\nThe main girl then has to pay her own tuition by working at the school which puts her in a low ranking class, but she does this by choice as she doesn't want to burden her adopted loving family. \nThere is one guy who she knows from childhood whom she adores but doesn't talk to. He is the only one in the richest class and he is distant to everyone.\nThere is an event to find him after a rumor of him being kidnapped so she goes searching and finds him sleeping in a tree in the schools garden center. \nEventually so he won't be bothered by anyone she becomes his pretend girlfriend but she is really his bodyguard but the guy isn't very nice to her.\nA little detail from way further in the manga is that the rich guy she loves isn't really the kid from her childhood but a fake/twin and the real one is sick but she doesn't know that for quite some time.\nI also remember one event that happened in the manga was a bunch of snakes got loose in the classroom the main girl was in and she caught them all by herself.\n"}
