{"post_id": "818", "novelty": true, "cluster_id": 354, "order": 0, "body_text": "Why are tentacles prevalent in anime? What is the reason/motivation for the prevalence of tentacles (possibly NSFW Wikipedia link) in anime (esp. hentai)?\nDid the anime subculture lead to it or does it stem from various aspects (possibly obscure) of Japanese art/culture?\n"}
{"post_id": "28469", "novelty": true, "cluster_id": 354, "order": 1, "body_text": "Where did the anime trope of Clothing Damage / Clothes being torn originate? I noticed that commonly now in anime that mostly female characters' clothes are being torn especially in fight scenes.\nI googled and found this to be called Clothing Damage\nand here are a list of examples from anime and manga from which I remember in High School DxD where the main protragonist Issei uses a technique called Dress Break to make his female enemies lose the will to fight. also in Dog Days and Freezing.\nEven JRPG games such as Doki Doki majo Shinpan and its sequel Doki Doki majo Shinpan Duo 2 has this.\nWho started this trope? Is it somewhat related to the origin of the tentacles trope in anime?\n"}
{"post_id": "22448", "novelty": true, "cluster_id": 354, "order": 2, "body_text": "Why is there so much reluctant sex in hentai? Multiple authors on the net have pointed out that a lot of the sex in hentai is, or appears to be, non-consensual.\nFrom here: http://magicalgirlproject.tumblr.com/post/91661244454/porno-month-reflections-why-so-much-rape-in\n\nI watched 20 hentai over the course of June/July, and looking back over them all, I’m left with one frustratingly unanswered question:\n[WHY IS THERE SO MUCH RAPE IN HENTAI?!?]\nWhy is rape so ubiquitous in hentai, why is it so inescapable, and why do so many of [these hentai that I've watched] focus exclusively on rape, with maybe one token consensual scene or sometimes none at all? It’d be like if 90% of the porn made in Belgium featured a buttplug scene — it’s weirdly specific and implies there’s some kind of cultural thing going on that I don’t yet understand.\n\nAlso, note this: http://www.hongfire.com/forum/showthread.php/431127-Why-does-hentai-have-so-much-violence-rape-towards-women. \nA commenter on the first article claims these 'rapes' are not as non-consensual as they seem:\n\nninfadelagua said: The average porn scene does seem rapey, even if it isn’t extreme (no hitting/scratching/biting) there seems to be a trend of women acting like they are resisting a lot and the men in the porno keep going and prey on them sexually (for hetero porn).\n\nThis implies that the 'victim' enjoys the rough sex and is 'resisting' as part of the 'game', sort of like how tsundere pretend to hate the person they actually love.\nWhich leads to Not If They Enjoyed It Rationalization: which says:\n\nTurns up often in Hentai, Boys Love Genre and Fanfiction. A lot. \n\nIn other words, the claim is that this, in some sense, doesn't count as rape because the purported victim enjoyed the experience.\n\nIs this actually what's going on? What is about Japanese culture that makes reluctant sex, which looks non-consensual to Western eyes, so common in hentai?\n"}
{"post_id": "2826", "novelty": true, "cluster_id": 354, "order": 3, "body_text": "How did the lolicon genre begin in anime/manga? I have always wondered how the Japanese got the idea of making animated productions including underage girls and the obsession with them. When did it start? Did the idea originate in Japan? Was it welcomed by the actual anime public?\n"}
{"post_id": "22964", "novelty": true, "cluster_id": 354, "order": 4, "body_text": "How did maids get popular in anime? Nowadays, maids are basically a moe stereotype. Otaku characters like Sakurasou no Petto na Kanojou's Ryuunosuke Akasaka, Lucky Star's Konata Izumi, and the Genshiken gang all love maids. Even K-On's Sawako Yamanaka, who isn't an otaku, puts the Light Music Club girls in maid outfits.\n\nFor a while, every single show that came out had a maid character, and several shows focused wholly or in part on maids, who may or may not also be androids (e.g. Hanaukyou Maid Tai, Hand Maid May, He is My Master, Koharu Biyori, Mahoromatic).\n\n\n\n\nIt was shockingly difficult to find a SFW picture from Koharu Biyori.\nEven shows that didn't have maids were affected: Digi Carat's Dejiko wore a costume which looked rather like a maid outfit, even though she was not a maid, but rather a clerk in an anime store (and actually an alien princess).\n\nMy perception was that this all started sometime around 2001, but I never saw how; it just seemed like one day I was surrounded by maids. (Not that it bothered me to be surrounded by maids.) How did this get started? Was there a single show or a few shows that started the maid craze? Or was it always there, and I just never noticed?\n"}
