{"post_id": "29864", "novelty": true, "cluster_id": 359, "order": 0, "body_text": "What about Sebastian's footprints? In the Phantomhive Manor Murders Arc, in the Manga, when the murders were happening, the characters who were investigating specifically mentioned that there were no footprints of anyone from outside who might have come from storm or might've been wet because of rains near the crime scenes.\nBut later\n\n when Sebastian was explaing that he was behind everything and that he switched corpse places from outside windows. Also he was shown wet a number of times. But no footprints were found? There were no footprints of the wet Sebastian? How? \n\nWas mentioning the \"no traces of footprint\" thing a mistake or was it ignored while sebastian was explaining what had actually happened?\n"}
{"post_id": "14433", "novelty": true, "cluster_id": 359, "order": 1, "body_text": "What do the sheep dolls represent in Mayo Chiki? \nAre these sheep dolls mascots, or do they represent something in the series? From the look of it, the blood (?) drooling from their mouths is like Sakamachi Kinjirou's nose bleed.\n"}
{"post_id": "22754", "novelty": true, "cluster_id": 359, "order": 2, "body_text": "Which is the series \"Lost Sheep\" of which plush doll Subaru Konoe is fan of? While searching for the answer of my question What does this Sheep represent in Mayo Chiki? I found out that the plush doll is from the the popular series \"Lost Sheep\" as stated in Wikipedia.\n\nshe enjoys instant noodles and is also a fan of the popular \"Lost Sheep\" series of plush dolls.\n\nWhen I searched for the series \"Lost Sheep\" I found about the Parable of the Lost Sheep. I tried to search using different Keyword but the result is same. It leads to the Parable of the Lost Sheep but in different site and presented in different manner.\nIs this the series that is stated in Wikipedia Or there is another series?\n"}
{"post_id": "5122", "novelty": true, "cluster_id": 359, "order": 3, "body_text": "How can Sebastian use \"I am a butler and a devil\" so casually?\" To my ears, the Japanese means:\n\nI am an akuma (demon), and a suji (butler).\n\nI guess it must have a pun meaning too. On one occasion, a bad guy cried out \"a-a-akuma?\", but that's the exception: everybody seems cool after hearing it. How can Sebastian say this so casually?\n"}
