{"post_id": "19134", "novelty": true, "cluster_id": 363, "order": 0, "body_text": "Do seniority relations among the fleet girls have any basis in properties of the actual ships? I notice, for example, that the Akagi and the Kaga both began construction in 1920, and they're portrayed as being more senior than the Fubuki, the Mutsuki, and the Yuudachi, all of which only began construction later on. \nIs this a reasonably consistent pattern among the other fleet girls? Or is it more or less arbitrary which girls are portrayed as being senior to others? (Or is it not arbitrary, but based on something else entirely, like ship class?)\n"}
{"post_id": "22842", "novelty": true, "cluster_id": 363, "order": 1, "body_text": "Which of the character quirks are based on real life, and which are purely fictional? In the Kancolle anime (and presumably the game as well), several characters have little quirks that make them more memorable and unique. Some of these appear to be based on the factual history of the warships they resemble, but others I'm not so sure on.\nFor example, the character Kongou often uses English phrases sporadically in her sentences, and in her introduction to Fubuki she mentions she was \"born in England [and] raised in Japan\". The real life battleship that was the first of the Kongou class was indeed originally constructed in England, which makes me believe that the quirks of this character are a reference to the history of the warship.\nSo, which of the following are jokes based on fact, and which are simply made up, or carried over from the browser game?\n\nYuudachi's 'Poi'\nShimakaze's speed\nShimakaze having 3 'Rensouhou-chans' rather than turrets attached to her body like the other girls\nSendai's love of night battles\nNaka's claim of being the one idol of the fleet\nAkagi's (and Yamato's) huge appetite\nFubuki being unable to sail properly at the anime's beginning\nAkatsuki's obsession with being 'ladylike', Ikazuchi's phrases about relying on her, Hibiki's 'khorosho', and Inazuma's 'nano desu'\nAtago's 'pan paka pa~n' (ta-da!)\nThe poor relationship between carrier groups 1 and 5\nAll sister ships have a close relationship, but is the especially close relationship between Kitakami and Ooichi significant?\nAshigara and the other Myoukou class ships taking up positions as teachers in the fleet\n\nI've tried to include links to evidence for most of them. If I've missed any major historical references made in the anime, please mention those in an answer as well.\n"}
