{"post_id": "23090", "novelty": true, "cluster_id": 393, "order": 0, "body_text": "What is this 80s film with a guy on a motorbike in an underground city? I had an animated film on VHS many many years ago (my best guess is mid 80s). My memory is also very vague so may not be entirely accurate although I still have quite a few vivid pictures in my head.\nI remember a guy on a motorbike in an abandoned underground city. I remember him riding up a stairwell in a multi-storey building. I think he is forced to flee the city suddenly as it starts to be destroyed by some big event - I think it's a giant robotic sphere.\nMy memory of the earlier part of the film is very sketchy in terms of detail - I remember a vast empty desert-like planet and I remember these gigantic destructive spherical ball things featuring quite prominently.\nMore generally, I remember there was not really a clear story and I didn't really know what going on (although I was very young). I don't remember any dialog in the film apart from a woman's voice at the very end of the film, maybe after the planet was destroyed.\nI am sorry I can't remember more. I would love to find the film. It clearly made a big impression on me many years ago! I have trawled wikipedia and exhaustively googled many of the things I can remember but so far I've haven't found it! Please help!\n"}
{"post_id": "21058", "novelty": true, "cluster_id": 393, "order": 1, "body_text": "Anime or video in the cyberpunk style about the guy on the motorcycle, which shoots down a giant spaceship from some secret weapon All I can remember is:\nA guy on a motorcycle or a similar transport goes through a long corridor inside the building. At the end of corridor, he enters a small room where he finds two corpses (or maybe skeletons) with pistols in hands (I think they killed each other). Near them, our guy finds some secret weapon (looks like rocket launcher). He comes outside and shoots down a giant spaceship that covers almost the entire sky.\n"}
