{"post_id": "3654", "novelty": true, "cluster_id": 40, "order": 0, "body_text": "Does every ninja become a jonin? In Naruto, a number of ninjas have become jonin, such as Neji and Kakashi. Does every ninja who becomes a chunin by definition become a jonin if they live long enough, or do some remain a chunin forever?\n"}
{"post_id": "14990", "novelty": true, "cluster_id": 40, "order": 1, "body_text": "How does one become a Jounin? It is said in the wiki that:\n\n...there was mention of a Jōnin Exam in the anime's Kurama Clan Arc.\n\nDoes anyone here know what are the stages/steps/missions in order to be a Jounin?\n"}
{"post_id": "19371", "novelty": true, "cluster_id": 40, "order": 2, "body_text": "Is it possible for a genin to become a jonin? In Naruto, by the end of Shippuden (ignoring the epilogue), neither Naruto nor Sasuke had ever passed the chunin exams. Given that the chunin exams seem to be held sporadically (two years between the ones in Naruto Part 1 and the ones being shown in the anime currently), it seems possible that other genin would end up in this situation. Is it possible for those genin to go directly to being jonin, or do they have to wait for possibly dozens of years (depending on how sporadically the chunin exams are held) to become a chunin first?\n"}
{"post_id": "3536", "novelty": true, "cluster_id": 40, "order": 3, "body_text": "What happened to the rest of the Academy class? In Naruto, when the academy classes are shown in the beginning, there are characters who appear who do not appear as genin later, as far as I can tell. The two characters in the second row on the right don't seem to show up later. What happens to these characters? Naruto is presented as one of the only characters to repeatedly fail, so are these characters who passed and then just never showed up again, or do they drop out of becoming ninjas?\n\n"}
{"post_id": "3892", "novelty": true, "cluster_id": 40, "order": 4, "body_text": "How long are people genin before they take the chunin exam? Team 7 (Naruto's team) existed for at least while before they took the chunin exam, and they took on a number of missions before taking the chunin exams. I can't remember, however, how long they exactly existed as a team before the exam. How long were they genin before the exam? Is that the normal length? Is there some sort of mission requirement where they have to complete a number of missions before they can take the exam?\n"}
