{"post_id": "19072", "novelty": true, "cluster_id": 403, "order": 0, "body_text": "Why do some works [anime, manga, novels] have a trailing dot? Pure curiosity.\nWhy do some series carry a dot [.] at the end of their titles?\nIs there a meaning to it or is it convention?\nEx: Ore, Twintail ni Narimasu., Kobato.\n"}
{"post_id": "24400", "novelty": true, "cluster_id": 403, "order": 1, "body_text": "Confusion about the naming of Aldnoah Zero's OST/opening/ending song titles I have a couple of very closely related questions regarding composer Hiroyuki Sawano's choices in naming Aldnoah Zero's OST/opening/ending song titles.\nI will be referencing the tracklist for Aldnoah Zero's OST (link here), in addition to some opening/closing songs that are co-composed by Hiroyuki Sawano including \"aLIEz\", \"A/Z\", and \"&Z\".\nFirst, most of the song titles include special/non-alphabetical/non-English characters (even if the title is clearly meant  an actual word like \"robot\" or \"breathless\"). Here are some examples:\n\nR零B零T\nBRE@TH//LESS\nCh19ヲFIRE★\n\nWhy did Hiroyuki Sawano decide to include all the special characters? Is there any significance in using them? To me, they are unnecessary, but I hesitate to claim that they are indeed unnecessary because they might actually have some meaning that I am not seeing.\nMy other question is why are some song titles seemingly extra-arbitrarily named? I realize that these are songs, so the composer can name them whatever he likes, but some song titles seem completely out of the blue to me. \nI realize that there are explanations for the names of some OST tracks in the wiki that I linked. \nFor example, the song \"AD2014-7.5/7.9-零・A\" is named because \"2014 07-05 / 07-09 [are] ALDONAH.ZERO's air dates on Tokyo MX and ABC respectively\". \nThe explanation tells me WHAT the song is named after, but it does not tell me WHY is the song named after something as arbitrary as an air date for the show. OST track titles usually relate to what the song actually attempts to convey to the listener, or relates to the scene in the animation, but I cannot see how an air date relates to either.\nFinally, I do not understand where the openings/ending names come from. What do the names \"aLIEz\", \"A/Z\" and \"&Z\" mean exactly, and why are they named that way?\n"}
