{"post_id": "26034", "novelty": true, "cluster_id": 500, "order": 0, "body_text": "card battle anime involving color sects I'm trying to remember an anime's name--only got a few episodes in a few years ago and lost the link. It involved some kind of card or handheld summoning/contract between these beings and humans. The main character is male and his card/contract is with a female angel. There was some larger battle between these warring sectors which were divided into colors. The angel was stranded and ended up staying at the guy's dorm room for a while.\nThis is very loose because I watched it amongst a string of other anime before my history was cleared and I could be mixing up details. The show described some event that opened up with these monsters appearing that were able to make contracts with humans. There was a female classmate he was having to hide her from and he ended up using the estranged relative excuse to keep her there. There was an scout/assassin pair that went after them for an episode or two. Another contracted pair involved a large cat/lion and a female.\n"}
{"post_id": "28851", "novelty": true, "cluster_id": 500, "order": 1, "body_text": "Need help in identifying a manga involving kids in a battle game using monsters sealed in cards This will appear to be a pretty odd question, since I honestly remember quite a lot about this series except its title. Well, frankly I only read one Tankabon of it while at a friend's house and the title did not stick with me. \nThe premise of the manga is that kids get pulled into a sort of battle game, ala Law of Ueki, but instead of powers these kids get to have monsters sealed in cards that they can summon, and its more organized, like a competition with rounds and eliminations. \nI believe that I read volume 2 or 3 of the manga.\nIn this specific issue, I can remember four specific scenes: \n\nThe MC barely won a round because he used his very powerful but uncontrollable monster. The monster was a quadruped beast, it kind of makes me think of a kirin, somehow. There was also a running gag that he trips and pulls down the pants/skirt of a female supporting character. I think this girl uses a useless-looking monster that looks like a bug.\nIt was then followed by a round that involved traffic, in the sense that they need to get from point A to point B while obeying traffic rules, if I'm not mistaken, and if I remember correctly, that round was managed by a couple of Oni dressed as policemen, and it ends with the MC obtaining a new monster card, with an ogre-like monster. It also had an aesop about caring for the monsters in the cards.\nThere was a scene where they had to go through a trap-laden castle with many treasures in the form of monster cards. I think one scene had a character finding a huge trove of cards, only to find that it was a trap, a pitfall if I'm not mistaken. I believe you need to pick up at least one card to proceed, and the MC did just that.\nFinally, I think I also remember a scene, where a female supporting character (Different from the aforementioned) who is an aspiring musician with an engrish-y nickname like \"London\" or something, ended up fighting her old bandmate who had become overweight since she last met him. This girl I think was older than the MC, and she was blonde and dressed in a sort of \"British punk\" look, with a union jack shirt or pants. If I remember correctly the guy sort of lost sight about making music, like he thought he wasn't good enough and the tournament can somehow improve his singing if he wins, with the girl calling him out on it about how you should improve your singing with your own ability. I think one of the two was using a crab-themed monster, I'm personally leaning towards the girl though.\n\nMy order of events might not be exactly correct, and I believe that the last one might have been in a separate volume. \nI can also tell, from the art style, that it is certainly shonen and from the 2000s or above, and I was quite a while ago when I read it that I doubt it was made in the 2010s, though I might be wrong. If I have to make a range, I would have to say 2005-2011.\n"}
