{"post_id": "18574", "novelty": true, "cluster_id": 55, "order": 0, "body_text": "Where was Araragi when he helped Tsubasa Tiger? So Araragi jumps out of a portal and saves Tsubasa from the History Tiger while carrying the Kaii slaying sword...\nI thought it was after traveling back to the present (Mayoi Jiangshi) but he just came back normally and he didn't even use the sword.\nI've watched up to Hitagi End and I don't see where that scene fits in.\n"}
{"post_id": "12874", "novelty": true, "cluster_id": 55, "order": 1, "body_text": "Why the title \"Second Season\"? So, the Monogatari series has four season, and soon will be five, and if we look at the production order, based on this question, and this Wikipedia page it will be: \n\nBakemonogatari (2009–2010)\nNisemonogatari (2012)\nNekomonogatari (Kuro) (2012)\nMonogatari Series: Second Season (2013)\nMonogatari Series: Second Season + α or Hanamonogatari (2014)\n\nAs you can see, \"Second Season\" is the fourth and fifth season of anime, so why the title \"Second Season\"?\n"}
{"post_id": "4695", "novelty": true, "cluster_id": 55, "order": 2, "body_text": "What is the in-universe chronological order of the Monogatari Series? I have Bakemonogatari and Nisemonogatari, and learned that Monogatari Series Second Season is being streamed by Aniplex, which means that Nekomonogatari would have been streamed at some point and that it would get a home release.\nSo, I am wondering what the story's in-universe chronological order is: should I watch Bakemonogatari, Kizumonogatari (when it's released), Nekomonogatari (when it's released), Monogatari Series Second Season (when it's released) and Nisemonogatari?\n"}
{"post_id": "9607", "novelty": true, "cluster_id": 55, "order": 3, "body_text": "In Monogatari, why is the boy with the reverse jagirinawa still alive? When Nadeko had the curse on her, she was almost going to be killed by it and it had only been a short time since she received the curse. Since the curse was removed, reversed, and was given to the boy, hasn't the curse had many months to kill him?\n"}
{"post_id": "4727", "novelty": true, "cluster_id": 55, "order": 4, "body_text": "What is the production order of the Monogatari series? It's rather confusing how the story is serialized not in the order of its events. I'd like to know the order in which the animated versions were produced.\n\nTurns out the creators of the series are very considerate towards the viewers and include several recap episodes in each season. So although the story is out of order, everything still makes perfect sense and you don't have to bother yourself by figuring out the exact timeline of the original.\n"}
