{"post_id": "3097", "novelty": true, "cluster_id": 83, "order": 0, "body_text": "Where do \"fiends\" get their abnormal strength? \"Fiends\" have tremendous killing potential, because they actively try to kill humans who cannot retaliate due to psychological and genetic safeguards against violence. \nHowever, I have not seen anything that indicates that they have a particularly powerful Cantus. Is their ability not the same as that of a regular human?\nI am raising this doubt, because\n\n Maria and Mamoru's daughter could defeat the strongest Cantus user in the village at such a young age.\n\nDid I perhaps miss some information that indicates that Fiends are much stronger for some reason?\n"}
{"post_id": "6025", "novelty": true, "cluster_id": 83, "order": 1, "body_text": "Why are ogres so strong? As far as I know Ogres and Karmic demons are regular humans who (explained in conventional terms) have suffered and become full blown Sociopaths and heavily depressed individuals, respectively, who use all their might in throwing and restraining, again respectively, all their power at those surrounding them, but one way (consciously) or another (unconsciously) it goes out and hurts others.\nMy first question is: Does this affect anybody or just a few?\nThe Second question is more a set of questions than anything:\nIf just a few, then who? Talented/powerful people?\nIf everybody, then does that mean that the world was filled with Ogres and Karmic Demons before the current order came in to place? If so, when why did the false Minoshiro (whatever that means) forgot to mention it? Or did I forget to watch it in the 3 times I watched the episode?\nBut the one thing that bothers me the most, which is basically based off all the previous questions is my third and last question: Why the hell are Ogres so goddamn powerful?\nI mean, look at the Messiah, child of Maria and Mamoru, taken off them by Yakomaru.\nThe first and only human kid the rats get in their hands on, breed to adolescence (which is when they get their powers) and turns out to be a killing sociopath with powers as immense as the most powerful dude in the village. This case essentially brings up all the previous questions I asked, which if you didn't notice, is driving me mad.\nSo, does anyone have any answers?\n"}
