{"post_id": "2604", "novelty": true, "cluster_id": 99, "order": 0, "body_text": "What happened at the end of the Anime/Manga Monster? I don't understand where Yohan went after he \"mysteriously\" got out of the hospital.  Dr. Tenma seems to be finally ok and I don't understand how after all this, Yohan still lived.  He was the one who caused all this evil in the first place!\nA fantastic Anime, but a confusing one at the end. Can someone explain what happened?\n"}
{"post_id": "7167", "novelty": true, "cluster_id": 99, "order": 1, "body_text": "Definitive answer whether Johan wakes up to question Tenma or its a hallucination When, Dr Tenma visits a comatose Johan in hospital, we see a scene where Johan wakes up from coma to ask an existential question, which contrasts with this philosophy that life is inherently meaningless. Tenma does not answer; we cut to a scene where Tenma is panting in a cold sweat over a comatose Johan.\nWhich of these interpretations is true:\n\nTenma has hallucinated it entirely and Johan has never gained a conscious state, much less walked away\nJohan has indeed woken up and questioned Tenma and later escaped. \nThe screenwriter (or Manga artist) has made this a perfect ambiguity\n\n\nBackground\nThe scene seems open to interpretation as I later discovered. The contrasting interpretations:\n\nI infer that Tenma hallucinated this entirely as in the next scene Johan appears to not have ever stirred. Tenma feels safe leaving him alone. Tenma hallucinated this, overcome by understanding the reason for Johan's bitter life philosophy.\nPopular Wikia author (quoted below) says that there is a possibility that its for real(Johan woke up, questioned Tenma, went back to sleep while Tenma is in a cold sweat, then later leaves the building). This is supported by the fact that Johan leaves his bed by escape(or death; as the same article presents this ambiguity), proving that he was physically capable of doing so.\n\nFrom http://obluda.wikia.com/wiki/Johan_Liebert\n\n...end of the series, Tenma paid Johan a visit in the state police\n  hospital, where he had been unconscious ever since the massacre. After\n  being informed that he had [a] name, Johan sat up and began talking to\n  Tenma, retelling the story of his mother's choice and asking which\n  child wasn't needed. It is unclear whether this was a\n  hallucination that Tenma experienced or if it was actually real.\n\nand \n\nHis mother's true sentiments while making the switch might have been\n  frightening for Johan, leaving him to question the scene for years to\n  come.  However, if that segment is to be interpreted as a\n  hallucination by Tenma, this might not be the case.\n\n"}
